{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2013/06/tax_breaks_pour_salt_on_tuition_wound.php",
    "short_url": "http://rdd.me/v5o1hzcg",
    "author": "Sydney Brownstone",
    "excerpt": "Even though Cooper Union will begin charging tuition to the class of 2014, breaking with its 111-year tradition--and, some say, mission--of keeping education free, the school will still be receiving&hellip;",
    "direction": "ltr",
    "word_count": 399,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"></span>Even though Cooper Union will begin charging tuition to the class of 2014, breaking with its 111-year tradition--and, some say, mission--of keeping education free, the school will still be receiving special tax breaks from the city, an issue that an <a href=\"http://ibo.nyc.ny.us/cgi-park/?p=698\" target=\"_blank\">Independent Budget Office analysis</a> has critiqued. And no, we're not just talking about gifted rent from the Chrysler building, either. </p>\n\n<p>In addition to the land beneath the Chrysler building, Cooper Union also maintains special tax breaks on 51 Astor Place--the site of that new, god-awful office building--and 22-36 Astor Place, a former parking lot. While Cooper Union obtained 22-36 Astor Place, which used to be city property, on the agreement that it would be used for \"educational purposes\" in 1959, it later leased the land to real estate developers who built 21 stories of \"<a href=\"http://www.astorplacenyc.com/\" target=\"_blank\">museum quality architectural loft residences</a>\" on top of it. <br></p>\n<a name=\"more\"></a>\n<p>In order to commercialize these properties, Cooper Union first had to \"win zoning changes from the City Planning Commission,\" the IBO's Doug Turetsky <a href=\"http://ibo.nyc.ny.us/cgi-park/?p=698\" target=\"_blank\">writes</a>. To justify that decision, the school argued it needed the funds to provide free tuition to its students, along with a new engineering building. Initially, the city disagreed with the idea that 51 Astor Place be used for something other than schooling Cooper Union students, but the Bloomberg administration settled with the institution in 2007, when Cooper Union agreed to pay $980,000 in service of maintaining a bigger tax break.</p>\n\n<p>\"It's not like the tax break was contingent upon the free tuition,\" Turetsky tells the <em>Voice</em>. \"But on the other hand, the tax break enabled Cooper Union to do these commercial deals, which generated revenue that at least in the past [has] been able to provide tuition free education for their students.\"</p>\n\n<p>Losing \"tax advantages\" over a decision to charge tuition or reinvent the school was a concern brought up at a September Cooper Union trustee meeting, in which board members debated <a href=\"http://blogs.villagevoice.com.meme4all.com/runninscared/2013/05/cooper_union_secret_transcript.php\" target=\"_blank\">shuttering the institution altogether</a>.</p>\n\n<p>The tax breaks are a particularly unusual set-up, Turetsky adds, when you consider the fact that the city's own public university system has seen consistent tuition hikes. Unlike other schools, Cooper Union's property tax break doesn't require that classes or other school activities be held on site. The IBO estimates that the city has forfeited $2.1 million in taxes from 22-36 Astor Place this year alone. <br><em><br>\nSend your story tips to <a href=\"mailto:sbrownstone@villagevoice.com\">sbrownstone@villagevoice.com</a>. Follow her on Twitter <a href=\"https://twitter.com/sydbrownstone\" target=\"_blank\">here</a>.</em><br></p>                                                                        <article-signup type=\"email\" size=\"large\"></article-signup>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                </div>",
    "date_published": "2013-06-10 02:30:08",
    "dek": null,
    "lead_image_url": null,
    "title": "Cooper Union's 'Unusual' Tax Breaks Pour Salt on Tuition Wound",
    "rendered_pages": 1
}