{
    "domain": "blogs.wsj.com",
    "next_page_id": null,
    "url": "http://blogs.wsj.com/metropolis/2012/12/04/students-barricaded-in-cooper-union-livestream-protest/",
    "short_url": "http://rdd.me/vzopzhvu",
    "author": "Lisa Fleisher",
    "excerpt": "Students that have barricaded themselves inside Cooper Union&#x2019;s landmark Foundation Building on Cooper Square are livestreaming their protest of the college&#x2019;s plan to bolster its&hellip;",
    "direction": "ltr",
    "word_count": 238,
    "total_pages": 0,
    "content": "<div><div class=\"articlePage\">\n                <p>Students that have barricaded themselves inside Cooper Union&#x2019;s landmark Foundation Building on Cooper Square are <a href=\"http://www.livestream.com/occupynyc\">livestreaming their protest</a> of the college&#x2019;s plan to bolster its finances by charging tuition for graduate programs.</p>\n<p>The students planned the action for a month before 11 of them barricaded themselves inside the Peter Cooper suite Monday at noon, said Casey Gollan, a 21-year-old senior. One student journalist from the New School is also with them.</p>\n<p>&#x201C;We have a lot of supplies up here,&#x201D; Gollan said. &#x201C;We&#x2019;re not in a position where we feel like we need to leave until we have things addressed.&#x201D;</p>\n<p>Several faculty members joined some students at a press conference Tuesday afternoon outside the building to say they supported the Cooper Union&#x2019;s mission statement, which says the college awards full scholarships to undergraduates.</p>\n<p>They have three demands, including the resignation of the college&#x2019;s new President Jamshed Bharucha. The students also want the college to reaffirm its commitment to free education and to give them a say in college governance.</p>\n<p>University officials didn&#x2019;t return several requests for comment.</p>\n<p>Facing a mounting deficit, the college <a href=\"http://online.wsj.com/article/SB10001424052970204528204577010510822950308.html?KEYWORDS=%22cooper+union%22\">floated the idea in November 2011 of charging tuition</a> but students and faculty members immediately fought back.</p>\n<p>Instead, the school&#x2019;s trustees decided to expand its<a href=\"http://online.wsj.com/article/SB10001424052702303592404577364434200598276.html\"> 60-student graduate program and charge tuition.</a></p>\n<p>Gollan said students have been particularly unhappy with what they see as a lack of communication from the new president, who took over in July 2011.</p>\n      \n            </div>\n          </div>",
    "date_published": "2012-12-04 14:41:00",
    "dek": null,
    "lead_image_url": "http://s.wsj.net/img/WSJ_profile_lg.gif",
    "title": "Students Barricaded in Cooper Union, Livestream Protest",
    "rendered_pages": 1
}