{
    "domain": "www.theepochtimes.com",
    "next_page_id": null,
    "url": "http://www.theepochtimes.com/n2/united-states/student-barricade-building-floor-at-nyc-college-to-protest-tuition-321499.html",
    "short_url": "http://rdd.me/d4sqnifr",
    "author": "Amelia PangEpoch Times Staff",
    "excerpt": "By Amelia PangEpoch Times Staff Created: December 3, 2012 Last Updated: December 3, 2012 NEW YORK&#x2014; After two years of planning, 12 Cooper Union students barricaded themselves on the top floor&hellip;",
    "direction": "ltr",
    "word_count": 698,
    "total_pages": 0,
    "content": "<div><p id=\"article-author\" class=\"clearfix\">\n\t\t<span class=\"author\"> By Amelia Pang<br><span>Epoch</span> Times Staff</span>\n\t\t\t\t\t\t<span class=\"date\"><i>Created:</i> December 3, 2012</span>\n\t\t\t\t\t\t<span class=\"date\"><i>Last Updated:</i> December 3, 2012</span>\n\t\t\t</p>\n        <div id=\"article\">\n\t\t\t \t \n<p>NEW YORK&#x2014; After two years of planning, 12 Cooper Union students barricaded themselves on the top floor of the foundation building to protest tuition charges. The students have been there since noon of Dec. 3, and say they have enough supplies to stay for at least three days.</p>\n<p>The school was founded in 1859 by Peter Cooper, who believed that education should be accessible to all who qualify regardless of race, religion, gender, and social status. Admission is highly competitive.</p>\n<p>The historically tuition-free institution decided in April that it will begin charging tuition for graduate students starting in September 2013. The school is considering charging undergraduates as well, but is still open to new ideas that will keep undergraduate tuition free.</p>\n<p>The Students for a Free Cooper Union argue that all tuition can be avoided if the school were transparent with its finances and did not spend money prodigally on a new academic building.</p>\n<p>&#x201C;We have reclaimed this space because we believe [President Bharucha is] leading the college in the wrong direction,&#x201D; the group states. &#x201C;An expansionist strategy and lack of accountability have put this college in a financial deficit, and we reject the current style of governance that emulates those failures.&#x201D;</p>\n<p>The students demand that Jamshed Bharucha, the president of Cooper Union, step down from his position.</p>\n<p>The protesters said they are not willing to negotiate. They demand the school appoint a student and faculty member from each of their three schools as voting members of the board in order to maintain transparency. They also request the school implement a process in which board members can be removed if the Cooper Union students, faculty, alumni, and administrators find it necessary.</p>\n<p>Entrances to the foundation building are currently secured by wood and steel barricades. One of the students inside is certified in first aid and CPR. The group emphasized that the barricades are easily removable from the inside and are designed not to damage the building.</p>\n<h2><blockquote><p>An expansionist strategy and lack of accountability have put this college in a financial deficit, and we reject the current style of governance that emulates those failures.</p></blockquote></h2>\n<h2>Summit on Education and Debt</h2>\n<p>The protesters are currently setting up a live video stream on the Internet and are planning a summit on debt and education. The public summit includes lectures and performances by Peter Buckley, a historian and Cooper Union faculty; Marina Sitrin, a sociologist and writer; and Amin Husain, a lawyer and artist, followed by a candlelight vigil.</p>\n<p>The summit addresses the overall issue of rising costs of higher education, and the history of student protest movements.</p>\n<p>The national average price of tuition, fees, and room and board have reached $12,110 at public four-year colleges after financial aid and tuition tax credits are deducted, according to College Board. Full tuition is $17,860 a year on average. Private institutions charge $23,840 on average after financial aid is taken into account, and $39,518 without financial aid.</p>\n<p>The summit will be held at the Great Hall, where figures such as President Lincoln and Obama have spoken in the past.</p>\n<p>&#x201C;The president (Bharucha) has not tried to reach us, we expect to be here for a little bit,&#x201D; said Victoria Sobel, 22, one of the protesters.</p>\n<p>So far, the school&#x2019;s administration has contacted them only to make sure all participants were safe and no one was being held their against their will. </p>\n<p>&#x201C;Since the knowledge of financial difficulties last year, we&#x2019;ve had dozens of dozens of meetings with students faculty,&#x201D; said Claire McCarthy, the director of Cooper Union public affairs. McCarthy went on to say that the details of the school&#x2019;s financial struggles are not limited to expansion policies, and can all be found on the website.</p>\n<p>At this point, she is not aware if the school plans on meeting any of the students&#x2019; demands.</p>\n<p>&#x201C;Twelve is a small group of students. We have 1,000 students,&#x201D; McCarthy said. &#x201C;I don&#x2019;t think they are a representative of our entire student body or faculty.&#x201D;</p>\n<p><em>The Epoch Times publishes in 35 countries and in 19 languages. </em><a href=\"http://newsletter.theepochtimes.com/?welcome\" target=\"_blank\"><em>Subscribe to our e-newsletter.</em></a></p>\n<p><em>Please send news tips to </em><a href=\"mailto:nyc_news@epochtimes.com\"><em>nyc_news@epochtimes.com</em></a></p>\n\n \n \t\t\t\t \t\t\t\t  \n\t\t\t  </div>\n        \n\n\t\t </div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": null,
    "title": "Student Barricade Building Floor at NYC College to Protest Tuition",
    "rendered_pages": 1
}