{
    "domain": "eastvillage.thelocal.nytimes.com",
    "next_page_id": null,
    "url": "http://eastvillage.thelocal.nytimes.com/2012/12/03/cooper-union-occupiers-cheered-by-fellow-students-contacted-by-administration/",
    "short_url": "http://rdd.me/q4aerdld",
    "author": "DANA VARINSKY",
    "excerpt": "Students occupying the school’s Peter Cooper Suite Skype into a community summit downstairs in the Great Hall. A dozen Cooper Union students currently occupying the school’s Foundation Building were&hellip;",
    "direction": "ltr",
    "word_count": 289,
    "total_pages": 0,
    "content": "<div class=\"entry-content\" score=\"32.5\">\n\t\t\t<div class=\"w500\"><a href=\"http://www.flickr.com/photos/local-east-village/8243804382/\" title=\"photo(42) by The Local East Village Flickr, on Flickr\"><img src=\"http://farm9.staticflickr.com/8210/8243804382_7f7e87ed6a.jpg\" width=\"500\" alt=\"photo(42)\"></a> <span class=\"caption\">Students occupying the school’s Peter Cooper Suite Skype into a community summit downstairs in the Great Hall.</span></div>\n<p>A dozen Cooper Union students currently <a href=\"http://eastvillage.thelocal.nytimes.com/2012/12/03/cooper-union-students-barricade-themselves-into-school-building/\">occupying the school’s Foundation Building</a> were met with an enthusiastic round of applause when they joined a community summit via Skype this evening.</p>\n<p>During their brief appearance, they urged their peers, who had gathered for a series of presentations about higher education and student debt, to continue protesting tonight and throughout the day tomorrow.</p>\n<p>The occupiers also informed summit attendees about a document, reprinted below, that came into their possession, which outlines four possible plans for implementing undergraduate tuition.<br><span id=\"more-41601\"></span></p>\n<div class=\"w190 right\"><a href=\"http://www.flickr.com/photos/local-east-village/8242733963/\" title=\"photo(41) by The Local East Village Flickr, on Flickr\"><img src=\"http://farm9.staticflickr.com/8482/8242733963_e4a24457ea_m.jpg\" width=\"180\" alt=\"photo(41)\"></a> <span class=\"caption\">Vanessa Haddad lights candles.</span></div>\n<p>Tyler Paige, one of the 12 barricaded inside, told The Local that the students were prepared to remain in the suite indefinitely. “We will say here either until our demands are met or until we are forcibly removed. We are not compromising on any of our principles,” he said. </p>\n<p>Earlier today, students pressed their bodies against doors when a maintenance worker seemed to be attempting to force them open, Mr. Paige said. “We told them if they were going to cut through the door, they were going to cut through students,” he said.</p>\n<p>According to Mr. Paige, the only other communication the occupiers have received from the school was from T.C. Westcott, Cooper Union’s Treasurer and Vice President of Finance and Administration. Mr. Paige said Ms. Westcott wanted to ensure that the students could easily exit the building in case of an emergency.</p>\n<p>After the summit, Cooper Union students and alumni lit candles in the shape of the word “Free” on the ground outside the Foundation Building. The students occupying the top floor looked down at the lights and waved to those below.</p>\n<p><a title=\"View 115417355-CU-Tuition on Scribd\" href=\"http://www.scribd.com/doc/115417937/115417355-CU-Tuition\">115417355-CU-Tuition</a></p>\n\t\t</div>\n\t",
    "date_published": "2012-12-03 23:55:00",
    "dek": null,
    "lead_image_url": "http://farm9.staticflickr.com/8210/8243804382_7f7e87ed6a.jpg",
    "title": "Cooper Union Occupiers Cheered By Fellow Students, Contacted By Administration",
    "rendered_pages": 1
}