{
    "domain": "gothamist.com",
    "next_page_id": null,
    "url": "http://gothamist.com/2013/05/09/cooper_union_students_hope_to_mobil.php",
    "short_url": "http://rdd.me/cu61wode",
    "author": "Gothamist",
    "excerpt": "fullscreen",
    "direction": "ltr",
    "word_count": 761,
    "total_pages": 0,
    "content": "<div><div class=\"entry-body\">\n\t\n\t<div class=\"galleryEase\" id=\"gallery-gallery_value\">\n\n<a name=\"gallery\"></a>\n<div class=\"galleryEaseDisplayed\">\n<div id=\"imgContainer\">\n    <img id=\"galleryImg\"><span id=\"fullLaunch\" class=\"ir btn-fullscreen-thumb\">fullscreen</span>\n</div>\n\n\n\n</div>\n<div class=\"galleryEaseThumbs\">\n\n<img src=\"http://galleries.gothamistllc.com/asset/518beacecd65782f74c96fb5/square/BN6A1136.JPG\" title=\"\" id=\"photo_1\" class=\"galleryEaseActiveThumb\" width=\"76\"><img src=\"http://galleries.gothamistllc.com/asset/518beacecd65782f74c96fb5/square/BN6A1161.JPG\" title=\"\" id=\"photo_2\" class=\"galleryEaseActiveThumb\" width=\"76\"><img src=\"http://galleries.gothamistllc.com/asset/518beacecd65782f74c96fb5/square/BN6A1162.JPG\" title=\"\" id=\"photo_3\" class=\"galleryEaseActiveThumb\" width=\"76\"><img src=\"http://galleries.gothamistllc.com/asset/518beacecd65782f74c96fb5/square/BN6A1205.JPG\" title=\"\" id=\"photo_4\" class=\"galleryEaseActiveThumb\" width=\"76\"><img src=\"http://galleries.gothamistllc.com/asset/518beacecd65782f74c96fb5/square/BN6A1229.JPG\" title=\"\" id=\"photo_5\" class=\"galleryEaseActiveThumb\" width=\"76\"><img src=\"http://galleries.gothamistllc.com/asset/518beacecd65782f74c96fb5/square/BN6A1263.JPG\" title=\"\" id=\"photo_6\" class=\"galleryEaseActiveThumb\" width=\"76\"><img src=\"http://galleries.gothamistllc.com/asset/518beacecd65782f74c96fb5/square/IMG_9649.JPG\" title=\"\" id=\"photo_7\" class=\"galleryEaseActiveThumb\" width=\"76\"><img src=\"http://galleries.gothamistllc.com/asset/518beacecd65782f74c96fb5/square/IMG_9669.JPG\" title=\"\" id=\"photo_8\" class=\"galleryEaseActiveThumb\" width=\"76\"><div class=\"lightbox\">\n    \n    <div class=\"clearfix lb-body\">\n        <div class=\"lb-body-inner\">\n            <span class=\"ir btn-close\">close</span>\n            <div id=\"lb-logo\"><img src=\"http://assets.gothamistllc.com/logos/2012/Gothamist.png\"></div>\n            \n            \n        </div>\n    </div>\n</div>\n</div></div>\n\t\n\t<p>Cooper Union students are continuing their <a href=\"http://gothamist.com/2013/05/08/cooper_union_students_occupy_presid.php\">occupation of president Jamshed Bharucha's office</a> over tuition at the traditionally tuition-free school. Last night, about 100 supporters gathered at a rally outside the main building.  In addition to those attending the embattled school, there were students from Columbia, NYU, and Hunter College present, many reading statements of support and solidarity.  A spirited march looped around the main building and concluded the rally with chants, cheers, and a crooning saxophone.  </p><p>\nPolice were on hand, although their presence was not due to the student occupation or rally, but because Mayor Bloomberg was speaking at the Fund for the City of New York Public Service Awards in the Great Hall, just a few floors below what is described as a peaceful sit-in.</p>\n\n<p>With finals taking place during the next week and graduation coming up on May 29 (when Bloomberg is to appear at the school again, this time to deliver the commencement address) it's anyone's guess how long the current occupation could last.  Unlike the previous action, the students are not barricaded into a room; the doors to Bharucha's office are open, with anyone free to come or go, although Bharucha himself has not yet appeared.  His absence didn't seem to matter much to Kristi Cavataro, a second-year art student, \"We were prepared to go in no matter what&#x85;the main action was to conduct the vote of no confidence.\"  </p>\n\n<p>Indeed, many students stopped by during the day to add their signatures to the long, scroll-like document, which bore 285 names 12 hours into the occupation.  Faculty members were presented with a separate statement of no confidence, with about 50% of full-time professors signing.  </p>\n\n<p> As of midnight, the students had spread out to the larger office area surrounding the initial occupation site, doubling their space, and planned to hold the outer offices throughout the following day. </p>\n\n<p>Victoria Sobel was one of the 11 students who were <a href=\"http://gothamist.com/2012/12/03/11_students_protesting_tuition_barr.php\">barricaded into the Peter Cooper Suite for a week</a> in December, \"A lot of [our goals] are open-ended depending on the short- middle- and long-term reactions of the administration&#x85;the immediate was to pass the vote of no confidence of the students and the faculty of the School of Art and the second was to make the call for the other schools, both students and faculty, to similarly pass.\"</p>\n\n<p>Beyond Cooper, though, the occupiers aim to engage students and faculty at other city colleges to embrace similar actions of no confidence if they are deemed appropriate.  Indeed, <a href=\"http://nyulocal.com/on-campus/2013/05/03/breaking-gallatin-professors-vote-no-confidence-in-nyu-president-john-sexton/\">NYU president John Sexton has been the recipient</a> of two from faculty, the latest on May 3rd. </p>\n\n<p>\"We want to continue building consciousness around the issues not only at Cooper, but around the city, and on a more Cooper-specific level, we ultimately want the decision about the tuition being implemented to be overturned&#x2014;and the way the students see that now is that can only be instrumentalized by the removal of Jamshed, or him stepping down of his own accord, and moving for a drastic restructuring of his board or whatever administrative body that might replace that existing body,\" Sobel said.  \"Maybe it isn't having a board of 22 old white men over 60 that have a real generational, ideological disconnect from their community.  There's just an innate scenario, not just at Cooper, but at any school&#x2014;that's never going to spell out a community.\"  </p>\n\n<p> So far, the moods of students, administration, and security have been restrained. \"Security have been sitting in the office with us.  They've asked us to leave, but they're not forcing us out,\" Cavataro said.  She noted that among the familiar faces on the staff were some newer guards, who she said were hired after the previous student occupation.  \"There was a high security presence on May Day, with armed guards, and no announcement about that was made by the school.\"</p>\n\n<p>\"We very clearly want&#x2014;even though we've had altercations with the private security&#x2014;we don't want this to be about students versus private security, or students versus police.  That's a very easy way for an administration or any body of power to kind of derail any kind of protest or form of free speech,\" explained Sobel.  \"That's been a tactic of this administration, to be very absent and in their place to substitute high levels of security, and so the anger becomes misplaced from the students to the private security or to the worker, the laborer, the police officer, and so you won't feel angry about the administration, you'll feel angry about the oppressive system of armed security.  We're resisting that.\"</p>\n\n<p><em>By Ellen Moynihan</em></p>\n\t\n\t\n\t\n\t\n\t\n</div>\n\n\n</div>",
    "date_published": "2013-05-09 16:02:00",
    "dek": null,
    "lead_image_url": "http://galleries.gothamistllc.com/asset/518beacecd65782f74c96fb5/square/BN6A1136.JPG",
    "title": "Cooper Union Students Hope To Mobilize Other Students To Fight The Man",
    "rendered_pages": 1
}