{
    "domain": "newyork.cbslocal.com",
    "next_page_id": null,
    "url": "http://newyork.cbslocal.com/2012/12/04/cooper-union-students-take-over-university-clock-tower-to-protest-tuition-changes/",
    "short_url": "http://rdd.me/bjqcgz9y",
    "author": null,
    "excerpt": "NEW YORK (CBSNewYork) – Eleven students are taking a stand, protesting a change to their unique college tuition that is currently free. Students who seized Cooper Union University‘s clock tower on&hellip;",
    "direction": "ltr",
    "word_count": 386,
    "total_pages": 0,
    "content": "<div class=\"entry-content-textbox\" score=\"41.25\">\n\t\t\t\t\t\n\n<p><strong>NEW YORK (CBSNewYork) –</strong> Eleven students are taking a stand, protesting a change to their unique college tuition that is currently free.</p>\n<p>Students who seized <a href=\"http://newyork.cbslocal.com/2011/11/03/st-marks-bookshop-to-remain-open-after-reaching-deal-with-cooper-union/\">Cooper Union University</a>‘s clock tower on Monday afternoon said they won’t come out until their demands are met, CBS 2′s Amy Dardashtian reported.</p>\n<p>“We’ve brought up enough supplies to last us until we see change or otherwise,” student Victoria Sobel said.</p>\n<p>“We’re going to stay as long as we need to,” senior Casey Gollan told 1010 WINS. “We did a lot of logistics planning so we’ve designed barriers that we think can withstand outside invasion and we’ve brought food for days.”</p>\n<p>The protest was spurred on by the university’s decision in April to <a href=\"http://newyork.cbslocal.com/2011/11/01/cooper-union-considers-charging-tuition/\">charge graduate students tuition for the first time in its more than 100-year history</a>.</p>\n<p>Students fear undergraduates may soon be charged too.</p>\n<p>“We are demanding that the school publicly reaffirm its mission statement of providing free education to all and that President Jamshed Bharucha step down,” student Joe Riley said.</p>\n<p>The students said they’re fighting to preserve the school’s founding principles to offer a specialized education in engineering, art and architecture without the financial burden.</p>\n<p>“So many people wouldn’t be able to go here anymore and those are the people who have the most talent,” student Hunter Mayton said.</p>\n<p>Maintenance crews unsuccessfully tried to enter the clock tower on Monday. The students later suspended the elevator.</p>\n<p>On Tuesday, detectives arrived to investigate possible charges.</p>\n<p>“That’s something we have all discussed as a group and are willing to face as it comes,” Sobel said.</p>\n<p>The university said there are no plans to press charges or suspend the students.</p>\n<p>“Cooper Union has always been supportive of freedom of expression and peaceful demonstrations,” Jolene Travis, the university’s assistant director of communications, said. “We want to know and hear from the students.”</p>\n<p>While the students remain barricaded in the clock tower, there are various student groups on the ground to show their support.</p>\n<p>They plan to hold a press conference to voice their frustration that the university still hasn’t responded to student demands.</p>\n<p>The university said it plans to meet with the students later Tuesday.</p>\n<p>“We actually don’t want to talk,” Gollan said. “We put out demands and we’re tired of the fact that the administration here is all talk and no action.”</p>\n\n\n\t\t\t\t</div>\n\n\t\t\t\t\n\t\t\t\t",
    "date_published": "2012-12-04 12:18:00",
    "dek": null,
    "lead_image_url": "http://cbsnewyork.files.wordpress.com/2012/12/cooper-union-protest.jpg?w=260",
    "title": "Cooper Union Students Take Over University Clock Tower To Protest Tuition Changes",
    "rendered_pages": 1
}