{
    "domain": "www.workers.org",
    "next_page_id": null,
    "url": "http://www.workers.org/2013/05/22/cooper-union-students-seize-presidents-office/",
    "short_url": "http://rdd.me/ltvfu8fw",
    "author": "Caleb T. Maupin",
    "excerpt": "May 15 protest at Cooper Union.WW photo: Anne Pruden May 20 &#x2014; The Cooper Union for the Advancement of Society and Art is a New York City college that has long been associated with progressive&hellip;",
    "direction": "ltr",
    "word_count": 728,
    "total_pages": 0,
    "content": "<div><div class=\"pf-content\"><div id=\"attachment_9017\" class=\"wp-caption alignright\"><a href=\"http://i1.wp.com/www.workers.org/articles/wp-content/uploads/2013/05/cooper_union_0530.jpg\"><img class=\"size-medium wp-image-9017\" alt=\"May 15 protest at Cooper Union.WW photo: Anne Pruden\" src=\"http://i1.wp.com/www.workers.org/articles/wp-content/uploads/2013/05/cooper_union_0530.jpg?resize=300%2C258\"></a><p class=\"wp-caption-text\">May 15 protest at Cooper Union.<br>WW photo: Anne Pruden</p></div>\n<p>May 20 &#x2014; The Cooper Union for the Advancement of Society and Art is a New York City college that has long been associated with progressive politics and activism. The college was a center of the abolitionist movement, and Abraham Lincoln gave a historic anti-slavery address there in 1860. In more recent times, Latin American anti-imperialist leaders Hugo Ch&#xE1;vez and Evo Morales have spoken in the school&#x2019;s famous Great Hall.</p>\n<p>The college has always been free. Every student who attends Cooper Union is given a 100 percent scholarship by the school&#x2019;s foundation. Peter Cooper, the college&#x2019;s founder, argued that education should be &#x201C;free and equal&#x201D; for all. The prestigious school has one of the most selective admissions in the country.</p>\n<p>However, starting in the fall of 2014, each new student will be expected to pay tuition of more than $20,000 per year.</p>\n<p>The administration cites financial troubles as the impetus for this change. It has been revealed that $103 million of the school&#x2019;s resources were invested in hedge funds, and that $2 million was paid per year to the hedge fund managers. Most of this money was lost in the financial collapse of 2008. (Village Voice, May 17)</p>\n<p>The charging of tuition breaks with Cooper Union&#x2019;s 154-year tradition of free education for its highly qualified students. However, in accordance with the school&#x2019;s progressive tradition, the students have not accepted this economic attack. An organization calling itself &#x201C;Free Cooper Union&#x201D; has been formed.</p>\n<p>In December, the students seized the Peter Cooper Suite, located on the top floor of the campus&#x2019;s main building. The students nailed the doors to the suite shut with wooden planks, and unfurled a large banner saying &#x201C;Free Cooper Union&#x201D; from the top of the building. Solidarity rallies were held outside, with support from all across the city. However, the administration ignored the protest.</p>\n<p>Class continued as usual, and the fall semester ended.</p>\n<p>Now, at the end of the spring semester, more than 100 students and faculty from Cooper Union began occupying the office of the college president, Jamshed Bharucha, on May 9. The large group linked arms and packed into the very small office demanding that Cooper Union remain tuition-free.</p>\n<p>This 24/7 occupation continues, with large numbers of students and faculty members defying the administration. Huge numbers of police and security guards have been set up all around the school. Security guards are even stationed outside of the bathrooms, monitoring who goes in and out, according to the &#x201C;Free Cooper Union&#x201D; Facebook page.</p>\n<p>Rallies outside of Cooper Union have been called, with students from various nearby campuses showing their support. The Student Senate of New York University passed a resolution in support of the Cooper Union Occupation. Students from Columbia University, the City University of New York and numerous other campuses around the city have rallied in support of the occupation.</p>\n<p>President Bharucha made a big public relations show of meeting with the students on May 14, as the occupation continued. He blamed the situation on alumni, who, he claimed, did not donate enough. A Cooper Union trustee who accompanied Bharucha began addressing the students, saying, &#x201C;I did my share of demonstrations in the [19]50s and [19]60s.&#x201D; The students shouted him down, saying his words were condescending.</p>\n<p>In addition to keeping the school tuition-free, students are also demanding more representation in administrative procedures. This demand for &#x201C;student syndicalism&#x201D; has been a popular rallying cry for student protesters for more than a generation. In the 1960s, radical students in the U.S. demanded control over their universities, inspired by the actions of the Red Guard youth in China during the Great Proletarian Cultural Revolution, who fought for and achieved it in various parts of the country.</p>\n<p>Rallies outside the school in support of the occupiers continue. The students have tried to build solidarity with other radical forces on the Lower East Side of New York, where Cooper Union is located. One recent solidarity march began at the site of Charas, a community center that was once a center for culture and resistance among New York City&#x2019;s Latino/a community.</p>\n<p>One sign carried at many of the solidarity rallies outside of the occupied office states clearly what millions of young people &#x2014; not just in New York City, but around the country &#x2014; feel: &#x201C;Education should not be a debt sentence!&#x201D;</p>\n</div></div>",
    "date_published": "2013-05-22 00:00:00",
    "dek": null,
    "lead_image_url": "http://i1.wp.com/www.workers.org/articles/wp-content/uploads/2013/05/cooper_union_0530.jpg?resize=300%2C258",
    "title": "Cooper Union students seize president’s office",
    "rendered_pages": 1
}