{
    "domain": "eastvillage.thelocal.nytimes.com",
    "next_page_id": null,
    "url": "http://eastvillage.thelocal.nytimes.com/2012/12/05/hope-floats-watch-cooper-union-students-deliver-well-wishes-by-balloon/",
    "short_url": "http://rdd.me/ibzfj6j8",
    "author": "ANNIE FAIRMAN",
    "excerpt": "Earlier today Cooper Union students stormed a board meeting and then headed over to Cooper Triangle to deliver messages, by balloon, to eleven colleagues, plus a New School student, holed up in the&hellip;",
    "direction": "ltr",
    "word_count": 233,
    "total_pages": 0,
    "content": "<div class=\"entry-content\" score=\"33.75\">\n\t\t\t\n<p>Earlier today Cooper Union <a href=\"http://eastvillage.thelocal.nytimes.com/2012/12/05/students-disrupt-cooper-union-board-meeting-with-sobs-songs-plus-more-balloons/\">students stormed a board meeting</a> and then headed over to Cooper Triangle to deliver messages, by balloon, to eleven colleagues, plus a New School student, holed up in the school’s Peter Cooper Suite. We now have video footage of the air-mail operation. </p>\n<p>After writing messages on index cards, stringing ribbons through them, and floating them up to the eighth floor, about 20 students marched in circles while chanting: “Where’s our president?” The group formed a ring held together by reams of plastic wrap that group spokesperson Audrey Snyder said were meant to “demonstrate our need for transparency.”</p>\n<p>The commanding officer of the Ninth Precinct, Deputy Inspector John Cappelmann, briefly looked on along with Detective Jaimie Hernandez of the precinct’s Community Affairs department.<br><span id=\"more-41726\"></span></p>\n\n<p>After the march, students gathered as Ms. Snyder spoke with a representative of the Board of Trustees. The crowd thinned out, and a van pulled into Cooper Square with equipment for an event at the Great Hall later this evening for the Fund for the City of New York.</p>\n<p>The group planned to project a live video feed of the students locked inside of the building at 4:30 p.m., with a candlelit vigil to follow.</p>\n<p>“People are really committed to their work here and what we’re ultimately defending is our studies here, and our ability to be here, and to work, in all three disciplines,” said Ms. Snyder.</p>\n\n\t\t</div>\n\t",
    "date_published": "2012-12-05 18:20:00",
    "dek": null,
    "lead_image_url": null,
    "title": "Hope Floats! Watch Cooper Union Students Deliver Well Wishes By Balloon",
    "rendered_pages": 1
}