{
    "domain": "www.salon.com",
    "next_page_id": null,
    "url": "http://www.salon.com/2012/12/06/why_care_about_cooper_union/",
    "short_url": "http://rdd.me/oizlxy3w",
    "author": "Natasha Lennard, AP",
    "excerpt": "Cooper Union occupied (via @FreeCooperUnion Twitter feed) Since Monday,&#xA0; eleven undergraduate students have expertly barricaded themselves inside the top floor of New York&#x2019;s Cooper Union&hellip;",
    "direction": "ltr",
    "word_count": 729,
    "total_pages": 0,
    "content": "<div score=\"20.0\"><img alt=\"Why care about Cooper Union?\" title=\"Why care about Cooper Union?\" src=\"http://media.salon.com/2012/12/d1f713c7fb36706aa57976c0033bbeab-460x307.jpg\"><span class=\"caption\"> Cooper Union occupied (via @FreeCooperUnion Twitter feed)</span>\n                        <div class=\"articleContent\" score=\"31.25\">\n                                                                <p>Since Monday,&#xA0; eleven undergraduate students have expertly<a href=\"http://www.newschoolfreepress.com/2012/12/04/cooper-union-occupation-continues-into-second-day/\"> barricaded themselves </a>inside the top floor of New York&#x2019;s Cooper Union college. The meticulously planned occupation is a tuition fee protest: the prestigious art school has for over a century offered free education to<em> </em>its students. However,&#xA0;university president Jhamshed Bharucha announced earlier this year that the school would <a href=\"http://www.nytimes.com/2012/04/25/nyregion/cooper-union-will-charge-tuition-for-graduate-students.html\">begin charging tuition fees to graduate students</a>.</p><p>As students at public institutions around the nation are crippled by student debt, why should anyone care about the introduction of fees for a small number of graduates at a prestigious, privately funded East Village art school? I have, of course, begged my own question here: the only reason to care about the Cooper Union occupation is if it is about more than that. There&#x2019;s good reason to say that it is.</p><p>Firstly, Cooper Union, in its 110 year history, has never charged tuition and has consistently been ranked one of the top institutions in the country for art and architecture education. When the average student loan debt for Americans graduating from college today is <a href=\"http://money.cnn.com/2012/10/18/pf/college/student-loan-debt/index.html\">estimated around $27,000 </a>(an imperfect but illustrative statistic), Cooper Union has stood as an important, rare symbol of free tuition at work. Students and faculty members alike have expressed fears that introducing fees for graduates threatens the entire institution, which will likely be reconfigured to focus more on grad programs (which would bring in money) and away from its original teaching mission.</p><p>&#x201C;The revenue-generating graduate programs will seriously encroach on the resources of the current, tuition-free undergraduate program and will require expansion of the institution &#x2014; falling into the same business model that large, expensive universities follow,&#x201D; Joe Riley, one of the occupying students<a href=\"http://www.huffingtonpost.com/2012/12/05/cooper-union-tuition-protest_n_2240768.html\"> told the Huff Po.</a></p><div class=\"toggle-group target hideOnInit\"><p>There are other, specifically Cooper Union-related issues cited by occupiers and their supporters, but to focus on those would miss why this small occupation is important in a broader context. Throughout the spring and summer, a mass student strike in Quebec over proposed tuition hikes regularly brought hundreds of thousands of students and supporters into the Montreal streets. Across the border, Americans held solidarity marches and pinned small red, felt squares to their clothes to signify that they too, with the Quebec students were &#x201C;squarely in the red.&#x201D;</p><p>At the time<a href=\"http://www.salon.com/2012/05/23/dissent_a_la_quebecoise/\"> I wrote here</a>, &#x201C;It goes without saying that if there are grounds for radical student action anywhere, they are in the U.S. We &#x2014; students and non-students alike &#x2014; are &#x2018;in the red&#x2019; as much as and more than our neighbors to the North; and we, like them, should be in the streets.&#x201D; Since then activists organizing under the banner of &#x201C;Strike Debt&#x201D; have launched major projects around the issue of debt, but university campuses have stayed relatively quiet. The tuition fee hike in Quebec was <a href=\"http://www.salon.com/2012/09/21/quebec_student_strike_claims_victory/\">repealed</a>, students returned to the classrooms; the baton of dissent was dropped and American students have not picked it up.</p><p>Meanwhile, that bold and basic act of taking city space for our own purposes &#x2014; the idea at Occupy Wall Street&#x2019;s very core &#x2014; has been rendered near impossible since the nationwide crackdown on Occupy camps. In New York, the police still stand guard around squares and parks when protest marches are near. With this in mind, the small occupation in the Cooper Union building is a reminder that the tactic of occupation is not dead and nor is the possibility of radical student action.</p><p>The numbers gathering around Cooper Union this week have been small &#x2014; on Thursday a rally gathered 150 participants. Compared to the mass mobilizations around Occupy last year or the Quebec student strikes, the well-planned Cooper Union occupation appears little more than a gesture. But as New Inquiry editor and writer Max Fox pointed out in a<a href=\"http://thenewinquiry.com/features/tni-vol-11-editorial-note-on-the-movement-of-food/\"> recent (largely unrelated) essay</a>, &#x201C;a gesture isn&#x2019;t nothing&#x201D;:</p><blockquote><p>[As philosopher] Giorgio Agamben, explains, gestures can be supremely important acts, resolving the false distinction between means and ends. &#x201C;The gesture is the exhibition of a mediality: it is the process of making a means visible as such,&#x201D; he says&#x2026; That is, a pure gesture shows that a certain way of doing something is possible, even while what exactly that something might be can&#x2019;t yet be named.</p></blockquote><p>The Cooper Union occupiers have demands relating to their school and specific ends they hope to achieve. Outside of this, however, the occupation is an important gesture &#x2014; and that isn&#x2019;t nothing.</p></div>            <a class=\"toggle-group toggleOnScroll trigger remember refreshAds gaTrackPageEvent\" href=\"http://www.salon.com/2012/12/06/why_care_about_cooper_union/\">\n                \n                <span class=\"onText\">Close</span>\n                        </a>                        </div>\n\n                        \n                                                    </div>",
    "date_published": "2012-12-06 15:32:00",
    "dek": null,
    "lead_image_url": "http://media.salon.com/2012/12/d1f713c7fb36706aa57976c0033bbeab-150x150.jpg",
    "title": "Why care about Cooper Union?",
    "rendered_pages": 1
}