{
    "domain": "gothamist.com",
    "next_page_id": null,
    "url": "http://gothamist.com/2013/05/08/cooper_union_students_occupy_presid.php",
    "short_url": "http://rdd.me/cbpni63g",
    "author": "Max Rivlin-Nadler",
    "excerpt": "Via @FreeCooperUnion Students at Cooper Union, the 155-year-old institution that was founded by philanthropist Peter Cooper to offer a tuition-free arts education in perpetuity, have occupied the&hellip;",
    "direction": "ltr",
    "word_count": 293,
    "total_pages": 0,
    "content": "<div><div class=\"entry-body\">\n\t\n\t\n\t\n\t<p><span class=\"mt-enclosure mt-enclosure-image\"> <div class=\"image-none\"> <img alt=\"2013_04_cooper1.jpg\" src=\"http://gothamist.com/attachments/jen/2013_04_cooper1.jpg\" width=\"640\"><br><i> Via <a href=\"https://twitter.com/FreeCooperUnion\">@FreeCooperUnion</a></i></div> </span></p>\n\n<p>Students at Cooper Union, the 155-year-old institution that was founded by philanthropist Peter Cooper to offer a tuition-free arts education in perpetuity, <a href=\"http://cusos.org/students-take-presidents-office/\">have occupied the office of President Bharucha</a> in an effort to force his resignation over the implementation of tuition beginning in 2014.</p>\n\n<p>The students walked in around 10:50 this morning and have left the doors open to the office so others could join them. Besides one campus security officer, there is currently no police presence in the office, where over 60 people have joined the sit-in. </p>\n\n<p>\"We're prepared to be in here for as long as we see fit,\" Joe Riley, a senior in the School of Art, said in a telephone call. \"We&#x2019;re doing what we need to do to make sure this is an effective action.\"</p>\n\n<p>Bharucha, who, along with former president George Campbell, <a href=\"http://blogs.reuters.com/felix-salmon/2013/04/29/the-tragedy-of-cooper-union/\">led Cooper Union down a disastrous path of insurmountable debt, </a>is not currently in the office and has made no contact with the occupiers. </p>\n\n<p>Students are demanding that President Bharucha resign immediately, and are spreading a petition in support of the school's tuition-free mission statement. </p>\n\n<p>Students participated in an earlier occupation <a href=\"http://gothamist.com/2012/12/04/cooper_union_protesters_remain_ther.php\">last December</a>, but the board still announced the introduction of tuition for the class of 2014. </p>\n\n<p><span class=\"mt-enclosure mt-enclosure-image\"> <div class=\"image-none\"> <img alt=\"2013_04_cooper2.jpg\" src=\"http://gothamist.com/attachments/jen/2013_04_cooper2.jpg\" width=\"640\"><br><i> Via <a href=\"https://twitter.com/FreeCooperUnion\">@FreeCooperUnion</a></i></div> </span></p>\n\n<p>When asked about the apparent failure of the earlier occupation, Riley told us, \"I wouldn&#x2019;t agree with the idea that the last one was not succesful, because it galvanized the entire Cooper Union community and that&#x2019;s why we&#x2019;re here. All the actions have led up to now. We are pushing back against tuition harder than ever before.\"</p>\n\n<p>There will be a rally <a href=\"https://www.facebook.com/events/666580176701209/\">scheduled for 6 pm outside of Cooper Union</a>, in Peter Cooper Square Park, and you can watch a livestream of the occupation <a href=\"http://ustream.tv/channel/free-cooper-union\">here.</a><br></p>\n\t\n\t\n\t\n\t\n\t\n</div>\n\n\n</div>",
    "date_published": "2013-05-08 13:30:00",
    "dek": null,
    "lead_image_url": "http://gothamist.com/attachments/jen/2013_04_cooper1.jpg",
    "title": "Cooper Union Students Occupy President's Office To Protest Tuition",
    "rendered_pages": 1
}