{
    "domain": "www.artinamericamagazine.com",
    "next_page_id": null,
    "url": "http://www.artinamericamagazine.com/news-features/news/amid-ongoing-protests-bloomberg-to-address-cooper-union/",
    "short_url": "http://rdd.me/wad8npvb",
    "author": null,
    "excerpt": "Mayor Michael Bloomberg will address the 154th graduating class of the Cooper Union, the embattled New York university, this spring. The school, which has colleges of art, architecture and&hellip;",
    "direction": "ltr",
    "word_count": 341,
    "total_pages": 0,
    "content": "<div><div class=\"article-left-col\">\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"article-image article-vimage\">\n\t\t\t\t\t\t\t\t\t\t\t<figure>\n\t\t\t\t\t\t\t\t\t\t\t\t<figcaption></figcaption>\n\t\t\t\t\t\t\t\t\t\t\t\t<img src=\"http://www.artinamericamagazine.com/files/2013/02/21/img-cooper-february-protest_153728976675.jpg_x_325x433_c.jpg\">\n\t\t\t\t\t\t\t\t\t\t\t</figure>\n\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\n\n\t\t\t\t\t\t\t<div class=\"article-page-text\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t<p>Mayor Michael Bloomberg will address the 154th graduating class of the Cooper Union, the embattled New York university, this spring. The school, which has colleges of art, architecture and engineering, has been riven by unrest over a possible end to its century-long tradition of free undergraduate education. </p><p>The announcement of Bloomberg's address comes amid continuing protests, including one yesterday, sparked by the school's recent decision to renege on the early decision option for students who had already applied for early decision admission to the&#xA0;art school's incoming class this fall, and place them in the same pool as regular applicants.</p>\n<p>High school seniors can apply for early admission to only one school, and must agree to attend the school if they are accepted, so the decision to defer them to the general admission pool means their sole early decision application is wasted.</p><p>Several dozen faculty, graduates and students, along with some of the deferred high school seniors, gathered outside the school's Foundation Building yesterday. They described the school's move as an attempt to bully the faculty of the art school, who recently declined to comply with what they called a \"subtly coercive\" charge by college president Jamshed Bharucha to help address a recently revealed financial crunch by instituting revenue-generating, tuition-based programs.</p><p>Blustery winds threatened to blow away their large cardboard signs, one of which showed founder Peter Cooper's face and the word \"deferred.\" Another read \"Jamshed's salary: $750,000 and a free house.\"</p><p>\"This is an existential crisis, not a plebiscite about tuition,\" said a statement from the school distributed to the press at the demonstration on Wednesday. Referring to the art faculty's refusal to implement tuition-based programs, the statement continued, \"It should also be obvious that little is served by staking out a high road that leads off a cliff.\"</p>\n<p>Graduation is scheduled for May 29th. Faculty and graduates of the school have often mentioned Bloomberg's name as a possible donor whose deep pockets could address the school's financial crunch. His third term as mayor comes to a close at the end of this year.&#xA0;</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<aside class=\"ad box-ad\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p>Advertisement</p>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</aside>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.artinamericamagazine.com/files/2013/02/21/img-cooper-february-protest_153728976675.jpg_x_325x433_c.jpg",
    "title": "Amid Ongoing Protests, Bloomberg to Address Cooper Union - News",
    "rendered_pages": 1
}