{
    "domain": "gothamist.com",
    "next_page_id": null,
    "url": "http://gothamist.com/2012/12/03/11_students_protesting_tuition_barr.php",
    "short_url": "http://rdd.me/c2pdvqii",
    "author": "Christopher Robbins",
    "excerpt": "A banner dropped by the protesters, who began barricading themselves in at noon (Release) Eleven students have locked themselves in the Peter Cooper Suite of the eighth floor of the Cooper Union&hellip;",
    "direction": "ltr",
    "word_count": 260,
    "total_pages": 0,
    "content": "<div><div class=\"entry-body\"><p><span class=\"mt-enclosure mt-enclosure-image\"> <div class=\"image-none\"> <img alt=\"12312cooper.jpg\" src=\"http://gothamist.com/attachments/nyc_chrisrobbins/12312cooper.jpg\" width=\"640\"><br><i> A banner dropped by the protesters, who began barricading themselves in at noon (Release)</i></div> </span></p>\n\n<p>Eleven students have locked themselves in the Peter Cooper Suite of the eighth floor of the Cooper Union building to protest the institution's decision to charge graduate students tuition. \"We're hoping this will show the administration that they aren't able to make these changes under the table, that these things will have to come to light,\" Victoria Sobel, a 22-year-old senior and spokesperson for the protesters said in a phone interview. Sobel says that while the police haven't attempted to breech the barricades, a school maintenance crew was \"physically ramming the barricade for about thirty minutes. We had to tell them there were students behind the door so they'd stop.\" </p>\n\n<p>Cooper Union, famous for providing free education to its students, <a href=\"http://gothamist.com/2012/04/24/cooper_union_to_make_graduate_stude.php\">made the tuition announcement in April.</a> Sobel, who studies performance art and printmaking, pointed to <a href=\"http://money.cnn.com/2012/05/31/news/economy/fed-student-loans/index.htm\">exploding student load debt</a> to underscore the fact that the issue is not confined to Cooper Union, called the move \"a way for the administration to open the door to start charging for the undergraduate program&#x97;it's just a pretense to start that conversation.\" Sobel added that the barricaded students have been told that professors are currently in an emergency meeting with the school's president, Jamshed Bharucha. </p>\n\n<p>When asked if there was anything the administration could do to get the students to leave or negotiate besides submit to the protesters' demands (one of which asks for Bharucha's resignation), Sobel replied, \"No.\"</p>\n\n<p>You can read the students' letter to the administration below:</p>\n\n<p><a title=\"View Communique [Administration] on Scribd\" href=\"http://www.scribd.com/doc/115358350/Communique-Administration\">Communique [Administration]</a></p></div>\n\n\n</div>",
    "date_published": "2012-12-03 15:10:00",
    "dek": null,
    "lead_image_url": "http://gothamist.com/assets_c/2012/12/12312cooper-thumb-105x105-759647.jpg",
    "title": "11 Students Protesting Tuition Have Barricaded Themselves In Cooper Union Building",
    "rendered_pages": 1
}