{
    "domain": "www.takepart.com",
    "next_page_id": null,
    "url": "http://www.takepart.com/article/2012/12/07/cooper-union-protesters-free-education-must-not-got-extinct?cmpid=wfs-fb",
    "short_url": "http://rdd.me/qdqbba18",
    "author": "Suzi Parker",
    "excerpt": "New York&#x2019;s Cooper Union has always prided itself on being a tuition-free college. For more than a century, the esteemed East Village school has offered one of the country&#x2019;s best art,&hellip;",
    "direction": "ltr",
    "word_count": 847,
    "total_pages": 0,
    "content": "<div><div class=\"field-item even\"> <p>New York&#x2019;s <a href=\"http://cooper.edu/\" target=\"_blank\">Cooper Union</a> has always prided itself on being a tuition-free college.</p>\n<p>For more than a century, the esteemed East Village school has offered one of the country&#x2019;s best art, architecture, and engineering programs. It's done so without charging a dime, thanks to scholarships for all students provided from endowments. The school is one of eight free higher education institutions in the U.S. aside from military schools.</p>\n<p>When the school was established, it was as if the founder Peter Cooper had predicted what was to come. He said: \"In the course of a century there will, of course be a great number of graduates of the Cooper Union and the day will surely come when they, these graduates, will rally round this institution.\"</p>\n<p>A group of students feel strongy that the time to rally is now.</p>\n<p><strong>More: <a href=\"http://www.takepart.com/article/2012/12/06/8-ways-keep-student-loan-debt-crushing-you\" target=\"_self\">8 Ways to Keep Your Student Loan Debt From Crushing You</a></strong></p>\n\n<p>Jhamshed Bharuch, the university&#x2019;s president, <a href=\"http://www.nytimes.com/2012/04/25/nyregion/cooper-union-will-charge-tuition-for-graduate-students.html?_r=0\" target=\"_blank\">said earlier this year</a> that the school is facing a financial hole, and therefore tuition would have to be charged. Students, alumni and faculty protested and now students are taking their disapproval to a new level.</p>\n<p>On Monday, a group of 11 students barricaded themselves in the school&#x2019;s clock tower. They plan to occupy the school as long as it takes to gain some transparency on future plans to charge undergraduates tuition. (A decision to charge graduate students tuition was made this past April.) Students also protested on the ground and stormed a trustee meeting on Wednesday. Those in the clock tower watched from a live stream.</p>\n<p>Each day more and more students go into college debt in the U.S. According to the Federal Reserve Bank of New York's <a href=\"http://www.newyorkfed.org/newsevents/news/research/2012/an121127.html\" target=\"_blank\">Quarterly Report on Household Debt and Credit</a>, outstanding student loan debt in the United States now stands at $956 billion.</p>\n<p>In that light, Cooper Union students argue that free education has become nearly extinct in the United States, and Cooper should remain a beacon.</p>\n<p>According to the school&#x2019;s website, the college was founded by Peter Cooper in 1859. Students who could afford to pay did so. But in 1902, the school received a large endowment and all students received a full scholarship, now valued at $38,550 a year.</p>\n<p>The school released a statement about the protest. &#x201C;The eleven art students who have locked themselves in the Peter Cooper Suite do not reflect the views of a student population of approximately 1,000 architects, artists and engineers,&#x201D; the statement said.</p>\n<p>The culture of Cooper Union is unique. Its founder &#x201C;saw the downfall of man in his time to be sheer greed. He earned his wealth by concentrating his curiosity and intelligence into free and selfless invention.&#x201D; With that in mind, many of the professors and students see it as their mission to continue Cooper&#x2019;s vision.</p>\n<p>They have created a Facebook called &#x201C;<a href=\"https://www.facebook.com/groups/SaveCooperUnion/?ref=ts&amp;fref=ts\" target=\"_blank\">Save Cooper Union</a>&#x201D; to spread their message. The clock tower protesters post pictures and updates. They also post letters of support such as a lengthy one by Professor David Gersten of The School of Architecture that in part says, &#x201C;It is not that The Cooper Union holds up free education but that free education holds up The Cooper Union. We are now confronted with a crisis that threatens to collapse this structural principle.&#x201D;</p>\n<p>Billie Murray, an assistant professor of communication at Villanova University, says the students are &#x201C;doing what many of us wish more people in our nation would do&#x2014;that is, participating in the public sphere and in democratic process.&#x201D;</p>\n<p>She adds, &#x201C;The students have successfully disrupted a public space in order to raise awareness about an issue that directly affects them and their community. The President of their university, at this point, seems to be supportive of the students' rights to free assembly and speech, which is not always the case at universities where students are often restricted from using public space in this way.&#x201D;</p>\n<p>So far, the school has let the students protest in peace without police interference. A lawyer is representing the protesters pro-bono. But if attention continues to grow on the cause, could the school administration tire of the protesters? &#x201C;The worst fear is that the students could be expelled, and most of these students are seniors, and that would be a grave concern,&#x201D; the protester&#x2019;s lawyer <a href=\"http://www.dnainfo.com/new-york/20121207/east-village/cooper-union-students-hold-live-in-protest-for-free-education\" target=\"_blank\">told DNA.info.com</a>.</p>\n<p>Still, they&#x2019;ve called attention to the esteemed small school in Manhattan.</p>\n<p>&#x201C;The effects of their protest, or occupation, is yet to be determined, but that have at this point garnered some media attention and had their voices heard, which is an important effect,&#x201D; Murray says.</p>\n<div class=\"drupal-embed\"><div id=\"block-newsletter-campaign-19\" class=\"block block-newsletter-campaign block-boxes-delta-19\">\n\n    <h2><span>Sign up for TakePart Education Emails</span></h2>\n  \n  <div class=\"content clearfix\">\n    <div class=\"takepart-newsletter-wrapper\">\n  <div id=\"takepart-newsletter-19-body\">\n    <p class=\"takepart-newsletter-promo-text\">Stay up-to-date on the issues from <i>Waiting for 'Superman'</i> and other education news weekly.</p>\n    \n    \n  </div>\n  \n</div>\n  </div>\n</div>\n</div>\n<p><strong>Related Stories on TakePart:</strong></p>\n<p>&#x2022; <a href=\"http://www.takepart.com/article/2012/10/28/perfect-storm-student-debt\" target=\"_self\">Cost of Going to College: The Road That Led to 1000 Percent Rise in Tuition</a></p>\n<p>&#x2022; <a href=\"http://www.takepart.com/article/2012/12/02/college-announces-33-percent-tuition\" target=\"_self\">Private North Carolina College Announces '33 Percent Off Tuition!'</a></p>\n<p>&#x2022; <a href=\"http://www.takepart.com/article/2012/07/20/us-students-struggling-pay-150-billion-private-loans\" target=\"_self\">U.S. Students Struggling to Pay Back $150 Billion in Private Loans</a></p>\n<p><img alt=\"\" class=\"media-image\" src=\"http://www.takepart.com/sites/default/files/styles/tp_content_wide/public/suzibiopic.jpg\"><em>Suzi Parker is an Arkansas-based&#xA0;political and cultural journalist whose work frequently appears in&#xA0;</em>The Washington&#xA0;Post&#xA0;<em>and&#xA0;</em>The Christian Science Monitor<em>. She is the&#xA0;author of two books.</em> <a href=\"https://twitter.com/suziparker\" rel=\"nofollow\" target=\"_blank\">@SuziParker</a> | <a href=\"http://takepart.com\">TakePart.com&#xA0;</a></p>\n </div></div>",
    "date_published": "2012-12-07 00:00:00",
    "dek": null,
    "lead_image_url": "http://www.takepart.com/sites/default/files/styles/tp_content_wide/public/suzibiopic.jpg",
    "title": "Cooper Union Protesters: Free Education Must Not Go Extinct",
    "rendered_pages": 1
}