{
    "domain": "www.breitbart.com",
    "next_page_id": null,
    "url": "http://www.breitbart.com/Big-Government/2013/05/27/Spoiled-Students-Stage-Sit-In-With-Catered-Sushi-At-Cooper-Union",
    "short_url": "http://rdd.me/xklhfkit",
    "author": "Lee Stranahan",
    "excerpt": "by Lee Stranahan 28 May 2013, 10:10 AM PDT",
    "direction": "ltr",
    "word_count": 1117,
    "total_pages": 0,
    "content": "<div><div id=\"content_0_divMainContent\" class=\"grid_12 alpha omega\">\n                                \n\n\n    \n    <div id=\"content_0_maincontent_0_divArticleInfo\" class=\"story story-metadata\">\n        <span id=\"content_0_maincontent_0_spanAuthor\" class=\"story-author\">\n            by\n            <a id=\"content_0_maincontent_0_hplAuthor\" href=\"http://www.breitbart.com/Columnists/Lee-Stranahan\">Lee Stranahan</a>\n        </span>\n        <span class=\"story-time\">28 May 2013, 10:10 AM PDT</span>\n        <span id=\"content_0_maincontent_0_disqusCommentCount01_spanArticleComments\" class=\"story-comments\">\n    <a href=\"http://www.breitbart.com/Big-Government/2013/05/27/Spoiled-Students-Stage-Sit-In-With-Catered-Sushi-At-Cooper-Union#disqus_thread\" id=\"content_0_maincontent_0_disqusCommentCount01_aDisqusThread\" class=\"commentNumber\"></a>\n    \n</span><span id=\"content_0_maincontent_0_disqusCommentCount01_spanPostComment\" class=\"story-comment-link\">\n    <a href=\"http://www.breitbart.com/Big-Government/2013/05/27/Spoiled-Students-Stage-Sit-In-With-Catered-Sushi-At-Cooper-Union#comments\" id=\"content_0_maincontent_0_disqusCommentCount01_aPostComment\">post a comment</a>\n</span>\n\n\n        \n    </div>\n    \n    \n\n\n\n\n<p>The students <a href=\"http://www.nytimes.com/2013/05/25/nyregion/cooper-union-protesters-living-high-life-out-of-presidents-office.html?_r=0\" target=\"_blank\">took over the President's office at Cooper Union for the Advancement of Science and Art on May 8th</a>. They have no plans to leave and the school's President is forced to work from home, while the protestors tap away on their laptops, make videos and get catering brought in to them.&#xA0;</p>\n<p>The office takeover was the dramatic high that started in April, when studtens began protesting a plan to charge tuition.&#xA0;</p>\n<p>Support has been predictable from the lefty media; &#xA0;their Art vs. Austerity antics garnered approving coverage from the <em>New York Times</em> and posits them as the current poster children of the Occupy dream of free education.</p>\n<p>How did this mess start?</p>\n\n<p>Founded in 1859 by industrialist and abolitionist Peter Cooper, Cooper Union was founded on an ideal of making eduction available without discrimination. Of course, this idea emerged from a very different culture where higher education was available to few, not in a time when all of the world's knowledge was available on a variety of affordable devices or when free Wi-Fi was available at the nearest McDonald's.&#xA0;</p>\n<p>The school is well regarded for its programs in the arts, architecture and engineeering and the best known alumni are probably Thomas Edison, <em>New York</em> magazine founder Milton Glazer; and Dik Browne, the cartoonist who created <em>Hagar the Horrible</em>--admist a cadre of other graduates that include photographers, builders and graphic artists.</p>\n\n<p>When founded in the 1850s, Cooper Union was not univerally free, however; students who could afford tution did so. In 1902 after recieving a large endowment, the school became tution-free for all students. Free tution has persisted at Cooper Union for the last 110 years, including for the 1,000 or so current students.</p>\n\n<p>Financial reality has kicked in at Cooper, however. In 2011, incoming school president Jhamshed Bharuch inherited a $17,000,000 debt. After two years of deliberation and study, the board decided it had to charge tution amounting to half the cost to some future students who could afford it. The policy would have no effect on current students, nor would all future students have to pay tution.</p>\n\n<p>In the age of Occupy Wall Street, however, even the mere hint of financial responsibility is cause for a freakout. Students at Cooper stormed the school's clock tower and disrupted board meetings. They demaned President Bharuch's resignation, started social media campaigns and eventually started a 24/7 occupation of the President's office.&#xA0;</p>\n<p>As the <em>New York Times </em> <a href=\"http://www.nytimes.com/2013/05/25/nyregion/cooper-union-protesters-living-high-life-out-of-presidents-office.html?_r=0\" target=\"_blank\">reports</a>:</p>\n\n<blockquote>\nAlumni and supporters sign up online to cover all the occupiers&#x2019; meals. Thai one day, Indian another; last week, someone sent platters of sushi. &#x201C;I&#x2019;ve eaten better these past two weeks than I did the two weeks previous,&#x201D; one student said.\n<p>They set up red lights to illuminate the exterior of the office every night at sunset, and <a href=\"http://freecoopercountdown.tumblr.com/\">a tumblr page</a> of people counting down to that moment. They put together an <a href=\"https://www.facebook.com/media/set/?set=a.472044352876388.1073741847.391957684218389&amp;type=3\">online photo gallery</a> of the books on Dr. Bharucha&#x2019;s shelves (they got a chuckle out of &#x201C;Profiting from Education,&#x201D; though it is actually about Japanese-American joint ventures) and another gallery, called &#x201C;Jam&#x2019;s Head,&#x201D; of <a href=\"https://www.facebook.com/media/set/?set=a.466044733476350.1073741831.391957684218389&amp;type=3\">people holding pictures</a> of Dr. Bharucha up in front of their own. They plan to open a free school and salon to coincide with next week&#x2019;s collegewide end-of-year show.</p>\n\n</blockquote>\n<p>The Free Cooper Union protestors are certainly having fun. They <a href=\"https://www.facebook.com/media/set/?set=a.462129387201218.1073741826.391957684218389&amp;type=1\">painted the lobby black</a> in a paint party to loud music--and made a video of themselves doing it. They did staged reading of the transcript of a recent board meeting, where the protestors used silly voices--and <a href=\"http://www.youtube.com/watch?v=cOFXii9Zh3U\">they made a video of it</a>. Like Occupy Wall Street, everything gets a video--YouTubed and UStreamed and documenting every possible second of their tantrum in order to give it deeper meaning. </p>\n\n<p>None of it, however, changes math.</p>\n\n<p>The Cooper Union website has an entire <a href=\"http://cooper.edu/about/finance-and-administration/financial-faq/deficit-financial-situation%234\">Frequently Asked Questions document </a>dedicated to the financial issues, including the projected deficits that are expected to reach $20,000,000 in a few years. The FAQ explains Cooper Union's endowments, income and expenses and the numbers are grim.</p>\n\n<p>However, the numbers do not matter to the protestors. This is part of a broader goal of the Occupy Wall Street movement: free tuition for everyone. The Occupy crowd wants all student loans forgiven, too. </p>\n\n<p>Despite the obvious dumbing down of American academia by the tenured Left and the dismantling of useful curriculum by multiculuralists with a political agenda, the Occupy mob sees a different culprit in the destruction of U.S. education: capitalism.&#xA0;</p>\n<p>Of course, capitalism is the boogeyman they see behind every problem, but <a href=\"http://www.brooklynrail.org/2011/12/local/why-cooper-union-matters\" target=\"_blank\">this essay</a> on the supposed importance of Cooper Union makes the argument plain:</p>\n\n<blockquote>\nSince the 1980s, universities have responded to the pressures of economy by increasingly commercializing themselves, selling their educations as a product. That education has faltered as a result of this is evident all around us. The discourse has become one of investment: Exorbitant loans are justified on the grounds of the value of the product they purport to put out--namely, students that generate income (which then, in theory, enables them to pay off their educational debt).\n</blockquote>\n<p>Never mind that even a robust economy can only sustain so many <a href=\"http://colleges.collegetoolkit.com/colleges/browse/majors/byid/music_therapy-therapist/51.2305.aspx\">Music Therapy</a> or <a href=\"http://www.mymajors.com/Canadian-Studies-Major\">Canadian Studies</a> majors. Free Education To All--as the photo on the protestor's Facebook page screams--is the fever dream of a Spolied Brat Socialist Utopia that isn't even pretending to be about helping the poor; it's solidly privileged kids who could afford college but just don't want to, because they don't. Give us what we demand, they say, or we're just going to sit here with our MacBooks and have an art party until forever.</p>\n\n<p>The problem that decidely lefist academia has in fighting the ideals of the protestors is that, at root, they accept them. And so the protestors have been allowed to stay. and continue to gain positive press attention and support. It's the Zuccotti Park standoff all over again, with the authorities looking on helplessly like the the doting mother on an episode of <em>Intervention</em> who doesn't want to raise a fuss because her pouting ungrateful disaster child might get mad. (Credit for this analogy goes to <a href=\"http://www.breitbart.com/Big-Journalism/2013/05/15/Gut-Check-Intervention\">Fox News personality and Breitbart News contributor Greg Gutfeld.</a>)</p>\n\n<p>If the past gives any clues about the most effective way to end the protest, its to pull the plug on the party. Unless the administration plans to capitulate to the protestors childlike understanding of economics, they need to do what they'd do to any group of squatters who wandered in off the Manahattan streets and Kick. Them. Out. The best time to do this would have been weeks ago when the protests began; the second-best time is right now.</p>\n\n\n<br></div>\n                            \n                        </div>",
    "date_published": "2013-05-27 00:00:00",
    "dek": null,
    "lead_image_url": null,
    "title": "Students Stage Sit-In with Catered Sushi at Cooper Union",
    "rendered_pages": 1
}