{
    "domain": "thevillager.com",
    "next_page_id": null,
    "url": "http://thevillager.com/2013/05/16/dormitory-foes-warn-cooper-dont-get-in-bed-with-singer/",
    "short_url": "http://rdd.me/xrgft7aa",
    "author": "The Villager",
    "excerpt": "Photo by Jefferson SiegelSpeaking in front of the Foundation Building at Wednesday&#x2019;s protest, Chino Garcia said the former CHARAS/El Bohio should be restored as a community center.&hellip;",
    "direction": "ltr",
    "word_count": 1070,
    "total_pages": 0,
    "content": "<div><div id=\"post-11726\" class=\"post-11726 post type-post status-publish format-standard has-post-thumbnail hentry category-news entry\">\n\t\t\n\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t\t<div id=\"attachment_11727\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-11727 \" alt=\"charas,-jeff\" src=\"http://thevillager.com/wp-content/uploads/2013/05/charas-jeff.gif\" width=\"600\"><p class=\"wp-caption-text\">Photo by Jefferson Siegel<br>Speaking in front of the Foundation Building at Wednesday&#x2019;s protest, Chino Garcia said the former CHARAS/El Bohio should be restored as a community center. Councilmember Rosie Mendez, left, held the bullhorn, while Laurie Mittelmann, co-director of the Museum of Reclaimed Urban Space (MORUS), right, held a poster blasting developer Gregg Singer.</p></div>\n<p><strong>BY SARAH FERGUSON&#xA0;</strong> |&#xA0; On Wednesday, more than 150 people marched from the old P.S. 64 on E. 9th St. &#x2014; former home of the CHARAS/El Bohio Cultural and Community Center &#x2014; to The Cooper Union to demand that the university reverse its plan to lease up to 196 beds in the new dormitory that owner Gregg Singer wants to build there.</p>\n<p>Led by the Greatest Small Band blowing Dixieland jazz, giant puppets and a substantial police escort, the boisterous crowd wound its way through the East Village, with some stopping to boo for a minute outside Cooper President Jamshed Bharucha&#x2019;s&#xA0;residence on Stuyvesant St., before rallying outside Cooper Union&#x2019;s Foundation Building.</p>\n<p>There they were greeted by Cooper students who have been occupying Bharucha&#x2019;s office since May 8 to protest the board of trustees&#x2019; decision to break with a century-old tradition and begin charging undergraduate tuition in 2014.</p>\n<p>&#x201C;There is no room, and no desire, and no way we will live with a dorm in our backyard,&#x201D; declared Councilmember Rosie Mendez, shouting to the crowd from a bullhorn. &#x201C;Cooper Union needs to rescind whatever deal I believe it doesn&#x2019;t have so Singer can give us back our building,&#x201D; Mendez added.</p>\n<p>Assemblymember Brian Kavanagh was equally strident.</p>\n<p>&#x201C;As a community, we have to at some point draw the line and say this is a battle we are not going to lose, and this is a fight we&#x2019;re not going to quit,&#x201D; Kavanagh said.</p>\n<div id=\"attachment_11733\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-11733\" alt=\"Photos by Q. Sakamaki The protesters gathered outside the old P.S. 64, at Ninth St. near Avenue B, below, then marched over to Cooper Union&#x2019;s Foundation Building on Cooper Square, to the strains of the Hungry March Band, above.\" src=\"http://thevillager.com/wp-content/uploads/2013/05/charas-band.gif\" width=\"600\"><p class=\"wp-caption-text\">Photos by Q. Sakamaki<br>The protesters gathered outside the old P.S. 64, at Ninth St. near Avenue B, below, then marched over to Cooper Union&#x2019;s Foundation Building on Cooper Square, to the strains of the Greatest Small Band, above.</p></div>\n<p>Responding to claims by Cooper officials that they were unaware of the long controversy over the sale of CHARAS and Singer&#x2019;s handling of the property, Kavanagh added: &#x201C;If it was a mistake that they didn&#x2019;t know what they were getting into, then they should back off and get out of this deal.&#x201D;</p>\n<div>\n<p>State Senator Brad Hoylman held a sign that read: &#x201C;What Does an Inside Job Look Like? $20,000 Tuition at Cooper Union.&#x201D; He joked about the convergence of events that had brought this latest CHARAS crusade to Cooper Union&#x2019;s doorstep.</p>\n<p>&#x201C;Cooper wants to raise tuition for the first time in 154 years, and to buy dorms from, of all people, Gregg Singer! You can&#x2019;t make it up,&#x201D; he said.</p>\n<p>CHARAS co-founder Chino Garcia questioned whether Singer&#x2019;s plans were really for a dorm at all. The lease Cooper signed gives it &#x201C;right of first refusal&#x201D; for 196 of the roughly 530 beds in the proposed dorm.</p>\n</div>\n<p>&#x201C;Let&#x2019;s be clear. This is not a dorm,&#x201D; Garcia told the crowd. &#x201C;He wants to build a youth hostel. He&#x2019;s been trying to do that for 13 years.</p>\n<p>&#x201C;That&#x2019;s a residential neighborhood and it shouldn&#x2019;t be that. It should be a community center that serves the local community,&#x201D; Garcia said.</p>\n<p>Saar Shemesh, a first-year art student, read a statement on behalf of the roughly 100 Cooper undergrads who have occupied Bharucha&#x2019;s office over the last week.</p>\n<p>&#x201C;As a community in the throes of financial uncertainty, we find it wholly unacceptable that Cooper Union&#x2019;s administration failed to research the vital history of this space before pursuing a disgusting lease,&#x201D; Shemesh said, adding, &#x201C;From one landmarked institution to another, we call for this community treasure to be protected not endangered.&#x201D;</p>\n<p>Shemesh also questioned whether many Cooper students would rent space at Singer&#x2019;s dorm, where students would pay $1,550 to bunk with four to seven other students in the same suite. Cooper already has its own dorm, which houses nearly all of its roughly 200 freshmen, she noted, and it&#x2019;s generally only freshmen who want to pay a premium to live in a dorm setting.</p>\n<p>&#x201C;I don&#x2019;t know anyone who pays more than $400 or $700 for shared space,&#x201D; Shemesh said. &#x201C;Most of my friends live in Brooklyn or way Uptown.&#x201D;</p>\n<p>Garcia said that if Cooper really wanted more dorm space, it could add a few more floors on its modern new academic building on Cooper Square, or on the glittering office tower being completed on Astor Place on land leased long-term from Cooper Union, drawing jeers from the crowd.</p>\n<p>Former squatter Eric Rassi urged opponents of the dorm to dog the mayoral candidates and &#x201C;make them take a position.&#x201D;</p>\n<p>Filmmaker turned Internet entrepreneur Paul Garrin, who graduated from Cooper in 1982, noted that Mayor Bloomberg will be speaking at Cooper&#x2019;s commencement on May 29.</p>\n<p>&#x201C;We should ask him to write a check to Cooper to close its deficit, and a second check to Cooper to buy back CHARAS, so they can bring in their architects and engineers and artists to transform that building into a state-of-the-art community center that is energy independent and ecologically sustainable,&#x201D; Garrin said.</p>\n<p>While that may be unlikely, the need to build greater cooperation between Cooper and the East Village community was clear.</p>\n<p>&#x201C;They should have talked to us to see how they could help this community with the architects and engineers that they have,&#x201D; Garcia lamented. &#x201C;There&#x2019;s a lot of people in this neighborhood that need that type of help.&#x201D;</p>\n<p>Mendez said said President Bharucha has agreed to meet with her and other elected officials and community members next week to hear the whole saga of CHARAS and its contested sale to Singer.</p>\n<p>&#x201C;I think if he can get out of it, he will,&#x201D; Mendez said of the dorm lease.</p>\n<p>But while Cooper put its neck out by being the first school to sign on with Singer, other schools are starting to follow.</p>\n<p>On Sunday, the Wall Street Journal reported that the West Village&#x2019;s Joffrey Ballet School had agreed to rent 120 beds at the proposed dorm, dubbed&#xA0;University House.</p>\n<p>&#x201C;Ballet school officials say the dorm represents an opportunity to offer its students &#x2014; some of whom are high-school age &#x2014; much-needed housing options,&#x201D; the Journal wrote.</p>\n<p>That means Singer has leasing commitments for more than half the dorm.&#xA0;And it makes Cooper&#x2019;s position as a partner in the project that much more tenable.</p>\n<div class=\"simplesocial-box\"><p class=\"simplesocial-title\">The Villager encourages readers to share articles:</p><a class=\"simplesocial\" title=\"Share on Facebook\" href=\"http://www.facebook.com/share.php?u=http%3A%2F%2Fthevillager.com%2F2013%2F05%2F16%2Fdormitory-foes-warn-cooper-dont-get-in-bed-with-singer%2F&amp;t=Dormitory+foes+warn+Cooper%3A+Don%E2%80%99t+get+in+bed+with+Singer%21\"></a><a class=\"simplesocial\" title=\"Share on Twitter\" href=\"http://twitter.com/home?status=http%3A%2F%2Fthevillager.com%2F2013%2F05%2F16%2Fdormitory-foes-warn-cooper-dont-get-in-bed-with-singer%2F\"></a><a class=\"simplesocial\" title=\"Email a Friend\" href=\"http://www.freetellafriend.com/tell/?heading=Share+This+Article&amp;bg=1&amp;option=email&amp;url=http%3A%2F%2Fthevillager.com%2F2013%2F05%2F16%2Fdormitory-foes-warn-cooper-dont-get-in-bed-with-singer%2F\"></a><a class=\"simplesocial\" title=\"Share on Google\" href=\"http://www.google.com/bookmarks/mark?op=add&amp;bkmk=http%3A%2F%2Fthevillager.com%2F2013%2F05%2F16%2Fdormitory-foes-warn-cooper-dont-get-in-bed-with-singer%2F&amp;title=Dormitory+foes+warn+Cooper%3A+Don%E2%80%99t+get+in+bed+with+Singer%21\"></a><a class=\"simplesocial\" title=\"RSS Feed\" href=\"http://thevillager.com/?feed=rss2\"></a></div><div id=\"text-5\" class=\"widget widget_text\"></div>\n\t\t\n\t\t\t\n\t\t\t\t\t\n\t\t</div>\n\t\t\t\t\n\t\t\n\t\t\t\n\t\n\t\n\t\t\n\t</div>",
    "date_published": "2013-05-16 00:00:00",
    "dek": null,
    "lead_image_url": "http://thevillager.com/wp-content/uploads/2013/05/charas-jeff.gif",
    "title": "Dormitory foes warn Cooper: Don’t get in bed with Singer!",
    "rendered_pages": 1
}