{
    "domain": "wesleying.org",
    "next_page_id": null,
    "url": "http://wesleying.org/2012/12/11/cooper-union-students-end-occupation-eat-things-that-arent-ramen/",
    "short_url": "http://rdd.me/oonzdzbh",
    "author": "fuzzball",
    "excerpt": "The occupation of Cooper Union (by students apparently unencumbered by a deluge of finals and end-of-semester projects) came to a close late yesterday morning. As you may remember, on December 3, a&hellip;",
    "direction": "ltr",
    "word_count": 495,
    "total_pages": 0,
    "content": "<div><div class=\"entry-content\">\n<p><a href=\"http://wesleying.org/2012/12/04/cooper-union-students-occupy-demand-free-tuition/\" rel=\"attachment wp-att-89592\" target=\"_blank\"><img class=\"aligncenter  wp-image-89592\" title=\"Fuck Tuition!\" src=\"http://wesleying.org/wp-content/uploads/2012/12/CooperUnion3.jpeg\" alt=\"\" width=\"574\"></a></p>\n<p>The occupation of Cooper Union (by students apparently unencumbered by a deluge of finals and end-of-semester projects) <a href=\"http://cityroom.blogs.nytimes.com/2012/12/10/cooper-union-students-end-occupation-of-suite-after-a-week/\" target=\"_blank\">came to a close</a> late yesterday morning.</p>\n<p>As you may <a href=\"http://wesleying.org/2012/12/04/cooper-union-students-occupy-demand-free-tuition/\">remember</a>, on December 3, a cadre of eleven&#xA0;<del>freeloaders</del>&#xA0;Cooper Union students locked themselves in the Peter Cooper Suite on the eighth floor of Cooper Union&#x2019;s Foundation Building, a.k.a. <a href=\"http://www.youtube.com/watch?v=AM5EYO5wWMA\">The Clocktower</a>. Protesting the university&#x2019;s formation of an exploratory committee on &#x201C;examining potential revenue streams from undergraduate programs,&#x201D; the occupiers brought with them sleeping bags, blankets, <a href=\"http://wesleying.org/wp-content/uploads/2012/12/Cooper-frosh-solidarity.jpg\">at least one hammock</a>, and oatmeal and ramen noodles for sustenance. Cooper Union has funded the education of its undergraduates since at least 1902 using an endowment that draws as much from alumni donations as it does from its own holdings, <a href=\"http://www.nytimes.com/2008/02/13/business/13cooper.html\">including the property on which the Chrysler Building sits</a>.</p>\n<blockquote class=\"twitter-tweet\" width=\"500\"><p>Students for a Free Cooper Union would like to wish you a transparent and accountable holiday! <a href=\"https://twitter.com/search/%23freeeducationtoall\">#freeeducationtoall</a> <a href=\"http://t.co/fA2FmbXB\" title=\"http://twitter.com/FreeCooperUnion/status/278243277562601472/photo/1\">twitter.com/FreeCooperUnio&#x2026;</a></p>\n<p>&#x2014; Free Cooper Union (@FreeCooperUnion) <a href=\"https://twitter.com/FreeCooperUnion/status/278243277562601472\">December 10, 2012</a></p></blockquote>\n\n<p>Last night, the <em>New York Times</em>&#x2018; City Room blog <a href=\"http://cityroom.blogs.nytimes.com/2012/12/10/cooper-union-students-end-occupation-of-suite-after-a-week/\">detailed the end of the occupation.</a>&#xA0;Click through for a more Wes-centric take on the story. </p>\n<p>Jamshed Bharucha, Cooper Union&#x2019;s president, never explicated that a plan to begin charging undergraduates was in the works. In spite of this, a number of students and faculty members felt this to be an inevitability, prompting the formation of the <a href=\"http://www.cusos.org/\" target=\"_blank\">Cooper Union Student Action to Save Our School</a>, which brought to light a document that apparently contained talk of a plan to begin charging tuition.</p>\n<p>The occupation began at noon on Monday, December 4, and came to an end yesterday around noon, lasting almost exactly one week. Though the students acknowledged that the administration had not acceded to their demands by making a public affirmation of their commitment to provide free education to all Cooper Union students, the occupation was deemed a success in that it brought attention to the issue of tuition.</p>\n<p>As Wesleying&#x2019;s own <strong><span>Oswaldo</span></strong> <a href=\"http://wesleying.org/2012/12/04/cooper-union-students-occupy-demand-free-tuition/\">thoroughly pointed out</a>, the recent deliberations of Cooper Union&#x2019;s administration parallels Wesleyan&#x2019;s <a href=\"http://wesleying.org/tag/need-blind/\">own recent grappling with need-blind admissions</a>; specifically, both decisions are haunted by the specter of moral and social responsibility that is so prominent in these institutions&#x2019; own rhetoric used to advertise themselves to potential students and deep-pocketed alumni.</p>\n<p><del>Rome was not built in a</del><del>day</del> <del>Usdan was not built in a day</del> Mocon was not <a href=\"http://wesleying.org/2010/06/24/mogone-demolition-update2/\" target=\"_blank\">demolished </a>in a day, and as the world struggles to crawl out of <a href=\"http://en.wikipedia.org/wiki/Inside_Job_(film)\">the financial hole it dug itself into</a>, perhaps victories in the struggle to make education accessible to all will continue to be in the form of <del>dealing adderall to pay tuition</del> minor accomplishments that steer the discourse of the issue away from strictly financial dealings and more toward a moral imperative.</p>\n<p>For those of you stressed about finals, just remember that it&#x2019;s damn near impossible to have your student debt canceled. Make sure you get good grades to justify the fact that you&#x2019;ll still be paying for those credits 15 years from now!</p>\n<p>More on the Cooper Union protest <a href=\"http://wesleying.org/2012/12/04/cooper-union-students-occupy-demand-free-tuition/\" target=\"_blank\">here</a>.</p>\n\n\t\t\t\t</div>\n\t\t\t\t\n\t\t\t</div>",
    "date_published": "2012-12-11 16:32:00",
    "dek": null,
    "lead_image_url": "http://wesleying.org/wp-content/uploads/2012/12/CooperUnion3.jpeg",
    "title": "Cooper Union Students End Occupation, Eat Things That Aren’t Ramen",
    "rendered_pages": 1
}