{
    "domain": "www-nc.nytimes.com",
    "next_page_id": null,
    "url": "http://www-nc.nytimes.com/2012/12/16/arts/design/holland-cotter-weighs-the-best-art-shows-of-2012.html?=pagewanted=all&_r=6&",
    "short_url": "http://rdd.me/3mruinia",
    "author": "HOLLAND COTTER",
    "excerpt": "Ayo’s “Pastoral (Den’en)” (1956), part of the show “Tokyo 1955-1970: A New Avant-Garde.\" More Photos » FOR New York’s",
    "direction": "ltr",
    "word_count": 1058,
    "total_pages": 1,
    "content": "<div id=\"article\" score=\"40.0\">\n\n<div class=\"columnGroup first\" score=\"37.5\">\t\t\t\t\n     <figure class=\"articleSpanImage\" score=\"35.6875\"><span score=\"-2.25\">\n<img src=\"http://graphics8.nytimes.com/images/2012/12/16/arts/16COTTER1_SPAN/16COTTER1_SPAN-articleLarge.jpg\" width=\"600\" alt=\"\" border=\"0\"><meta value=\"http://graphics8.nytimes.com/images/2012/12/16/arts/16COTTER1_SPAN/16COTTER1_SPAN-articleLarge.jpg\"><meta value=\"600\"><meta value=\"299\">\n<p class=\"caption\">Ayo’s “Pastoral (Den’en)” (1956), part of the show “Tokyo 1955-1970: A New Avant-Garde.\" <a href=\"http://www.nytimes.com/slideshow/2012/12/16/arts/design/20121216_COTTER.html\">More Photos »</a></p>\n</span>\n</figure>  \n<nyt_byline>\n</nyt_byline>\n\n<meta name=\"emailThisHash\" value=\"RhNvdNWURlULjrft0jXAvw\"><div class=\"articleBody\">\n<span>\n<meta value=\"The New York Times Company\"><meta value=\"http://www.nytco.com/\"><meta value=\"NYSE NYT\"></span>\n<meta value=\"2012\"><nyt_text><nyt_correction_top></nyt_correction_top><p>\nFOR New York’s big art institutions 2012 was a dull year at the top. Pragmatism prevailed. In one case this meant keeping strategic silence. The Metropolitan Museum stayed mum about specific plans for the Whitney’s Breuer Building, which it will occupy in 2015, the day after tomorrow in scheduling terms, while it hired yet another curator of modern and contemporary art.        </p> \n</nyt_text></div>\n                                                              \n\n\n<div class=\"articleBody\" score=\"30.0\">\n <p>\nEverywhere marquee shows tended to be undisguised cash cows: plug in superstar names, do little of interest with them, watch the crowds herd through. Thus we were spoon-fed Warhol at the Met and Picasso at the Guggenheim. What did we learn? That Warhol influenced a lot of artists, and that Picasso painted in black and white. Who knew?        </p><p>\nAt the Modern we got a celebrity-object show. Munch’s 1895 pastel version of “The Scream,” notable for the $119.5 million it fetched at Sotheby’s last May, is on a six-month loan to the museum from its new owner, the financier and MoMA trustee Leon Black. Otherwise undistinguished, it sits alone, sucking up attention, at the center of the museum’s permanent galleries, accompanied by guards for crowd control.        </p><p>\nAnd nice though it was to see veterans like Richard Artschwager and Yayoi Kusama, now in their 80s, taking solo spins at the Whitney Museum, you had to wonder why they’d been chosen over other deserving but less consistently rewarded contemporaries. That both have, in late career, come to be represented by Gagosian Gallery may be worth pondering.        </p><p>\nAlso worth a thought is whether mild events like the smartly installed Wade Guyton solo at the Whitney would have received the extensive notice it did if more challenging fare had been around this year. The 2012 Whitney Biennial at least did its job in locating a couple of recent trends: M.F.A. Outsider Art and Neo-Victoriana. Historians of the future should have fun with both. Walking through, I had flashes of the spookily ingenious Museum of Jurassic Technology in Los Angeles. And that’s a compliment, pretty much.        </p><p>\nIn general during the year, though, you had to look off-center, either to smaller shows or smaller museums for stimulation, to find what you didn’t already know, including revisionist views of two masters. “Bernini: Sculpting in Clay,” at the Met, offered one. Marble sculptures by the prodigious Baroque artist are rarely seen outside Italy. (The J. Paul Getty Museum in Los Angeles brought some together in 2008.) The terra cotta models are in some ways even better than the final sculptures: the first, untrammeled thoughts of a supremely expressive hand and eye.        </p><p>\n“Joseph Albers in America: Painting on Paper” at the Morgan Library &amp; Museum, while less spectacular, was even more surprising. Based on his precision-made series of geometric paintings “Homage to the Square,” Albers is often taken for a militantly uptight formalist. The sketches and color studies, peppered with written notes to self, in the Morgan show revealed a different artist entirely, the equivalent of a tantric adept, seeking aesthetic and spiritual expansion through discipline.        </p><p>\nMoMA also went for the not-obvious in “Tokyo 1955-1970: A New Avant-Garde.” The show radically increases our knowledge of 20th century Japanese modernism, hitherto known, to the extent it is known at all, for the movement called Gutai. Gutai was there at MoMA, but so was much, much more, including a cache of immediately postwar Surrealist paintings familiar to practically no one, in or out of Japan.        </p><p>\nNo New York exhibition did a more impressive job of writing new history than the panoramic “Caribbean: Crossroads of the World,” which appeared simultaneously at El Museo del Barrio, the Studio Museum in Harlem and the Queens Museum of Art. The story told dates back centuries and comes into the present, and is an integral part of the fabric of New York City itself, an immigrant destination.        </p><nyt_correction_bottom score=\"7.5\">\n</nyt_correction_bottom><nyt_update_bottom></nyt_update_bottom></div>\n</div>\n\n\n\n\n\n\n\n\n\n\n\n\n</div>\n<hr class=\"rdb-page-break\" /><div id=\"article\" score=\"40.0\">\n\n<div class=\"columnGroup first\" score=\"28.75\">\t\t\t\t\n     \n\n\n\n<meta name=\"emailThisHash\" value=\"RhNvdNWURlULjrft0jXAvw\"><div class=\"articleBody\">\n<span>\n<meta value=\"The New York Times Company\"><meta value=\"http://www.nytco.com/\"><meta value=\"NYSE NYT\"></span>\n<meta value=\"2012\"><nyt_text><nyt_correction_top></nyt_correction_top><p>\nAt the same time an extraordinary out-of-town show, “Revealing the African Presence in Renaissance Art” at the Walters Art Museum in Baltimore, brought comparable breadth to an even less-charted reality, that of an African European culture that the textbooks, until now, have left out.        </p> \n</nyt_text></div>\n                                                              \n\n\n<div class=\"articleBody\" score=\"30.0\">\n <p>\nDespite the bad economy the Whitney broke ground as planned on its new downtown building, while farther south, in Pennsylvania, the Barnes Foundation closed in one location and reopened as a new quasi-replica in another. One of the myths used to justify the move was that the museum — which was also the home of its founder, Albert C. Barnes, in suburban Merion — was too far from Philadelphia, though it was only nine miles from downtown. (Manhattan top to bottom is more than 13 miles.) Another was that the art, as installed to Barnes’s specifications, was impossible to see there, which wasn’t true, and anyway, revamped lighting would have solved any such problems.        </p><p>\nThe real problem seems to have been that the old Barnes was a no-frills, just-look-at-the-art place with no moneymaking amenities. The new, candy-box version in Philadelphia has a restaurant and a hangar-size hall ideal for party rentals. What’s missing — and I’m in a minority in thinking so — are two elusive and unrecoverable elements, conceptual purpose and personality, which the old Barnes, like the Isabella Stewart Gardner Museum in Boston, had in spades. America, with its blithe mania for updating and wrecking old things, puts its few, oddball total-work-of-art institutions in constant jeopardy. Now it has effectively eliminated one.        </p><p>\nStill, the year comes to a close with at least one forceful preservationist gesture, this one made, perhaps surprisingly, by young people. On Dec. 3, 11 art students at Cooper Union in the East Village in Manhattan barricaded themselves inside the institution’s main building to resist administrative plans for phasing out the century-old founding principle of giving full scholarships to all students admitted.        </p><p>\nCooper Union’s founder, the industrialist and inventor Peter Cooper (1791-1883), expressly created it to be free, based on merit, for all students regardless of class, sex or race. Among its impressive list of alumni are many who would otherwise not have had access to art training. The occupation lasted just a week. But in protesting what they called Cooper Union’s emphasis, coming from the top, “on profitability over quality,” they advanced an argument that will continue and has many applications. Their words sum up art in 2012; maybe their protest prefigured 2013.        </p><nyt_correction_bottom score=\"7.5\">\n</nyt_correction_bottom><nyt_update_bottom></nyt_update_bottom></div>\n</div>\n\n\n\n\n\n\n\n\n\n\n\n\n</div>\n",
    "date_published": "2012-12-13 00:00:00",
    "dek": null,
    "lead_image_url": "http://graphics8.nytimes.com/images/2012/12/16/arts/16COTTER1_SPAN/16COTTER1_SPAN-articleLarge.jpg",
    "title": "Finding Stimulation Along the Edges",
    "rendered_pages": 2
}