{
    "domain": "gawker.com",
    "next_page_id": null,
    "url": "http://gawker.com/5984794/cooper-union-might-not-be-free-anymore",
    "short_url": "http://rdd.me/0awisfph",
    "author": "Max Rivlin-Nadler",
    "excerpt": "Tuition-free arts school Cooper Union, whose new academic building peeks out of Cooper Square like a beautiful, serene spaceship, will most likely start charging students tuition to make up for a&hellip;",
    "direction": "ltr",
    "word_count": 243,
    "total_pages": 0,
    "content": "<div class=\"post-body\" score=\"25.0\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p><figure rel=\"lytebox\" href=\"http://img.gawkerassets.com/img/18exlkaid47bmjpg/original.jpg\" class=\"figure\"></figure>Tuition-free arts school Cooper Union, whose new academic building peeks out of Cooper Square like a beautiful, serene spaceship, will most likely start charging students tuition to make up for a shortfall of <a href=\"http://www.nytimes.com/2013/02/16/nyregion/cooper-unions-tradition-of-free-tuition-may-be-near-end.html?pagewanted=1&amp;_r=1&amp;hp&amp;\">about 12 million dollars each year</a>. The school began <a href=\"http://gothamist.com/2012/04/24/cooper_union_to_make_graduate_stude.php\">charging tuition for graduate students last year</a>, a decision that was met with student protests, including a group of students who barricaded themselves inside of the iconic original Cooper Union building.</p> <p>Students and alumni knew for a while that school president Jamshed Bharucha would explore tuition options — last August he asked the school's different division to come up with budget options that would most likely include tuition revenue. The art school refused, and in response, the \"the trustees decided not to send out early acceptance letters to this year's art school applicants.\" Ouch.</p> <p>Faculty, alumni, and students have been trying to find alternative ways to make up the budget shortfall, including trying to land a big donor, like its founder Peter Cooper, and some have floated the name Michael Bloomberg (they must be truly desperate to consider him, champion of austerity).</p> <p>But by even requiring some students to pay tuition, the egalitarian roots of Cooper Union will be cut, a steady upward rise of tuition, though promised against, will be almost certain (which is what happened with CUNY during NYC's last financial crisis), and one of the last true meritocracies in the American academy will be lost.</p> <p>[<em>Image by David Shankbone</em>]</p>\n\n\t\t\t\t\t\t\n\t\t\t\t\t</div>\n\t\t\t\t",
    "date_published": "2013-02-17 11:40:00",
    "dek": null,
    "lead_image_url": "http://img.gawkerassets.com/img/18exlkaid47bmjpg/fb.jpg",
    "title": "Cooper Union Might Not Be Free Anymore",
    "rendered_pages": 1
}