{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2013/05/bharucha_talks_to_occupiers.php",
    "short_url": "http://rdd.me/l4v20tau",
    "author": "Sydney Brownstone",
    "excerpt": "@FreeCooperUnion/U-streamAfter nearly a week of avoiding confrontation with the group of Cooper Union students staging a sit-in in his office, last night president Jamshed Bharucha went up to the&hellip;",
    "direction": "ltr",
    "word_count": 479,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"><table class=\"image right\" border=\"0\" width=\"250\"><tr><td><img alt=\"bharucha_2.jpg\" src=\"http://blogs.villagevoice.com/runninscared/bharucha_2.jpg\" width=\"250\"></td></tr><tr><td class=\"credit\">@FreeCooperUnion/U-stream</td></tr></table></span>After nearly a week of avoiding confrontation with the group of Cooper Union students staging a sit-in in his office, last night president Jamshed Bharucha went up to the seventh floor to speak to them.</p>\n\n<p>The conversation followed a forum in the school's Great Hall, during which Bharucha, an accomplished violinist, tried to explain his feelings about the end of the school's free tuition through a musical analogy. </p>\n\n<p>\"I tend to feel and express my emotions mostly through music, which plays constantly through my head,\" he told students. \"So I hear your mournful tones, I hear your high pitched agitation, I hear your yearning for resolution and harmony. But I also hear the crescendo of hope.\"<br></p>\n<a name=\"more\"></a>\n<p>\"I'm committed to working with you with all my heart and soul,\" Bharucha continued. \"There is so much that's unique about Cooper, so much that's inevitable, that's hard to put into words, and even spiritual.\"</p>\n\n<p>Bharucha then faced a flurry of criticism from both students and professors. Joe Riley, a senior in the art school, read a letter from his mother accusing the board of trustees of squandering money to hedgefund managers brought in to coach the administration. Walid Raad, an associate art professor, told Bharucha that he'd want to see a board and president that didn't shy away from fundraising even a billion dollars to keep tuition free for students. Bharucha was asked if he was going to resign, though he replied that he remained committed to Cooper.</p>\n\n<p>At the end of the forum, one student tearfully asked Bharucha to convince her that he could give her a school that wouldn't expand into something she did not want. \"Please convince me right now, right here, that you can give me Cooper Union,\" she asked.</p>\n\n<p>Bharucha took that as an opportunity to head upstairs with two trustees and meet the group occupying his office. </p>\n\n<p>The conversation on the seventh floor went on for more than an hour, though students said they felt it was far from productive. Student speakers also shot down several comments from one trustee, who told them he \"did my fair share of demonstrations in the '50s and '60s.\" </p>\n\n<p>\"That's condescending,\" one student said.</p>\n\n<p>The discussion then volleyed between indignation and laughter--and neither side saying much to appease the other. Students tried to negotiate shared governance between the student body and the board, but eventually, after midnight, Bharucha said he had a family to attend to and left.</p>\n\n<p>\"I think the conversation was dominated by people telling him 'You haven't answered my question,'\" art student and organizer Victoria Sobel said. \"The conversation was unmoderated and he came on his terms--he came and left when he pleased. I think the format of the dialogue prevented genuine discussion,\" she said. The group occupying his office would continue to reach out and build attention, Sobel added, in addition to looking at legal options.</p>\n\n<p>[<a href=\"https://twitter.com/sydbrownstone\">@sydbrownstone</a>][<a href=\"mailto:sbrownstone@villagevoice.com\">sbrownstone@villagevoice.com</a>]<br></p>                                                <article-signup type=\"email\" size=\"large\"></article-signup>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                </div>",
    "date_published": "2013-05-14 10:21:12",
    "dek": null,
    "lead_image_url": "http://blogs.villagevoice.com/runninscared/bharucha_2.jpg",
    "title": "Cooper Union President Finally Speaks to Students Occupying His Office",
    "rendered_pages": 1
}