{
    "domain": "tv.msnbc.com",
    "next_page_id": null,
    "url": "http://tv.msnbc.com/2012/12/04/cooper-union-students-stage-civil-disobedience-in-defense-of-free-higher-ed/",
    "short_url": "http://rdd.me/vwybfpa5",
    "author": null,
    "excerpt": "On December 3, 2012, students at New York&#x2019;s Cooper Union occupied one of the school&#x2019;s buildings and hung a banner reading, &#x201C;FREE EDUCATION FOR ALL.&#x201D; (Photo courtesy of&hellip;",
    "direction": "ltr",
    "word_count": 1313,
    "total_pages": 0,
    "content": "<div><div class=\"entry-content\">\n\t\t\t<div class=\"feat-image-with-caption alignright\"><img width=\"400\" src=\"http://msnbctv.files.wordpress.com/2012/12/cooper1-e1354654670848.jpg?w=400&amp;h=370\" class=\"alignright post-image\" alt=\"On December 3, 2012, students at New York's Cooper Union occupied one of the school's buildings and hung a banner reading, &quot;FREE EDUCATION FOR ALL.&quot; (Photo courtesy of Free Cooper Union)\"><p class=\"wp-caption-text\">On December 3, 2012, students at New York&#x2019;s Cooper Union occupied one of the school&#x2019;s buildings and hung a banner reading, &#x201C;FREE EDUCATION FOR ALL.&#x201D; (Photo courtesy of Free Cooper Union)</p></div><p>Students at one of the last tuition-free universities in the United States have occupied a student building to protest the administration&#x2019;s revenue-generating proposals.</p>\n<p>Eleven undergraduates from New York&#x2019;s Cooper Union have occupied a room on the eighth floor of the school&#x2019;s Foundation Building, demanding that the school reaffirm its commitment to providing free education, and that it restructure the board of trustees to include student and faculty input. Additionally, they have called for the resignation of university president Jhamshed Bharucha.</p>\n<p>For over a century, Cooper Union offered free education to&#xA0;<em>all</em> its students, whether they were graduates or undergraduates. However, Bharucha announced in April of this year that the school would <a href=\"http://www.nytimes.com/2012/04/25/nyregion/cooper-union-will-charge-tuition-for-graduate-students.html\">begin charging tuition fees to graduate students</a>, a move which occupiers said was representative of the administration&#x2019;s poor management style.</p>\n<p>&#x201C;Most people found that out from an exclusive he gave to the&#xA0;<em>New York Times</em> instead of talking to the community,&#x201D; said Casey Gollan, a senior in the Cooper Union School of Art and one of the occupiers. When the administration speaks, he said, &#x201C;all of the rhetoric is about community involvement, but actually they&#x2019;ll just silence people and then move forward.&#x201D;</p>\n<p>Gollan and others who support the protest said the administration had spent months pushing the school away from its core mission of offering free education to the student body. Speaking off the record, two full-time undergraduate professors said they felt &#x201C;coerced&#x201D; by the administration into coming up with proposals to charge students tuition.</p>\n<p>&#x201C;I&#x2019;ve been told point-blank my job is on the line if I don&#x2019;t participate,&#x201D; said one professor, who added that the warning had come straight from the university dean. &#x201C;They never made a direct threat,&#x201D; he said. &#x201C;The threat was essentially, you either participate in revenue-generating programs, or your school would be closed.&#x201D;</p>\n<p>The Cooper Union protest is part of a global trend, said Angus Johnston, an expert in student activism at the City University of New York. As MSNBC has <a href=\"http://tv.msnbc.com/2012/11/21/london-students-join-global-wave-of-tuition-protests/\">previously reported</a>, university students around the world&#x2014;notably in California, London, Montreal and several South American cities&#x2014;have engaged in high-profile demonstrations against attempts to raise the cost of higher education.</p>\n<p>Rachel Appel, another senior in the art school, said that the occupiers were very conscious of their place in that global trend. &#x201C;We feel that Cooper Union represents the issue of rising tuition costs nationwide, which are endemic,&#x201D; said Appel, who organizes for the activist group Students for a Free Cooper Union and helps the occupiers liaise with the outside world.</p>\n<p>&#x201C;What we&#x2019;re thinking about is how to create the world that we want to live in, and Cooper is basically an example of that right now,&#x201D; said Gollan. He said that the occupiers were &#x201C;totally in solidarity&#x201D; with students of other universities who have had to assume crushing debt burdens in order to obtain their diplomas.</p>\n<p>Gollan estimated that planning for the occupation began about a month ago. On noon Monday, the eleven students (along with Kali Hays, a student reporter for the&#xA0;<a href=\"http://www.newschoolfreepress.com/2012/12/04/cooper-union-occupation-continues-into-second-day/\"><em>New School Free Press</em></a>) entered the Foundation Building&#x2019;s Peter Cooper suite and barricaded the entrance with wood and steel. They also hung a red banner from the front of the building, reading &#x201C;FREE EDUCATION FOR ALL.&#x201D;</p>\n<p>Within twenty minutes, university maintenance staff were trying to ram the barricade. Students heard the sounds of saws and drills and pressed themselves up against the barricade, yelling that the maintenance staff would injure them if they tried to cut their way through.</p>\n<p>Appel said that she and two other students &#x201C;came over immediately to stop anything from happening.&#x201D; When she arrived at the building, she encountered administration officials who said they had asked maintenance staff to stop trying to cut through the barricades, citing safety concerns. Appel theorized that &#x201C;the staff were just scaring them&#x201D; with the sound of saws and drills.</p>\n<p>Since the beginning of the protest, the occupiers have established a <a href=\"http://freecooperunion.com/\">website</a>, a <a href=\"https://twitter.com/freecooperunion\">Twitter account</a>, and a <a href=\"http://www.livestream.com/occupynyc\">livestream of the inside of the occupation</a>. Gollan and Appel both said the students were equipped to stay for the long haul, noting that they have plenty of food and that the Peter Cooper suite comes equipped with a bathroom.</p>\n<p>Johnston said that such preparations are a natural response to the escalating tactics being used by universities to break up student protests. &#x201C;Students have had to become a lot more tactically savvy because of the willingness of the administration and law enforcement to go in and conduct mass arrests, and, in many cases, engage in police violence as well,&#x201D; he said. &#x201C;In the early &#x2019;90s, when I was a student, you could take over an administration building and be pretty sure that nothing horrible was going to happen to you.&#x201D; But recent events&#x2014;such as an infamous <a href=\"http://www.huffingtonpost.com/2012/09/26/uc-davis-pepper-spraying-settlement_n_1916803.html\">pepper spray incident</a> on the UC Davis campus in 2011&#x2014;suggest those days are over.</p>\n<p>&#x201C;I think it&#x2019;s a very powerful statement that these students are willing to risk arrest, to risk academic sanctions, to keep the college free, when they&#x2019;re not at risk of being charged tuition themselves,&#x201D; he said. Indeed, none of the revenue raising initiatives proposed by the administration would effect undergraduates currently enrolled at the university.</p>\n<p>&#x201C;I&#x2019;m not fighting for myself in any way,&#x201D; said Appel. &#x201C;For every single student at this school, scholarships have been guaranteed. We are literally fighting for future generations which have not come.&#x201D;</p>\n<p>Support has poured in from other corners, as well. Gollan said that people from all over the world have been sending the occupiers messages of encouragement through Twitter, and the Free Cooper Union website reports that it has received <a href=\"http://freecooperunion.com/\">over $300,000 in pledged donations</a>. Appel said that the Cooper Union protesters had also consulted with activists from NYU and the New School, who have also occupied university buildings in recent years.</p>\n<p>On the campus itself, some faculty and students have also expressed feelings of solidarity, though some faculty said they fear retaliation from the university if their support for the students&#x2019; demands was made public (especially their demand that the university president resign). A handful of freshmen even reportedly staged a sibling occupation, spending the night in another university building. Someone, most likely someone within the engineer school faculty, leaked to the activists a <a href=\"http://www.pdf-archive.com/2012/12/04/summary/\">proposal</a> under consideration by the administration to start charging tuition for engineer students. And at 2:30 PM on Tuesday, faculty members stood at a press conference outside the Foundation Building to present a letter reaffirming their support for a tuition-free school. Over 20 professors at the university had signed the letter.</p>\n<p>One of those faculty members, who chose to remain anonymous for fear of administration reprisal, said he had taught some of the students involved in the action. &#x201C;They&#x2019;re some of the best students I&#x2019;ve ever had the pleasure of teaching in my career as a professor,&#x201D; he said. &#x201C;They&#x2019;re completely committed to [the school's] mission in the way I wish everyone was committed, and I couldn&#x2019;t be more proud when they hung that banner from our clock tower.&#x201D;</p>\n<p>Members of the Cooper Union administration did not respond to a request for interview, but one of their press officers sent a statement reading:</p>\n<blockquote><p>Our priority is for the safety of our students, and to assure that the actions of a few do not disrupt classes for all. The eleven art students who have locked themselves in the Peter Cooper Suite do not reflect the views of a student population of approximately 1,000 architects, artists and engineers. President Jamshed Bharucha has held informal meetings with various groups of students on campus throughout the morning. Vice President of Finance T.C. Westcott is in contact with the students&#x2019; designated spokesperson, and we understand that they have access to food, water and sanitary facilities.</p></blockquote>\n<div id=\"jp-post-flair\" class=\"sharedaddy sd-sharing-enabled\"></div>\t\t</div>\n\t\t\n\t</div>",
    "date_published": "2012-12-04 16:59:00",
    "dek": null,
    "lead_image_url": "http://msnbctv.files.wordpress.com/2012/12/cooper1-e1354654670848.jpg",
    "title": "Cooper Union students stage civil disobedience in defense of free higher ed — MSNBC",
    "rendered_pages": 1
}