{
    "domain": "www.blouinartinfo.com",
    "next_page_id": null,
    "url": "http://www.blouinartinfo.com/news/story/909216/at-cooper-union-renegade-art-show-the-protest-spirit-endures",
    "short_url": "http://rdd.me/a08ry5gx",
    "author": "Kate Deimling",
    "excerpt": "Cooper Union students have now occupied the school&#x2019;s president Jamshed Bharucha&#x2019;s&#xA0;office since May 8, and on Tuesday evening their protest against the school&#x2019;s decision to&hellip;",
    "direction": "ltr",
    "word_count": 1059,
    "total_pages": 0,
    "content": "<div><div class=\"field-item even\"><p><strong>Cooper Union</strong> students have now occupied the school&#x2019;s president <strong>Jamshed Bharucha</strong>&#x2019;s&#xA0;office since May 8, and on Tuesday evening their protest against the school&#x2019;s decision to begin charging tuition in fall 2014 morphed into an art show and salon on the seventh floor of the school&#x2019;s historic Foundation Building. As the downstairs floors concurrently exhibit the school&#x2019;s annual show of student work, the top floor instead features colorful protest banners, and artworks satirizing both Bharucha and the school&#x2019;s decision. After viewing the architectural models and final art projects below, exhibition-goers continued above, plastic cups of white wine in hand, to find students still taping up protest-related artwork. Nearby, screens played videos of the sit-in as well as a student performance based on <a href=\"http://blogs.villagevoice.com/runninscared/2013/05/cooper_union_secret_transcript.php\" rel=\"nofollow\">the leaked transcript of a September board meeting</a>,&#xA0;in which the trustees raised the possibility of shuttering the school for five years.</p><p>Now that classes are over, the numbers of protesters have decreased, but students say they aren&#x2019;t worried about losing momentum. &#x201C;There&#x2019;s no end date&#x201D; to the occupation of Bharucha&#x2019;s office, sophomore art student <strong>Devonn Francis</strong> told <strong>ARTINFO</strong>. &#x201C;Some people will go away, but there&#x2019;s been a consistent group of 15 or 20 people.&#x201D; <strong>Victoria Sobel</strong>, a graduating art student, described the board as a &#x201C;closed loop with no accountability.&#x201D; She complained that &#x201C;Jamshed and [board chair] <strong>Mark</strong> [<strong>Epstein</strong>] do an inaccurate job representing our intentions. They make us out to be uncivilized or unruly, and they&#x2019;re trying to make it seem more nebulous when we have concrete demands.&#x201D;</p><p>The students&#x2019; demands, which were posted on the wall of the seventh floor, are 1) the resignation of Jamshed Bharucha, 2) more transparency and accountability in the governance of the school, and 3) the reversal of the decision to charge tuition. When asked about the board&#x2019;s response to these demands, board chair Epstein told ARTINFO via email that &#x201C;the issues at the Cooper Union go a lot deeper than these demands.&#x201D; He went on to say that, &#x201C;although we care very much about all of our students, there are those (a very vocal minority) that confuse the board&#x2019;s not heeding their demands, with the board&#x2019;s not hearing their demands.&#x201D;</p><p>In fact, there&#x2019;s been a lot of resistance to the board&#x2019;s decision to charge tuition, and not just from a vocal minority. After the students held a vote of no confidence in Bharucha&#x2019;s office, the full-time arts and humanities faculty unanimously followed suit. The <a href=\"http://www.nytimes.com/2013/05/11/business/how-cooper-unions-endowment-failed-in-its-mission.html?pagewanted=all\" rel=\"nofollow\">New York Times&#x2019; <strong>James B. Stewart</strong></a> and <a href=\"http://blogs.reuters.com/felix-salmon/2013/05/19/cooper-unions-shameless-trustees/\" rel=\"nofollow\">Reuters finance blogger <strong>Felix Salmon</strong></a> have both criticized the board for financial mismanagement that has led to a state of crisis, and trustee <strong>Jeffrey Gural</strong>, who is unhappy with the decision to charge tuition but at this point sees it as the only option, acknowledged in an email to ARTINFO that &#x201C;mistakes were made in the past regarding how to deal with the deficit.&#x201D; Epstein clashed with Salmon at <a href=\"http://www.democracynow.org/2013/5/16/debate_what_caused_cooper_unions_fiscal\" rel=\"nofollow\">a Democracy Now debate over the issue</a> and maintained to ARTINFO that his criticisms are &#x201C;factually incorrect.&#x201D; Yet, as Salmon suggested, it is hard to find anyone who is not on the board of trustees who agrees that the $175-million loan for the new building is not the main cause of Cooper Union&#x2019;s financial woes.</p><p>At one time, other options besides charging tuition were on the table. A year ago, both the <a href=\"http://friendsofcooperunion.org/vote-no-confidence/\" rel=\"nofollow\"><strong>Friends of Cooper Union</strong></a> (an organization of concerned alumni) and the <a href=\"https://taskforce.cooper.edu/home\" rel=\"nofollow\"><strong>Cooper Union Revenue Task Force</strong></a> convened by Bharucha proposed other financial solutions that preserved full-tuition scholarships, and according to the task force&#x2019;s <a href=\"http://cooper.edu/sites/default/files/uploads/assets/site/files/RTF-FINAL-REPORT.pdf\" rel=\"nofollow\">final report</a>,&#xA0;consulting firm <strong>Maguire Associates</strong> recommended that to model tuition revenues, scholarships should be reduced by no more than 25 percent. Instead, the board decided to reduce them by 50 percent. Tuition is valued at $38,500, which means that most students will be required to pay $19,250. (The trustees say that&#xA0;<a href=\"http://cooper.edu/about/trustees/board-trustees-statement-future-plans-cooper-union\" rel=\"nofollow\">students who demonstrate the greatest financial need will receive 100% scholarships.</a>)</p><p>At <a href=\"http://www.nytimes.com/2013/05/30/nyregion/bloomberg-urges-cooper-union-graduates-to-donate.html?_r=0\" rel=\"nofollow\">his commencement address at Cooper Union Wednesday</a>, <strong>Mayor Michael Bloomberg</strong> did not take sides on the tuition issue, but urged students to do as Peter Cooper did and &#x201C;donate what you can.&#x201D; Epstein has consistently faulted the alumni for low rates of giving, stating that, traditionally, only 20 percent donate to the institution. In fact, <a href=\"http://www.notnicemusic.com/giving.pdf\" rel=\"nofollow\">a document provided by an alumnus on the Alumni Pioneer blog</a> indicates that alumni participation stood at 30 percent in 2002, though it has fallen fairly steadily since then, dropping two or three percentage points a year after the recession in 2008 to bottom out at 22 percent in 2011. And in the September board meeting transcript that was leaked to the Village Voice, <strong>Derek Wittner</strong>, vice president of alumni affairs and development, cites a 24 percent rate of alumni participation for 2012. More importantly, Wittner took the <em>trustees </em>to task for not giving as generously as those of other institutions. &#x201C;Most campaigns end up with the board contributing 20-30% of campaign total,&#x201D; Wittner stated at the time. &#x201C;This board contributed something like 12% last time around. That can&#x2019;t happen.&#x201D;</p><p>While the students don&#x2019;t seem ready to let up anytime soon, it&#x2019;s not at all clear whether the protest will ultimately be effective. Since the occupation, three trustees, including Bharucha (who sits on the board), have met with the students occupying the president&#x2019;s office. &#x201C;I think some of the student demands are reasonable and others are not,&#x201D; trustee Jeffrey Gural, who met with the protesters, told ARTINFO. &#x201C;I was hoping to convince them to discontinue occupying the president&#x2019;s office as I thought it was counterproductive; however, they disagreed.&#x201D; When asked if he planned to meet with the students who are sitting in, Epstein replied that the board had met regularly with student representatives and that &#x201C;at these meetings the students can ask whatever they want to.&#x201D;</p><p>With American student debt <a href=\"http://www.npr.org/2012/04/24/151305380/student-loan-debt-exceeds-one-trillion-dollars\" rel=\"nofollow\">now exceeding one trillion dollars</a>, the exceptionalism and idealism of Cooper Union&#x2019;s free tuition may make it seem irrelevant beyond Peter Cooper&#x2019;s 19th-century brownstone walls. But, as ARTINFO&#x2019;s <strong>Ben Davis</strong> <a href=\"http://www.blouinartinfo.com/news/story/905940/why-cooper-unions-tuition-fight-matters-for-the-future-of-art\">pointed out last week</a>, &#x201C;the issues at stake here form an almost perfect crystal of the forces buffeting art and education in the woebegotten 21st century.&#x201D; For <strong>Dennis Adams</strong>, a Cooper Union art professor, this fight can be called &#x201C;the Alamo of American education.&#x201D; &#x201C;There&#x2019;s a lot at stake here,&#x201D; Adams said Tuesday evening in the crowded Cooper Union hallway. &#x201C;It&#x2019;s small, but it&#x2019;s a massive symbolization. And I&#x2019;m glad to be a part of it.&#x201D;</p></div></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.blouinartinfo.com/sites/default/files/styles/300sq/public/20130530_cooperunion_promo1.jpg",
    "title": "At Cooper Union Renegade Art Show, the Protest Spirit Endures",
    "rendered_pages": 1
}