{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2013/02/cooper_union_art_faculty.php",
    "short_url": "http://rdd.me/nonbgh23",
    "author": "Jason Lewis",
    "excerpt": "via Cooper Union Student Action to Save Our SchoolFaculty from the School of Art at Cooper Union sent a letter to the school's dean Friday opposing proposals to implement tuition-based programs at&hellip;",
    "direction": "ltr",
    "word_count": 460,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"><table class=\"image right\" border=\"0\" width=\"250\"><tr><td><img alt=\"cooper_union_picedited.jpg\" src=\"http://blogs.villagevoice.com/runninscared/cooper_union_picedited.jpg\" width=\"250\"></td></tr><tr><td class=\"credit\">via<a href=\"http://www.cusos.org/students-for-a-free-cooper-union-lock-in-to-cooper-unions-foundation-building-to-preserve-free-education-2/\" target=\"_blank\"> Cooper Union Student Action to Save Our School</a></td></tr></table></span>Faculty from the School of Art at Cooper Union <a href=\"http://www.cusos.org/cooper-union-art-faculty-vote-to-reject-tuition/\" target=\"_blank\">sent a letter </a>to the school's dean Friday opposing proposals to implement tuition-based programs at the college.</p>\n\n<p>The statement marks the latest development in the on-going fight to <a href=\"http://blogs.villagevoice.com/runninscared/2011/11/cooper_union_fi.php\"> preserve</a> the college's long-standing tradition of providing free tuition for all students. The faculty members signed the letter opposing plans to create tuition-based programs during the <a href=\"http://blogs.villagevoice.com/runninscared/2012/12/cooper_union_free_tuition.php\">week-long student lock-in in December</a> when 11 students barricaded themselves inside the college's Foundation Building.</p>\n\n<p>\"Cooper Union is not only the last citadel of the social reforms movement of the 19th century, but is in fact the vanguard of the 21st century-- a beacon of access to free education,\" the letter reads.  \"In this soul searching process our commitment to this fragile and precious mission was reinvigorated.\"</p>\n<a name=\"more\"></a>\n<p>In September, the school's dean, Saskia Bos, tasked the art school faculty with helping her fulfill mandates from CU President Jamshed Bharucha to think up ways to help close the college's nearly $17 million deficit. The faculty members eventually discovered that they weren't truly being charged with thinking up creative solutions, but rather with serving as a rubber stamp for administrative plans to introduce new tuition-based programs.</p>\n\n<p>\"This could have been an opportunity for imagining an academic collective vision of the institution to solve the pressing financial crisis rather than a set of prescribed assignments,\" the letter reads.</p>\n\n<p>Aside from the fact that the faculty members are committed to preserving the maxim of free education, they also aren't convinced that implementing certain tuition programs will help cut into the school's shortfall. A popular proposal from the administration is to implement tuition-based graduate and certificate programs throughout the college's three schools of study. In fact, the college announced last April that it will offer a few such programs starting as early as September.</p>\n\n<p>Day Gleeson, a School of Art professor, told online arts magazine, <a href=\"http://www.artinamericamagazine.com/news-opinion/news/2013-02-04/cooper-union-faculty-opposes-tuition-based-programs/\" target=\"_blank\"><em>Art in America</em></a> that the creation of graduate and certificate programs in the school won't help preserve free undergraduate tuition at the institution.</p>\n\n<p>\"The possibilities we imagined...were to offer MFA programs and certificate programs that would charge tuition to support undergraduate scholarships,\" Gleeson told AIA.  \"But in the end we realized that after the cost of ramping them up, the possibility of getting any revenue from them was almost nil.\" </p>\n\n<p>The faculty believes that it's imperative that the entire institution remain tuition free.</p>\n\n<p>\"Expansion through the development of tuition dependent programs depreciates the historic identity of The Cooper Union,\" the letters states. \"Any solution to The Cooper Union's current financial crisis that depends, even in part on tuition compromises and irreversibly damages the ideals...that faculty, students, staff, and administrators have worked so hard to uphold and maintain, generation after generation.\"</p>                                                <article-signup type=\"email\" size=\"large\"></article-signup>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                </div>",
    "date_published": "2013-02-04 04:44:09",
    "dek": null,
    "lead_image_url": "http://blogs.villagevoice.com/runninscared/cooper_union_picedited.jpg",
    "title": "Cooper Union Art School Faculty Formally Rejects Tuition-Based Proposals",
    "rendered_pages": 1
}