{
    "domain": "www.gazettes.com",
    "next_page_id": null,
    "url": "http://www.gazettes.com/news/education/college-counselor-cooper-union-no-longer-free/article_9fc526c8-c3f4-11e2-aae0-001a4bcf887a.html",
    "short_url": "http://rdd.me/6ufv2q5d",
    "author": "Ralph BeckerCollege Counseling Columnist",
    "excerpt": "Cooper Union for the Advancement of Science and Art &#x2014; located in Manhattan&#x2019;s East Village with 1,000 students and an admission&#x2019;s rate of 8% &#x2014; was founded in 1859 by Peter&hellip;",
    "direction": "ltr",
    "word_count": 733,
    "total_pages": 0,
    "content": "<div><div class=\"content\">\n            \n                    \n                        <div class=\"paragraph-0\"><p>Cooper Union for the Advancement of Science and Art &#x2014; located in Manhattan&#x2019;s East Village with 1,000 students and an admission&#x2019;s rate of 8% &#x2014; was founded in 1859 by Peter Cooper, a successful entrepreneur who designed the first steam railroad engine.</p></div>\n                    \n                \n                    \n                        <div class=\"paragraph-1\"><p>Cooper wanted to create a college, \"equal to the best\" yet \"open and free to all\" regardless of sex, wealth or social status. Cooper Union is comprised of three schools: Irwin Chanin School of Architecture, the School of Art and Albert Nerkin School of Engineering.</p></div>\n                    \n                \n                \n            \n                    <p>The engineering school offers both bachelors and masters degrees in chemical, electrical, mechanical, and civil engineering. Thomas Edison is a notable former student.</p>\n                \n                    <p>The architecture school, ranked among the five top architecture programs in the country, offers a five-year Bachelor of Architecture degree. Elizabeth Diller and Ricardo Scofidio, architects of the Lincoln Center for the Performing Arts Redevelopment project, and the expansion of the Julliard School and the School of American Ballet, are Cooper graduates.</p>\n                \n                    <p>The School of Art&#x2019;s four-year BFA degree allows students to select courses from any of the school&#x2019;s departments, thereby creating their own program of study. Focus is on imagination and creativity. Milton Glaser is a famous alumnus whose graphic designs brand DC Comics, Target and JetBlue.</p>\n                \n                    <p>With the endowment of the land under the Chrysler Building in 1902, Cooper Union had sufficient funding to be tuition free through two world wars, a depression and even the devastating crash of 2008; however, 2013 will put an end to its 111 years of free tuition, leaving Cooper&#x2019;s faculty, students and future applicants shaking their heads in dismay&#x2014; what happened?</p>\n                \n                    <p>What happened were miscalculations in managing its endowment. First, 84% of Cooper&#x2019;s $667 million endowment is in one asset, the land under the Chrysler Building. John Michaelson, chairman of Cooper&#x2019;s investment committee, stated that having so much money in one asset &#x201C;is against everything I stand for.&#x201D; Emory University in Atlanta, which in 2001 had more than 60% of its endowment in Coca Cola stock, sold and diversified. Yet, Cooper&#x2019;s board appears to have a sentimental attachment to the Chrysler Building, describing it as a \"gift from the children of Peter Cooper.\" In 2006 the 666 Fifth Avenue building, which doesn&#x2019;t compare to the Chrysler building, sold for $1.8 billion; Cooper never explored the market.</p>\n                \n                    <p>When Cooper needed to upgrade the engineering facilities, instead of first arranging for a donor, Cooper built a $166 million building using the Chrysler Building as collateral, and then went searching for a donor &#x2014; no one has come forward. In 2008, Cooper&#x2019;s portfolio (excluding the Chrysler Building) was $169 million. By the end of 2012 it had sunk to $86 million and Cooper&#x2019;s operations suffered a cash flow shortfall of $13 million.</p>\n                \n                    <p>This left Cooper Union with two funding alternatives: donations (alumni contributions) and tuition. Cooper has not nurtured a charitable alumni base. It&#x2019;s not easy to do. UCLA Anderson School of Management, to offset state funding declines, is developing alumni giving; it takes time. This leaves raising tuition. Though Cooper&#x2019;s consultants recommended charging a maximum 25% of posted tuition (listed at $38,500 a year) Mark Epstein and his Board of Directors elected to charge 50% (Olin School of Engineering transitioned from tuition free in 2010 to charging 50% &#x2014; a precedent had already been set).</p>\n                \n                    <p>In April, Mark Epstein announced, &#x201C;The time has come to set our institution on a path that will enable it to survive and thrive well into the future.&#x201D; Cooper&#x2019;s President, Jamshed Bharucha, asked faculty for advice on future revenue streams. When the Art School faculty refused to comply, early acceptance letters to art school applicants were not sent out. Mauricio Higuera, a senior art student, while protesting the tuition decision, told a group of about 200 students assembled at the Great Hall, where Lincoln had once given his Cooper Union Address: &#x201C;For 150 years this building, these columns, has held a dream, a dream for free education for all. I propose we all join hands and give this institution a big hug, because it needs it.&#x201D; The crowd encircled the building and complied.</p>\n                \n                    <p><em><strong>Ralph Becker, founder of Ivy College Prep, LLC and a resident of Long Beach, has been counseling students for the last eight years. A former Yale Alumni interviewer, he holds a certificate in college counseling from UCLA Extension, and has published SAT* Vocab 800 Books A, B, C, &amp; D.</strong></em></p>\n                \n    \n    </div> \n    \n    \n    \n\n</div>",
    "date_published": "2013-05-25 02:00:00",
    "dek": null,
    "lead_image_url": null,
    "title": "COLLEGE COUNSELOR: Cooper Union No Longer Free",
    "rendered_pages": 1
}