{
    "domain": "www.thenation.com",
    "next_page_id": null,
    "url": "http://www.thenation.com/blog/174314/occupy-offshoots-return-highlight-student-tuition-hikes-food-sovereignty",
    "short_url": "http://rdd.me/yqbq0yw4",
    "author": "Allison Kilkenny",
    "excerpt": "Over the course of the past week, actions by offshoots of the Occupy Wall Street movement have brought attention to the issues of student tuition hikes and food sovereignty. In New York, a group of&hellip;",
    "direction": "ltr",
    "word_count": 852,
    "total_pages": 0,
    "content": "<div><div class=\"content\">\n    <div class=\"social-buttons\"></div><p>Over the course of the past week, actions by offshoots of the Occupy Wall Street movement have brought attention to the issues of student tuition hikes and food sovereignty. </p>\n<p>In New York, a group of students at Cooper Union took over the college president&#x2019;s office last week to protest a decision to begin charging tuition for the first time in at least a century. The trustees&#x2019; decision caused an uproar at Cooper, previously one of the last remaining free colleges in the country. The school claims it has no choice as it faces a $12 million annual deficit and, as a result, has decided to reduce its financial aid to 50 percent scholarships. </p>\n<p>Activists believe the decision will lead to dire consequences, including limiting access to education. Occupy Wall Street <a href=\"http://occupywallst.org/article/students-occupy-cooper-union-presidents-office/\">states</a> at its website that Cooper Union is by far the most diverse of all elite colleges: &#x201C;white students are a minority here and two-thirds of the student body attended public high schools.&#x201D;</p>\n<p>In response, fifty students took over President Jamshed Bharucha&#x2019;s office on the seventh floor of the school&#x2019;s Foundation Building in Manhattan and signed a statement of no confidence in the president. <a href=\"http://blogs.villagevoice.com/runninscared/2013/05/video_cooper_occupy.php\">Nine full-time members</a> of Cooper Union&#x2019;s art faculty signed onto the petition. </p>\n<p><iframe height=\"337.5\" src=\"http://www.youtube.com/embed/LuunFJZSnYs\" width=\"600\"></iframe></p>\n<p>&#x201C;Out of deep concern about the direction of the Cooper Union under President Jamshed Bharucha, the full-time faculty of the School of Arts adopts a resolution of a vote of No Confidence in President Jamshed Barucha,&#x201D; the <a href=\"https://twitter.com/FreeCooperUnion/status/332240983196577794/photo/1\">statement</a> reads.</p>\n<p><iframe height=\"337.5\" src=\"http://www.youtube.com/embed/xJE1l7McbLw\" width=\"600\"></iframe></p>\n<p>As of Tuesday, Bharucha&#x2019;s office is still occupied.</p>\n<p>&#x201C;In case you were wondering if last night was the end the office is STILL occupied. Twenty-four students beginning to wake. #BharuchaStepDown,&#x201D; Free Cooper Union <a href=\"https://twitter.com/FreeCooperUnion/status/334295142972420096\">tweeted</a>.</p>\n<p>&#x201C;Institutions funded by philanthropy and real estate earnings are clearly unsustainable as foundations for a quality education, but the school&#x2019;s economic problems and its board&#x2019;s regressive solutions mirror the situation currently taking place at countless other universities, both public and private,&#x201D; OWS states. &#x201C;From CUNY tuition hikes to the torpedoing of Medgar Evers College to NYU&#x2019;s unprecedented land grab, students across the city are fighting back. As student struggles continue across the globe, Cooper Union is a flashpoint for something much larger than itself.&#x201D;</p>\n<p>&#x201C;The ongoing fight at Cooper Union is but one part of the broader struggle against austerity, debt, and all other symptoms of capitalism,&#x201D; the group states.</p>\n<p>Occupy could have also included <a href=\"http://www.huffingtonpost.com/2013/05/09/buena-vista-graduation_n_3248553.html\">Buena Vista High School</a> in its list of austerity consequences. The Michigan school was closed six weeks early because the district&#x2014;comprising 400 mostly black, mostly poor students&#x2014;doesn&#x2019;t have enough money to continue operations. The district has laid off <a href=\"http://www.wnem.com/story/22242603/school-year-officially-over-in-buena-vista\">all its teachers</a> and all but three employees. </p>\n<p>On the West Coast, another offshoot of the Occupy movement, Occupy The Farm, experienced a resurgence this week when activists returned to a plot of land owned by the University of California where a few of them had been arrested earlier in the day.</p>\n<p>The activists had moved in over the weekend in order to plant crops.</p>\n<p>Last spring, I wrote about Occupy the Farm&#x2019;s <a href=\"http://www.thenation.com/blog/167822/occupy-farm-highlights-issue-food-sovereignty\">efforts to highlight the issues of food sovereignty</a>, climate change and the overall health of society. At the time, OTF activists had moved onto the Gill Tract, a patch of land along the San Pablo Avenue in Albany, California. The location was chosen because Gill Tract contains the last acres of Class One soil left in the urbanized East Bay. According to the group, ninety percent of the original land has been paved over and developed, irreversibly contaminating the land.</p>\n<p>&#x201C;We envision a future of food sovereignty,&#x201D; OTF stated, &#x201C;in which our East Bay communities make use of available land&#x2014;occupying it where necessary&#x2014;for sustainable agriculture to meet local needs.&#x201D;</p>\n<p><a href=\"https://subscribe.thenation.com/servlet/OrdersGateway?cds_mag_code=NAN&amp;cds_page_id=122425&amp;cds_response_key=I12SART1\">Please support our journalism. Get a digital subscription for just $9.50!</a></p>\n<p>Food sovereignty is really an issue of food security, which is why this movement has been embraced at a global level. La Via Campesina, an international movement that coordinates peasant organizations of small producers, agricultural workers, rural women and indigenous communities from Asia, Africa, the Americas and Europe, defines food sovereignty as &#x201C;the right of people to define agriculture and food policy, including prioritizing local agricultural production, access of peasants and landless people to land, water, seeds and credit.&#x201D;</p>\n<p>A healthy society eats good food and ensures the sovereignty and dignity of the people growing its food.</p>\n<p>OTF activists have returned a year later to Gill Tract in order to fight the same battle. &#x201C;This space is really important,&#x201D; said organizer <a href=\"http://sanfrancisco.cbslocal.com/2013/05/13/occupy-the-farm-protesters-evicted-from-uc-land-tract-in-albany/\">Lesley Haddock</a>. &#x201C;We&#x2019;re not going away.&#x201D;</p>\n<p>&#x201C;We feel that as public land, we all have a stake on what happens to it. We like to see it turned into an urban farm and we intend to see that happen,&#x201D; <a href=\"http://abclocal.go.com/kgo/story?section=news/local/east_bay&amp;id=9100060\">said</a> Haddock.</p>\n<p>The university plans to develop the lot into a senior housing complex and a national chain grocery store.</p>\n<p>University police officers have warned the activists they could be arrested for trespassing, but thus far the standoff remains peaceful.</p>\n<p><em>While Congress dallies on immigration reform, groups are calling for the Obama administration to stop deporting people who are set to gain documented status. Read <a href=\"http://www.thenation.com/blog/174306/while-congress-debates-immigration-deportations-rage\">Aura Bogado&#x2019;s take</a>.</em></p>\n</div></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.thenation.com//sites/default/files/ows_reclaim_ap_fb.jpg",
    "title": "Occupy Offshoots Return to Highlight Student Tuition Hikes, Food Sovereignty",
    "rendered_pages": 1
}