{
    "domain": "www.huffingtonpost.com",
    "next_page_id": null,
    "url": "http://www.huffingtonpost.com/2013/05/08/cooper-union-presidents-office-occupy-tuition_n_3239403.html",
    "short_url": "http://rdd.me/z3psu9ru",
    "author": "Tyler Kingkade, The Huffington Post  |  By Tyler Kingkade Posted: 05/08/2013 5:52 pm EDT",
    "excerpt": "NEW YORK -- A group of students at Cooper Union took over the college president's office Wednesday to protest a decision to begin charging tuition for the first time in at least a century. At least&hellip;",
    "direction": "ltr",
    "word_count": 326,
    "total_pages": 0,
    "content": "<div class=\"articleBody\" score=\"25.0\">\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                                    \n\t\t\t\t\t\t\t\t\t<p>NEW YORK -- A group of students at Cooper Union took over the college president's office Wednesday to protest a <a href=\"http://www.huffingtonpost.com/2013/04/23/cooper-union-tuition_n_3140968.html\" target=\"_hplink\">decision to begin charging tuition</a> for the first time in at least a century.</p>\n\n<p>At least 50 students took over President Jamshed Bharucha's office on the 7th floor of the school's Foundation Building in Manhattan, according to an email from the group. Once inside, they signed a statement of no confidence in Bharucha, according to posts on Twitter.</p>\n\n<p>Citing a <a href=\"http://www.huffingtonpost.com/2013/04/23/cooper-union-tuition_n_3140968.html\" target=\"_hplink\">$12 million annual budget deficit</a>, the Cooper Union Board of Trustees announced in April it had decided to scale back the full scholarship it has traditionally awarded all admitted students. Starting in the fall of 2014, new students with the ability to pay will be billed for half the tuition costs, currently $19,000 per semester. Current students won't be affected.</p>\n\n<p>\"All the people upstairs and doing these sorts of actions to keep this school free -- we're not fighting for ourselves,\" senior Aaron Graham <a href=\"http://blogs.villagevoice.com/runninscared/2013/05/video_cooper_occupy.php\" target=\"_hplink\">told the Village Voice</a>. \"We're fighting for future students because we're all already guaranteed the scholarship we've been given.\" </p>\n\n<p>Cooper Union spokeswoman Claire McCarthy said: \"We consider this a peaceful and nonviolent action. Talks with students are ongoing.\"</p>\n\n<p>A group of<a href=\"http://www.huffingtonpost.com/2012/12/10/cooper-union-occupation-ends_n_2271737.html\" target=\"_hplink\"> students in December occupied</a> the <a href=\"http://www.huffingtonpost.com/2012/12/05/cooper-union-tuition-protest_n_2240768.html\" target=\"_hplink\">top floor of the Foundation Building</a> for a week in December after rumors that the school's financial problems may lead officials to begin charging tuition. </p>\n\n<p>Victoria Sobel, one of the students occupying the president's office, told HuffPost the group hopes the protest will alter trustees' decision about scholarships. \"I'm confident that it will have a large effect,\" Sobel said.</p>\n\n\t<p>Sobel said the students haven't barricaded themselves inside the office. The group has not decided how long they will stay, she said. \"This is just the beginning\" of students' fight against tuition, she vowed. </p>\n\n<p>Cooper Union students planned a <a href=\"https://www.facebook.com/events/666580176701209/?fref=ts\" target=\"_hplink\"> 6 p.m. Wednesday demonstration</a> at Cooper Square, which organizers said will be attended by students from several Manhattan colleges.</p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t",
    "date_published": "2013-05-08 17:05:01",
    "dek": null,
    "lead_image_url": "http://i.huffpost.com/gen/1127843/thumbs/o-COOPER-UNION-PRESIDENTS-OFFICE-facebook.jpg",
    "title": "Cooper Union Students Occupy President's Office To Protest Tuition Announcement",
    "rendered_pages": 1
}