{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2013/05/cooper_union_slavin_trustee.php",
    "short_url": "http://rdd.me/cdhuu9my",
    "author": "Sydney Brownstone",
    "excerpt": "Youtube/NoemCharlotteThievesThe results came in on Friday. After announcing he'd run the day the Cooper Union administration stated it would begin charging tuition starting with the class of 2014,&hellip;",
    "direction": "ltr",
    "word_count": 452,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"><table class=\"image right\" border=\"0\" width=\"240\"><tr><td><img alt=\"slavin.jpg\" src=\"http://blogs.villagevoice.com/runninscared/slavin.jpg\" width=\"240\"></td></tr><tr><td class=\"credit\">Youtube/NoemCharlotteThieves</td></tr></table></span>The results came in on Friday. After announcing he'd run the day the Cooper Union administration stated it would begin charging tuition starting with the class of 2014, <a href=\"http://www.media.mit.edu/people/slavin\" target=\"_blank\">Kevin Slavin</a>, tech entrepreneur and assistant professor at MIT's MediaLab, <a href=\"http://www.cualumni.com/s/1289/indexNoRtcol.aspx?sid=1289&amp;gid=1&amp;pgid=252&amp;cid=2273&amp;ecid=2273&amp;crid=0&amp;calpgid=61&amp;calcid=872\" target=\"_blank\">won as a write-in candidate</a> for alumni trustee to the Cooper Union board.</p>\n\n<p><a href=\"http://www.youtube.com/watch?v=TDaFwnOiKVE\" target=\"_blank\">Slavin</a>, who had been critical of the previous trustees' lack of transparency in decision-making, had been running on a platform of <a href=\"https://www.facebook.com/FreeCooperUnion/posts/460836403997183\" target=\"_blank\">renewed trust</a>. At a <a href=\"http://www.youtube.com/watch?v=9zvx_Lazu1E\" target=\"_blank\">Free Cooper Union Community Summit</a> presentation in December of 2011, Slavin brought a $10,000 check to the podium, and asked Cooper Union leadership to use it to find \"sustainable resources-- transparency, communication, trust, and integrity.\"</p>\n\n<p>\"If anything, the acquisition of money, these days, doesn't provide trust--it demands trust,\" Slavin said. </p>\n\n<p>At that time, Slavin also shared that he had a team of forensic accountants take a look at Cooper Union's 990s, who told him that \"they haven't seen anything this fucked up from anyone who wasn't being deliberately obstructive.\"</p>\n\n<p>The announcement arrived in the <a href=\"http://blogs.reuters.com/felix-salmon/2013/05/19/cooper-unions-shameless-trustees/\" target=\"_blank\">heat of criticism</a> directed at the Board of Trustees for--among other things--making large, questionable investments in hedge funds right up until the fiscal crash, and then directing the blame for money woes at lack of alumni giving. </p>\n<a name=\"more\"></a>\n<p>According to a post Slavin wrote on the <a href=\"https://www.facebook.com/groups/SaveCooperUnion\" target=\"_blank\">Save Cooper Union</a> Facebook page, the announcement wasn't supposed to come out for several days. \"Oh shit,\" he wrote, then continued:</p>\n\n<blockquote>I'm in the middle of an all-day something here at the Media Lab so can't respond in a meaningful way immediately.\n\n<p>But I will say this: you all have been responsible for me becoming a trustee. Now you will also share the responsibility for how effective I'll be. I need you, all of you, to see what we can do with a board that's *connected to the institution it's serving* </p>\n\n<p>And thank you, all of you, for trusting me with the responsibility of this. Now let's all figure out how to use it in the best ways possible. More to come, today and for the next bunch of years.<br></p></blockquote>\n\n<p>\"Democracy and transparency won today, and the future is looking bright,\" Sean Cusack, an adjunct professor in the school of engineering, told the <em>Village Voice</em> on Friday. \"We now have a voice in the board meetings, that will not be silent about what goes on, and will speak up for the community,\" Cusack said.</p>\n\n<p>Along with Slavin, 12 other candidates for alumni council supported by alumni organization <a href=\"http://friendsofcooperunion.org/vote-no-confidence/\" target=\"_blank\">Friends of Cooper Union</a> won positions. The <em>Voice</em> has reached out to Slavin for comment on what he intends to do as trustee, and will update when we hear back.<br><em><br>\nSend your story tips to <a href=\"mailto:sbrownstone@villagevoice.com\">sbrownstone@villagevoice.com</a>. Follow her on Twitter <a href=\"https://twitter.com/sydbrownstone\" target=\"_blank\">here</a>.</em><br></p>                                                <article-signup type=\"email\" size=\"large\"></article-signup>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                </div>",
    "date_published": "2013-05-20 09:00:36",
    "dek": null,
    "lead_image_url": "http://blogs.villagevoice.com/runninscared/slavin.jpg",
    "title": "Cooper Union Alumni Elect Write-In Trustee Kevin Slavin on Transparency Platform",
    "rendered_pages": 1
}