{
    "domain": "montreal.mediacoop.ca",
    "next_page_id": null,
    "url": "http://montreal.mediacoop.ca/story/cooper-union-and-fight-free-education/17571",
    "short_url": "http://rdd.me/b60b39xz",
    "author": "Stefan Christoff",
    "excerpt": "Students at Cooper Union school in New York City are currently occupying the office of the president&#x2019;s office, protesting a recent decision to end more than a century of free tuition for&hellip;",
    "direction": "ltr",
    "word_count": 2158,
    "total_pages": 0,
    "content": "<div><div class=\"post_content\">\n\n<p>Students at <a href=\"http://cooper.edu/\" rel=\"nofollow\">Cooper Union</a> school in New York City are <a href=\"http://www.democracynow.org/2013/5/15/headlines/cooper_union_students_continue_tuition_protest\" rel=\"nofollow\">currently occupying</a> the office of the president&#x2019;s office, protesting a recent decision to end more than a century of free tuition for undergraduates.</p>\n<p>Over the past year students from <a href=\"https://www.facebook.com/FreeCooperUnion\" rel=\"nofollow\">Free Cooper Union</a> have been campaigning to fight the introduction of tuition as part of wider organizing efforts in NYC against the increasing corporatization, commodification and inaccessibility of post-secondary education.</p>\n<p>Read an interview with student activist <strong>Victoria Sobel</strong>, currently participating in the occupation action at Cooper Union. This interview outlines the current action within the wider context of student struggles in New York City, in the U.S. and internationally.</p>\n<p>This interview was recorded by telephone at <a href=\"http://www.ckut.ca\" rel=\"nofollow\">CKUT community radio</a> in Montreal.</p>\n<p><em><strong>Can you introduce yourself ?</strong></em></p>\n<p>My name is Victoria Sobel, I am 22-years-old and currently living in New York City. I am a student at the Cooper Union School of Art and I, along with 50 other students, are currently occupying President Jamshed Bharucha&#x2019;s office in the foundation building of the Cooper Union.</p>\n<p><em><strong>Can you describe the scene where you are right now ?</strong></em></p>\n<p>Actually, right now I am sitting in an adjoining office that we took on the first night, there is a conference room, the president&#x2019;s office and then in an effort to expand the space we had, to allow for more students to participate in this action, we took the adjoining office which has secretaries and other administrative workers.</p>\n<p>In the presidents office right now there is a really productive conversation going on between students from all three schools at Cooper Union who are participating in the sit in, as well as faculty from the school of arts and that&#x2019;s been going on all morning. Its really a space to hold conversation outside of our prescriptive schools, weather its arts, architecture or engineering, all those roles sort of fall aside once you enter the space of the sit-in where people are just individuals and community members.</p>\n<p><em><strong>Can you give some context for people not familiar with Cooper Union about the struggle that you have been involve in as a student there ?</strong></em></p>\n<p>Absolutely. I am a student organizer at Cooper Union, which is in the Lower East Side of Manhattan, New York City and was founded in 1859 by the inventor and philanthropist Peter Cooper.</p>\n<p>Cooper believed in accessible education and during that period Cooper created a lot of inventions and patents, including H-shaped beams used a lot for buildings and railroads, so had financial resources. Cooper opened a school, that was to include art, architecture and engineering, and that was open to all who came, a school focused on servicing the community.</p>\n<p>So over the past 154 years Cooper Union has remained free for all admitted.</p>\n<p>In recent years, a new administration took over, and it was discovered that the board of trustees had been running the school into a significant deficit, that was unbeknownst to the school. At the time Cooper Union was going through a physical expansion, including a new building, so this was all taking place as the new administration was taking over.</p>\n<p>That was the first time in the history of Cooper that the idea of tuition being charged to students, as a means to fix the deficit, had ever been put on the table. So over the past two years, students, faculty, staff and administrators (some administrators) have been working to prevent the introduction of tuition at the school. This past month the chairman of the board announced that the incoming class of 2014 would be charged a tuition rate of 50%, even though the tuition measure wont close the deficit.</p>\n<p><em><strong>In response you and your fellow students have taken action, can you explain.</strong></em></p>\n<p>Yes. Actually we have had a long ongoing campaign under the name Students for a Free Cooper Union, a campaign comprised of a broad diversity of tactics. Our efforts have included trying to schedule meetings through existing student bodies, like our art student council, or the architecture and engineering council.</p>\n<p>In December, we had a hard lock-in at the Peter Cooper suit, which is the floor right above the administrative floor, and 11 of us stayed in that room for a week, to draw attention to the tuition issue. Also we staged many events, including a public symposium on free education and accessibility to education, we&#x2019;ve also done petitions.</p>\n<p>We have issued three demands, including one for a new government at the school, which would allow for board members and or administrative members to be added or removed by the community.</p>\n<p>The second one is for greater community input and student representation through a vote on the board of trustees.</p>\n<p>The third demand is for the current president to step down, which is the underline message of the current sit-in.</p>\n<p>There has been irreparable financial damage done to the school, so the current president is obviously not a responsible administrator and also doesn't reflect the progressive ideals of the school, and needs to step down immediately.</p>\n<p><em><strong>You mentioned the progressive ideals of Cooper Union, can you talk about the importance of your struggle around accessibility to education right now in NYC within the broader context of the lack of accessibility facing students in the US.</strong></em></p>\n<p>Sure, well first I will speak on New York City, cause there are a number of other student groups, or student/education advocacy groups currently very active.</p>\n<p>Cooper Union is a school based on full scholarship, meaning that students are accepted based entirely on merit, not on financial capacity. Many say this is a progressive approach, yes it is, but I think this should be pushed further, because the idea of merit is not so objective, and does come with some privileges.</p>\n<p>In reality, some people have the privilege to receive education from Kindergarten till 12th grade and some people don't, while some have more financial resources to study, finances not just relating to tuition, but to the general cost to education. I think that even with our current process around accessibility at Cooper Union we could do better.</p>\n<p>So in the context of other schools in the city, we have been working with New York University (NYU), Columbia University, City University of New York (CUNY) and a couple other schools as well, some high-schoolers, to begin to organize a student base for the city. Some sort of body that can speak to all these different issues relating to education.</p>\n<p>At our school people are highlighting financial mismanagement, at other schools like NYU there is a terrible expansionist agenda threatening the livelihood of many of the neighbourhoods around NYU, and we have seen a lot of actions on this. Students at NYU have even less say than we do at Cooper Union, because they are taught to be consumers, as they are paying so much for their education.</p>\n<p>At Columbia university the students are working very hard to forge relationships between students and the labour component to the school, because students see that Columbia doesn't value the staff and workers of the school. There the administration has been taking exploitative actions against the workers, cutting the salaries, the staff, the benefits of these workers.</p>\n<p>At CUNY's public college Medgar Evers in central Brooklyn, there has been a lot of racist administrative moves, where they closed down community access to spaces like the library and campus zones, things students there have been fighting.</p>\n<p>Unfortunately these stories, these struggles mostly just don't make it to the mainstream news, however the word is getting out there.</p>\n<p>I think that at Cooper Union and also the actions taking place at different schools, have really been challenging conceptions of the political possibilities of student action. So when we heard administrators here at Cooper tell us that we must leave this space, what they are really saying is, 'I want you to think that you have to leave this space', which is actually our space as students at the school.</p>\n<p>So we have been holding strong. There was a police presence on the first day we took this space and that was very quickly deescalated, now we have held the space for almost a week and we will continue to hold this space until the demands are met.</p>\n<p><em><strong>For you can you explain the importance of the demand for free education?</strong></em></p>\n<p>So we are hanging a giant red banner outside that also reads Free Education to All.</p>\n<p>For us, that was one of the greatest ideals of Peter Cooper the founder of this school, who obviously really hoped that this free education model would be something that is scalable, reproducible and replicable.</p>\n<p>Cooper was sending a message to others, illustrating the success of this model of education, illustrating that university didn't need to be corporate, or expansionist, or based on a business model. But that universities can self-sustaining, not based on the business model, and that approach can be sufficient, illustrating that we can afford to make quality education free.</p>\n<p>You shouldn't have to pay for the quality of your education, education shouldn't be restricted based on the financial capacity of students. At Cooper the education I have received has been excellent, because I haven't had to think about not being able to afford taking different courses at different times. I take as many courses as I can, and I am able to maximize and be efficient in that way. As compared to people who have these fixed degree programs more common at other universities, they become very boxed into what are generally very career oriented programs, feeding into workforce ideals.</p>\n<p>So students who end up having real interests in different studies, different topics, end up not really having time to explore at school, because they are essentially getting certifications to go into a workforce, into a job market in a nation that is very weak right now and not prepared to take them on.</p>\n<p>So there are a lot of really perverse trends going on within universities right now, that really marginalize the student and the student voice in the context of the US and New York.</p>\n<p>In New York and other cities across the country, we are now seeing a trend in the votes of no confidence for university presidents, they are becoming widespread. Illustrating that people really have no confidence in these administrative structures, and that really we can do better, in terms of imagining collaborative structures that depend on the community.</p>\n<p>For us its really about making it clear, that its well past time to rethink the prevailing university model and that given the progressive ideals of Cooper stand as an example this was a great place to stage and assert these possibilities.</p>\n<p>Rather than turning backward and taking that regressive step of charging tuition there are other possibility, we wanted to illustrate this. We have seen in so many examples that charging tuition isn't a model that works for accessibility. Once you start charging tuition you will never go back, you are only going to continue to charge more and more, you fall into a model seen in other institutions that depend on student fees.</p>\n<p><em><strong>Any reflections that you have concerning the action that you are holding at Cooper Union and what has been happening in Quebec.</strong></em></p>\n<p>Yes, we see many parallels in our struggle here and the student struggle in Quebec, although our situation is different.</p>\n<p>In New York, we have been working really hard toward the idea of a city wide student union body, and we have learned very much from the models being worked on in Quebec, the assembly model.</p>\n<p>Something we are actively thinking about is how possible the idea of a strike is, and what type of barrier in American society stand between students and strikes. Why is it that unlimited strikes seem to many people, to many students as being something not even feasible?</p>\n<p>How can develop toward the strike, as being a workable strategy for political action, a tactic that can work. Cause real strikes are very removed from the American context, where strikes are more symbolic.</p>\n<p>What has happened in Quebec, a months long student strike, is something that many American students find hard to imagine today, but is something that we aspire toward. Seeing the success of the strike in Quebec, and also how it built on such a long history of student organizing in Quebec, inspires students in New York.</p>\n<p>In New York we are trying to build on these things, we feel a real sense of being in constellation with the activism that students have been doing in Quebec, that students are doing in Chile and all over the world.</p>\n<p>So our action at Cooper Union isn't just about us, it's happening in parallel to the work that so many other groups in the city are doing. Also we recognize what is at stake for us at Cooper is about student everywhere.</p>\n\n</div>\n\n\n\t\n\t\n\n\n</div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": null,
    "title": "Cooper Union and the fight to free education",
    "rendered_pages": 1
}