{
    "domain": "gothamist.com",
    "next_page_id": null,
    "url": "http://gothamist.com/2012/12/11/cooper_union_protestors_have_ended.php",
    "short_url": "http://rdd.me/kulnfqo1",
    "author": "Rebecca Fishbein",
    "excerpt": "Courtesy Minister Erik McGregor's flickr Yesterday, the eleven Cooper Union students protesting the school's decision to start charging tuition for graduate students ended their weeklong occupation&hellip;",
    "direction": "ltr",
    "word_count": 294,
    "total_pages": 0,
    "content": "<div><div class=\"entry-body\"><p><span class=\"mt-enclosure mt-enclosure-image\"> <div class=\"image-none\"> <img alt=\"121112_cooperunion.jpeg\" src=\"http://gothamist.com/attachments/nyc_rebeccaf/121112_cooperunion.jpeg\" width=\"640\"><br><i> Courtesy<a href=\"http://www.flickr.com/photos/erikcito/\"> Minister Erik McGregor's flickr</a></i></div> </span></p>\n\n<p>Yesterday, the eleven Cooper Union students <a href=\"http://gothamist.com/2012/12/03/11_students_protesting_tuition_barr.php\">protesting the school's decision</a> to start <a href=\"http://gothamist.com/2012/04/24/cooper_union_to_make_graduate_stude.php\">charging tuition for graduate students</a> ended their <a href=\"http://cityroom.blogs.nytimes.com/2012/12/10/cooper-union-students-end-occupation-of-suite-after-a-week/?partner=rss&amp;emc=rss\">weeklong occupation</a> of the Peter Cooper Suite on the eighth floor of the institution's Foundation Building. </p>\n\n<p>Though <a href=\"http://gothamist.com/2012/12/04/cooper_union_protesters_remain_ther.php\">their demands</a>&#x2014;that Cooper Union's president resign, and that the school make a public promise that tuition would remain free&#x2014;were not met, they were satisfied that the occupation had done enough to highlight issues like massive student debt and the exorbitant cost of higher education. They left the building escorted by supportive faculty members and their dean before delivering speeches outside (you can watch the whole press conference <a href=\"http://www.ustream.tv/recorded/27631865\">here</a>).</p>\n\n<p>\"That was something we planned together with them as a show of unity,\" Victoria Sobel, one of the student protesters, told us. \"We wanted it to be really a celebration of cohesion and unity that came across during the week.\" And while this occupation is over, the students say they were never contacted our acknowledged by Cooper Union President Jamshed Barucha or the board and will continue to protest any attempt the school's administration made to end Cooper Union's tradition of free tuition. \"I don't want to give too much away but we've got a lot planned before this semester ends,\" Sobel said. \"We're figuring out who our strongest allies were in terms of local and international community, we're taking legal steps, we're taking symbolic steps. We're hitting it from every angle.\" </p>\n\n<p>The students also plan on <a href=\"http://www.dnainfo.com/new-york/20121210/east-village/cooper-union-students-end-live-in-protest-after-weeklong-occupation\">attending a traditionally private board meeting</a> in January, and more board meetings in the future as well. They say they no longer recognize Barucha as their president. \"We're not fighting for our own tuition,\" Sobel said. \"We're fighting for future generations and for the model for sustainable higher education.\" </p></div>\n\n\n</div>",
    "date_published": "2012-12-11 18:07:00",
    "dek": null,
    "lead_image_url": "http://gothamist.com/assets_c/2012/12/121112_cooperunion-thumb-105x105-761392.jpeg",
    "title": "Cooper Union Protestors End Occupation Of School Building",
    "rendered_pages": 1
}