{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2012/12/cooper_union_free_tuition.php",
    "short_url": "http://rdd.me/fsrqv09q",
    "author": "Jason Lewis",
    "excerpt": "Jason Lewis/Village VoiceStudents, observers and activists crowded The Great Hall at Cooper Union for last night's summit.The Cooper Union students who commandeered the clock-tower at the school's&hellip;",
    "direction": "ltr",
    "word_count": 763,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"><table class=\"image right\" border=\"0\" width=\"200\"><tr><td><img alt=\"cunight_debt-summit.jpg\" src=\"http://blogs.villagevoice.com/runninscared/cunight_debt-summit.jpg\" width=\"200\"></td></tr><tr><td class=\"credit\">Jason Lewis/Village Voice</td></tr><tr><td class=\"caption\">Students, observers and activists crowded The Great Hall at Cooper Union for last night's summit.</td></tr></table></span>The Cooper Union students who commandeered the clock-tower at the school's Foundation building and coordinated yesterday's day of action in Cooper Square, did so to <a href=\"http://blogs.villagevoice.com/runninscared/2011/11/cooper_union_co.php\">preserve free tuition for CU students</a>, but also to protest rapidly rising college tuition costs  at institutions everywhere.</p>\n\n<p>\"We're also here in solidarity for the state of education and the country as a whole,\" Jake Lee, a fifth-year architecture major at Cooper Union, tells the <em> Voice</em>.  \"<a href=\"http://blogs.villagevoice.com/runninscared/2011/11/george_campbell.php\">Universal access to free education</a> is the vital cornerstone of a functional democracy...Our country is very far from that.\"</p>\n\n<p>CU students demonstrated their solidarity with students around the world last night by capping off yesterday's protests with a three-hour long summit on the country's student debt crises. Hundreds of people converged on the school's Great Hall to watch students, activists, artists and professors illuminate the burden of rapidly rising tuition costs and ballooning student debt.</p>\n\n<p>\"We have gone from, to the extent that we ever were, a welfare state to a debt-fare state...We're having to pay for very basic needs -- that should be available to all of us -- with debt,\" Amin Husain, a lawyer and social activist with ties to Occupy Wall Street, said. \"This idea of debt is a way to maintain the status quo of chaining us into an economic system that further transfers wealth.\"</p>\n<a name=\"more\"></a>\n<p>Speakers provided historical context, artistic interpretations and calls to action regarding the student debt crises. Ever the arts school, former Cooper Union professor Yates McKee spoke about the prime opportunity CU students have to use their artistry as a means of activism. </p>\n\n<p>\"Not only are we seeing struggles emerging all around the world...but also really specifically at Cooper. Right now, to be a contemporary artist-in-training in New York City and at Cooper Union, is the chance of a lifetime,\" he said. \"We're in the crucible of a new kind of avant-garde moment, where artistic and political practices are coming together in a new way.\" </p>\n\n<p>Though the students are clearly concerned about the rise of debt across the board, they're still intimately dedicated to persevering free tuition at CU. And, they're aiming their ire directly at the school's board of trustees and its president, Jamshed Bharucha, <a href=\"http://blogs.villagevoice.com/runninscared/2011/11/cooper_union_fi.php\">whom students and some critics believe are responsible for the school's roughly $16.5 million budget deficit</a>. </p>\n\n<p>Henry Chapman, a recent graduate and member of the organization, Friends of Cooper Union, spoke at last night's rally and read the group's list of demands for the current administration. Some of those demands include a freeze on hiring, the elimination of pricey consultants, the suspension of non-essential programs, the initiation of short-term and long-term capital fundraising campaigns and a full commitment to a free tuition.</p>\n\n<p>There are those who say that the alumni of the school, many of whom, by virtue of working in the difficult field of art, may not possess the financial stability necessary to provide sizable donations to the school's endowment. Chapman guaranteed that alumni will step up and give once it's clear that the administration is committed to preserving free tuition. </p>\n\n<p>\"When we complain about our free tuition, we're complaining about the mismanagement of our funds,\" Lee says. \"It's clear that the top is disconnected from what the school is founded on and what the community desires and needs.\"</p>\n\n<p>Aside from the pressing issue of free-tuition, Lee also railed against the prospect of the administration selling off a student housing building and eliminating a number of arts electives -- (at a school <em>dedicated to art</em> nonetheless) -- all the while keeping the president's mansion, which has served as the president's home for only about a decade. </p>\n\n<p>Members of Students for a Free Cooper Union, who are currently still barricaded in the clock-tower, dialed in at the end of the summit via Skype, to resounding applause, in order to update the audience on their demands and their well-being.</p>\n\n<p>Despite their own <a href=\"https://twitter.com/FreeCooperUnion\" target=\"_blank\">reports</a> earlier this morning that they could be arrested and charged with \"obstruction of justice, vandalism and vagrancy,\" the students continued to occupy the building and are still calling for Bharucha's resignation. Another group of protestors is currently surrounding Bharucha in the school's academic building, according to the SFCU <a href=\"https://twitter.com/FreeCooperUnion\" target=\"_blank\">Twitter page</a>.</p>\n\n<p>Along with Bharucha's resignation, the protestors are also calling for a more transparent administration, a more democratic decision-making process and a public statement of <a href=\"http://blogs.villagevoice.com/runninscared/2012/04/cooper_union_gr.php\" target=\"_blank\">commitment to free tuition. </a>SFCU will hold a news conference with more details on their campaign in front of the Foundation building at 2:30 p.m. this afternoon.</p>                                                <article-signup type=\"email\" size=\"large\"></article-signup>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t</div>",
    "date_published": "2012-12-04 02:13:02",
    "dek": null,
    "lead_image_url": "http://blogs.villagevoice.com/runninscared/cunight_debt-summit.jpg",
    "title": "Cooper Union Students Rally Against College Debt Everywhere in Fight to Keep Own Tuition Free",
    "rendered_pages": 1
}