{
    "domain": "nyulocal.com",
    "next_page_id": null,
    "url": "http://nyulocal.com/city/2012/12/04/cooper-union-students-stage-lock-in-to-protest-a-tuition-increase/",
    "short_url": "http://rdd.me/5pzm8ti2",
    "author": "Sydney Smith",
    "excerpt": "Yesterday around noon, twelve students &#x2013; eleven Cooper Union students and one student journalist from The New School &#x2013; barricaded themselves inside Cooper Union&#x2019;s Foundation&hellip;",
    "direction": "ltr",
    "word_count": 1485,
    "total_pages": 0,
    "content": "<div><div class=\"entry\">\n\t\t\t\t<p><a href=\"http://nyulocal.com/city/2012/12/04/cooper-union-students-stage-lock-in-to-protest-a-tuition-increase/attachment/cooper1/\" rel=\"attachment wp-att-83649\"><img class=\"alignleft  wp-image-83649\" title=\"Cooper1\" src=\"http://nyulocal.com/wp-content/uploads/2012/12/Cooper1.png\" alt=\"\" width=\"220\"></a>Yesterday around noon, twelve students &#x2013; eleven Cooper Union students and one student journalist from The New School &#x2013; barricaded themselves inside Cooper Union&#x2019;s Foundation Building. They unfurled a&#xA0;red banner from the eighth floor which read &#x201C;Free Education To All.&#x201D;</p>\n<p>Their actions were a response to the decision&#xA0;by Cooper Union trustees and President Jamshed Bharucha&#xA0;to consider charging tuition in light of a waning endowment and rising costs. Cooper Union students currently do not pay anything for their years of schooling.</p>\n<p>No matter the outcome of an upcoming vote by the trustees, all current students are grandfathered into the full-scholarship system, and won&#x2019;t be retroactively charged tuition or be asked to pay for the rest of their time at Cooper.</p>\n<p>The demands of the protesting students, detailed in a communique sent to press and distributed to the public near Peter Cooper Park, called for an end to the consideration of tuition implementation at Cooper Union, as well as increased transparency in the school&#x2019;s administration, and the resignation of President Bharucha.</p>\n<p>NYU Local spoke to School of Art junior Joe Riley,&#xA0;one of the students occupying the barricaded room. Riley indicated that the students had enough food and supplies for four days, and that amount could easily be stretched to accommodate a longer stay. They have access to a bathroom and are keeping themselves busy throughout the day with regular barricade inspections and with fielding phone calls from press.</p>\n<p>One photo posted to the group&#x2019;s Twitter account showed students seated around a table, each with a laptop. The group is maintaining correspondence with press and were eager to speak with NYU Local and other members of the media.</p>\n<p>According to Riley, there was no particular reason that Monday was chosen as the start date for the lock-in, but the group had been planning the action for about five weeks. The lock-in was not specifically planned in conjunction with Free University activities going on outside, but the two events did share some organizers in common, as well as support from social change organizations like Strike Debt. Asked if he was concerned to be missing final exams, Riley said he had no problems with faculty members and was thankful for the support of many professors. He considered the lock-in to take priority, he said.</p>\n<p>Groups including Students for a Free Cooper Union and Free University distributed literature and buttons outside. Several students wore patches printed with slogans like &#x201C;Free Cooper&#x201D; and &#x201C;Cooper Union SOS.&#x201D; Several activities were going on outside the occupied space, including live performances, a game of &#x2018;capture the flag,&#x2019; and a mock-funeral for Peter Cooper, who founded Cooper Union in 1859 on the belief that education should be &#x201C;as free as air and water.&#x201D;</p>\n<p>According to Students for a Free Cooper Union member Jake Lee, a fifth year architecture student, &#x201C;[Peter Cooper] been dead for a really long time, but lately it feels like he&#x2019;s been getting deader and deader.&#x201D;&#xA0;Lee told NYU Local that the date of the trustees&#x2019; decisive vote on tuition policy&#xA0;has been pushed back from Wednesday, December 5, to January.</p>\n<p>&#x201C;This all started around noon. There was food then, and there&#x2019;s still food now, so I&#x2019;m shocked,&#x201D; School of Art junior Katherine Marshall said. Marshall praised the lock-in action for it&#x2019;s organization, which she felt made it more successful than other recent occupations at the school, but she criticized the action too.</p>\n<p>&#x201C;The tactic is a little flawed in that a lot of the accusations are directed at the president [Bharucha]. They&#x2019;re kind of using him as a scape goat even though he isn&#x2019;t the cause of all the problems. He&#x2019;s just trying to deal with them,&#x201D; Marshall said. &#x201C;He did propose tuition as the solution, which is why people are attacking him.&#x201D;</p>\n<p>Cooper student Olivia DeSalve was not aware of the lock-in on the eighth floor, but was glad to hear that barricades were not going to damage the building. DeSalve&#x2019;s message to the occupiers: &#x201C;Keep our school sacred and don&#x2019;t damage it, but make a statement.&#x201D;</p>\n<p>The Summit on Debt and Education, an open and free series of lecture and performances, was held later that evening in Cooper Union&#x2019;s Great Hall, in the basement level of the building being occupied. Cooper faculty member Peter Buckley spoke, as well as members of Strike Debt and the Occupy Student Debt Campaign. Performances and video projections followed.<a href=\"http://nyulocal.com/city/2012/12/04/cooper-union-students-stage-lock-in-to-protest-a-tuition-increase/attachment/coop3/\" rel=\"attachment wp-att-83650\"><img class=\"alignright  wp-image-83650\" title=\"Coop3\" src=\"http://nyulocal.com/wp-content/uploads/2012/12/Coop3.jpg\" alt=\"\" width=\"270\"></a></p>\n<p>Henry Chapman, an alumnus of the Class of 2010, represented a group calling themselves &#x201C;Friends of Cooper Union.&#x201D; His organization believes that &#x201C;expense reduction should be [Cooper Union's] first priority,&#x201D; and proposed replacing current deans with rotating faculty and getting rid of consultants who are not &#x201C;cash flow positive&#x201D; as two possible measures to accomplish that. Lashing out against Cooper&#x2019;s leaders, Chapman said current leaders do not value free education and cannot defend it, saying that they instead &#x201C;impose consensus rather than build it, and divide the schools rather than unite them.&#x201D;</p>\n<p>Asked how other students and interested parties outside of Cooper Union could get involved, Chapman said:</p>\n<blockquote><p>&#x201C;I think that there are two conversations going on. One is very specific to Cooper Union, and if they&#x2019;re interested in participating in that, definitely the Friends of Cooper Union website is a vast resource of texts we&#x2019;ve compiled in the past year that tell the story of what&#x2019;s happening at Cooper and what our recommendations are. Then there&#x2019;s the second conversation, which a lot of the speakers are referencing, which is the wider conversation &#x2013; the wider connection between we&#x2019;re advocating here and what&#x2019;s being advocated at other schools. So potentially there are connection that are still forming and need to develop their own presences online and also on campus.&#x201D;</p></blockquote>\n<p>Chapman says he was &#x201C;wildly oblivious&#x201D; of the lock-in staged by&#xA0;Take Back NYU a few years prior.</p>\n<p>&#x201C;This is a conversation that the entire school has been having for the past year,&#x201D; added Max Gideonse, a second year architecture student.</p>\n<p>&#x201C;This is the result of one of the most concentrated, active, and passionate efforts, but among a small and dedicated group of students. Theirs views represent a large majority of the school&#x2019;s, but this is a debate which has definitely not reached a consensus among the students,&#x201D; Gideonse said. &#x201C;It&#x2019;s a small school but there are a lot of different thoughts.&#x201D;</p>\n<p><a href=\"http://nyulocal.com/city/2012/12/04/cooper-union-students-stage-lock-in-to-protest-a-tuition-increase/attachment/cooper2/\" rel=\"attachment wp-att-83651\"><img class=\"alignleft  wp-image-83651\" title=\"Cooper2\" src=\"http://nyulocal.com/wp-content/uploads/2012/12/Cooper2.png\" alt=\"\" width=\"282\"></a>Students were adamant that their actions did not constitute any statement against faculty or their education. &#x201C;This isn&#x2019;t a walk out at all, in mentality,&#x201D; said Gideonse. &#x201C;Between students and faculty there&#x2019;s been a lot of agreement. There have been actions in the past called Walk Out Work Outs where classes have been held outside, using the walls of the building and putting up chalkboards outside. I don&#x2019;t know how many times in class we&#x2019;ve had discussions about this. It&#x2019;s not the sort of thing like out here is the only place where we can express this.&#x201D;</p>\n<p>NYU Local asked a Cooper Union School of Art freshman who is not involved with yesterday&#x2019;s actions or Free Cooper Union if he would have applied knowing that he would be charged tuition. &#x201C;Hell no,&#x201D; he said. &#x201C;I couldn&#x2019;t afford it, I couldn&#x2019;t afford anywhere. How are you supposed to pay for an art degree? That&#x2019;s stupid.&#x201D; If Cooper couldn&#x2019;t continue to provide free tuition, the student said, they should shut down the school instead.</p>\n<p><del>We reached out for comment to Cooper Union but have not&#xA0;received&#xA0;a response.</del></p>\n<p>UPDATE: In an email to NYU Local, Cooper Union Assistant Director of&#xA0;Public Affairs Jolene Travis addressed yesterday&#x2019;s events.</p>\n<blockquote><p>Our priority is for the safety of our students, and to assure that the actions of a few do not disrupt classes for all. The eleven art students who have locked themselves in the Peter Cooper Suite do not reflect the views of a student population of approximately 1,000 architects, artists and engineers. President Jamshed Bharucha has held informal meetings with various groups of students on campus throughout the morning. Vice President of Finance T.C. Westcott is in contact with the students&#x2019; designated spokesperson, and we understand that they have access to food, water and sanitary facilities.</p>\n<p>It should be clear that:</p>\n<ul><li>The effort to develop and implement a financially sustainable plan is critical to the institution&#x2019;s survival.</li>\n</ul><ul><li>We remain fully engaged in an open process to achieve a sustainable future while maintaining the highest standards of access and academic excellence.</li>\n</ul><ul><li>We are committed to transparency. President Jamshed Bharucha and Vice President T.C. Westcott have held more than 80 informational meetings and sessions with the Cooper Union community- students, faculty, alumni and staff. The institution&#x2019;s website,&#xA0;<a href=\"http://www.cooper.edu/\" target=\"_blank\">www.cooper.edu</a>, provides detailed information on the planning process, its deadlines and its progress.</li>\n</ul><ul><li>The Deans and the faculty of the degree granting schools will be presenting their proposed plans for their individual schools. The proposals will be reviewed by the Board of Trustees with a decision slated for early 2013.</li>\n</ul><ul><li>&#xA0;Full tuition scholarships at The Cooper Union are currently valued at $38,550.</li>\n</ul>\n</blockquote>\n\t\t\t\t\n\t\t\t</div>\n\t\t\t\n\t\t\t\n\n\t\t\t\n\t\t\t\n\t\t</div>",
    "date_published": "2012-12-04 00:00:00",
    "dek": null,
    "lead_image_url": "http://nyulocal.com/wp-content/uploads/2012/12/Coop3.jpg",
    "title": "[UPDATED] Cooper Union Students Stage Lock-In To Protest Tuition Implementation",
    "rendered_pages": 1
}