{
    "domain": "www.forbes.com",
    "next_page_id": null,
    "url": "http://www.forbes.com/sites/susanadams/2013/06/12/the-colleges-where-tuition-is-still-free/",
    "short_url": "http://rdd.me/4fvvtubo",
    "author": "Susan Adams",
    "excerpt": "Free no more, This spring, Cooper Union decided to start charging students for half of its $38,000 tuition. Students at the Cooper Union for the Advancement of Sciences in New York City are still&hellip;",
    "direction": "ltr",
    "word_count": 375,
    "total_pages": 0,
    "content": "<div><div class=\"body contains_vestpocket\">\n\n\n\n\t<div class=\"zemanta-img\"> \n <figure class=\"wp-caption alignright\">\n  <a href=\"http://commons.wikipedia.org/wiki/File:Cooper_Union_Foundation_Building_front.jpg\"><img class=\"zemanta-img-configured zemanta-img-inserted\" src=\"http://b-i.forbesimg.com/susanadams/files/2013/06/300px-Cooper_Union_Foundation_Building_front2.jpg\" alt=\"The front of the Cooper Union Foundation Build...\" width=\"300\"></a>\n  <figcaption class=\"wp-caption-text\">Free no more, This spring, Cooper Union decided to start charging students for half of its $38,000 tuition.</figcaption>\n </figure> \n</div> \n<p>Students at the <a href=\"http://www.forbes.com/colleges/cooper-union-for-the-advancement-of-science-and-art/\">Cooper Union</a> for the Advancement of Sciences in New York City are still protesting the school&#x2019;s decision to start charging up to 50% of its annual $38,000 tuition fee. Since it was founded in 1859, it had covered total tuition for all of its approximately 1,000 students. But in April, administrators announced that financial demands made it impossible to continue the policy. Students subsequently staged an occupation of President Jamshed Bharucha&#x2019;s office. They vow to stay there over the summer and into next year, unless the school reverses its decision. At this year&#x2019;s commencement in May, when President Bharucha got up to speak, many graduates turned their backs. The school did announce that it will continue need-blind admissions, and students who can&#x2019;t afford it will still be able to attend tuition-free. But the era of guaranteed free tuition at Cooper Union has come to an end.</p> \n<p>Cooper Union is not the only school that gave students a free tuition ride. Eight colleges, from the expensive, elite Curtis Institute of Music to the relatively inexpensive Alice Lloyd College in Pippa Passes, Ky., still do not charge any tuition at all, though some schools have a work requirement. They all have fewer than 2,000 students, and some are tiny, like Deep Springs College in Big Pine, Calif., a two-year college with only 26 students. Deep Springs also covers room and board, a scholarship valued at some $40,000 a year.</p> \n<p>There are also the five U.S. military academies&#x2014;the U.S. Military Academy (West Point), the U.S. Coast Guard Academy, the U.S. Naval Academy, the U.S. Air Force Academy and the U.S. Merchant Marine Academy&#x2014;where tuition, room and board are all free. But graduates pay a price through their service obligation, which starts at a minimum of five years. Still, the military academies are arguably a great deal. A West Point spokesman says its four-year degree is equal to an &#x201C;equivalent scholarship value&#x201D; of $205,000. West Point&#x2019;s service requirement includes five years of active duty and three years in the reserves.</p> \n<p>Outside the military academies, here are eight schools where tuition remains free:</p> \n<div class=\"forbes_embedded_gallery\">\n <p><a class=\"gallery_embedded_launcher\" href=\"http://www.forbes.com/pictures/mkl45lhhj/the-colleges-where-tuition-is-still-free/\">The Colleges Where Tuition Is Still Free</a></p>\n</div>\n\n\n\n\n\n        </div>\n        \n\n        \n\n        \n\n        \n\n\n    \n\n\n\t</div>",
    "date_published": "2013-06-12 00:00:00",
    "dek": null,
    "lead_image_url": "http://b-i.forbesimg.com/susanadams/files/2013/06/300px-Cooper_Union_Foundation_Building_front2.jpg",
    "title": "The Colleges Where Tuition Is Still Free",
    "rendered_pages": 1
}