{
    "domain": "www.vice.com",
    "next_page_id": null,
    "url": "http://www.vice.com/read/occupying-cooper-union-to-keep-it-free",
    "short_url": "http://rdd.me/w2gejewa",
    "author": "Peter Rugh",
    "excerpt": "The windows of Cooper Union's historic Foundation Building in Manhattan's East Village are awash with calls to &#x201C;keep it free&#x201D; in large lettering, espousing the virtues of gratis&hellip;",
    "direction": "ltr",
    "word_count": 1022,
    "total_pages": 0,
    "content": "<div><div class=\"article_content\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p>\n\t<img alt=\"\" src=\"http://assets.vice.com/content-images/contentimage/no-slug/2f0816f6f46c7dce8f78fe11400dbfd3.jpg\"></p>\n<p>\n\tThe windows of Cooper Union's historic Foundation Building in Manhattan's East Village are awash with calls to &#x201C;keep it free&#x201D; in large lettering, espousing the virtues of gratis learning. Inside, about 50 students and university faculty are occupying the office of the school's president. They've been at it since yesterday morning, when a scrum of teachers and students dissatisfied with a decision by the school's Board of Trustees to begin charging tuition, marched into President Jamshed Bharucha's office and placed a letter on his desk that demanded his resignation and&#xA0;signed by more than half the student body.</p>\n<p>\n\t&#x201C;We no longer recognize your presidency at Cooper as legitimate,&#x201D; it read, &#x201C;and in so doing we commit to reclaim this office in the interim until a suitable administrative alternative is secured.&#x201D;</p>\n<p>\n\tSecurity personnel later arrived removing files, but not occupiers, who have pledged to nonviolently resist attempts of eviction. They've declared Bharucha's office &#x201C;a tuition-free zone,&#x201D; instigating a standoff between themselves and the academic institution seeking a new economic model.</p>\n<p>\n\t&#x201C;The administration wants us to leave,&#x201D; said Pablo Chea a sophomore engineering student taking part in the occupation, &#x201C;but they don't want to involve the cops. They don't want any bad press.&#x201D;</p>\n<p>\n\tCooper Union is a private liberal arts school founded by an endowment from Peter Cooper in 1859. Cooper, a wealthy industrialist and an inventor, believed &#x201C;education should be free as air and water,&#x201D; regardless of a person's race, ethnicity, gender, or economic background.</p>\n<p>\n\tGail Buckland, who has taught photography at the school since the 70s and took part in the occupation of the president's office Wednesday, said the lack of tuition at Cooper Union has created a unique learning environment. &#x201C;Everyone in my classroom has a sense of equality,&#x201D; she said.&#xA0;&#x201C;Nobody has prolonged adolescence because their parents are supporting them. They're responsible to themselves, not to banks, not to their parents.&#x201D;</p>\n<p>\n\tIn a country where the cost of higher education at both private and public institutions has&#xA0;<a href=\"http://advocacy.collegeboard.org/sites/default/files/college-pricing-2012-full-report_0.pdf\" target=\"_blank\">risen year after year</a>&#x2014;driving America's&#xA0;<a href=\"http://www.finaid.org/loans/studentloandebtclock.phtml\" target=\"_blank\">student debt over the trillion-dollar threshold</a>&#x2014;Cooper Union has never asked for a buck from its students.</p>\n<p>\n\t&#x201C;Everybody has a debt to somebody,&#x201D; said Buckland, &#x201C;But I'd rather my students have a debt to society than to bankers.&#x201D;</p>\n<p>\n\t<img alt=\"\" src=\"http://assets.vice.com/content-images/contentimage/no-slug/7b1209a06f46535cbdfba1c01ce08740.jpg\"></p>\n<p>\n\tCooper Union's meritocracy has stood for 154 years but that's starting to change. Last year, Bharucha and the Board of Trustees voted to begin charging the small percentage of graduate students attending the school and on April 23 elected to do the same to undergraduates beginning in 2014.</p>\n<p>\n\tThe administration declined to comment for this story and, as of the time this article was posted, had not released a statement on the flock of students who spent the night curled up in the office of the school's president beside empty boxes of pizza. In the past, however, Bharucha and other school officials have defended the decision to charge for enrollment, arguing their hands have been forced by the dire economic straits the university finds itself in. &#x201C;There will be some tough decisions,&#x201D;&#xA0;<a href=\"http://www.nytimes.com/2013/02/16/nyregion/cooper-unions-tradition-of-free-tuition-may-be-near-end.html\" target=\"_blank\">Bharucha told the <em>New York Times</em>&#xA0;in February</a>. &#x201C;There have to be. Because the model that has been in place cannot be sustained.&#x201D;</p>\n<p>\n\tAt the time, Bharucha said no decision had been made, but a statement proclaiming that the &#x201C;college admits undergraduates solely on merit and awards full scholarships to all enrolled students&#x201D; had already been removed from the school's website.</p>\n<p>\n\tPointing to the&#xA0;<a href=\"http://www.nytimes.com/2009/06/05/arts/design/05coop.html\" target=\"_blank\">new monochrome structure</a>&#xA0;adjacent to the Foundation Building that serves as home to Cooper Union's School for the Advancement of Science and Art&#x2014;Victoria Sobel said she isn't buying Bharucha's story. Sobel, an art major who graduates this year, is a member of&#xA0;<a href=\"http://cusos.org/\" target=\"_blank\">Cooper Union $O$</a>, which planned and orchestrated the occupation. The window propaganda decorating the Foundation Building was her senior project, although the administration made her take down slogans mentioning Bharucha specifically by name. She accuses the president of continuing a trend established by his predecessors, that of &#x201C;selling Cooper Union down the river.&#x201D;</p>\n<p>\n\tIn February, Bharucha told the<em> Times</em>&#xA0;that the school is loosing about $12 million per year. The institution owns the Chrysler Building and other pieces of high-value New York real estate, but the cost of upkeep isn't keeping up with revenue. Yet, Cooper Union is currently spending $10.3 million a year paying back a $177 million loan it took out to invest in the stock market shortly before the economy tanked in 2008. And it spent an additional <a href=\"http://www.nytimes.com/2013/02/16/nyregion/cooper-unions-tradition-of-free-tuition-may-be-near-end.html?pagewanted=all\" target=\"_blank\">$173 million</a> erecting the Science and Art building, enlisting the talents of famed architect Thom Mayne. Completed in 2009, the building's sleek, modernist design stands in stark contrast to the red brick structure, first erected when Peter Cooper established the school shortly before the Civil War.</p>\n<p>\n\t&#x201C;They're trying to make the school more hip looking,&#x201D; said Sobel, &#x201C;and a lot of that has to do with profitability. Not charging tuition just isn't profitable.&#x201D; She's confident Cooper Union can remain free and accuses the school of exaggerating&#xA0;the cost it incurs per student, a figure it puts at $38,550. She also said its administrative costs are too high, including the reported&#xA0;<a href=\"http://nplusonemag.com/save-cooper-union\" target=\"_blank\">half a million plus housing that Bharucha receives a year</a>.&#xA0;Most of all she wants the Cooper Union community to have more of a role in how budgetary decisions are made. &#x201C;From public forums to private meetings, there have been so many interventions from student, faculty, and alumni, and we've been met with complete resistance.\"</p>\n<p>\n\tOn Wednesday evening students from across the city, including some from the public City College of New York, where&#xA0;<a href=\"http://www.nytimes.com/2011/11/29/nyregion/cuny-board-approves-tuition-increases.html\" target=\"_blank\">incremental tuition hikes</a>&#xA0;are being implemented, gathered in front of the Foundation Building to support those hunkered down seven stories above. Chants of &#x201C;Education is a right! Fight, fight, fight&#x201D; filled Cooper Union Square. School security stood by the building's entrance making sure no one without proper ID stepped inside. In the park nearby, holding a staff and perched on a thrown,&#xA0;sat&#xA0;a bronze statue of Peter Cooper. Cooper faced southward, his back to the scene, as if someone had wheeled him around so he couldn't see the profiteering happening at the school he built to be as free as \"air and water.\"&#xA0;</p>\n<p>\n\t<em>More on Cooper Union:&#xA0;</em></p>\n<p>\n\t<em><a href=\"http://www.vice.com/read/should-college-be-free-nyc-protestors-think-so\">The Fight to Save America's Best Free College</a></em></p>\n\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t</div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://assets.vice.com/content-images/contentimage/no-slug/2f0816f6f46c7dce8f78fe11400dbfd3.jpg",
    "title": "Occupying Cooper Union to Keep It Free",
    "rendered_pages": 1
}