{
    "domain": "www.takepart.com",
    "next_page_id": null,
    "url": "http://www.takepart.com/article/2013/05/12/cooper-union-charge-tuition-students-protest",
    "short_url": "http://rdd.me/3ydp48rs",
    "author": "Vanessa Romo",
    "excerpt": "In a fit of anger, Cooper Union students took over the college president&#x2019;s office last week to protest plans to start charging tuition. Soon after, many others joined their cause. On Friday,&hellip;",
    "direction": "ltr",
    "word_count": 544,
    "total_pages": 0,
    "content": "<div><div class=\"field-item even\"><p>In a fit of anger, Cooper Union students took over the college president&#x2019;s office last week to protest plans to <a href=\"http://www.takepart.com/article/2012/12/07/cooper-union-protesters-free-education-must-not-got-extinct\" target=\"_self\">start charging tuition</a>.</p>\n<p>Soon after, many others joined their cause.</p>\n<p>On Friday, Cooper Union students were joined by current faculty members and cohorts from several New York City universities. Students from Columbia and NYU took to the podium, denouncing the administration for squandering the school&#x2019;s endowment and making one botched investment after another.</p>\n<p>Speakers also called for the resignation of President Jamshed Bharucha, who took over the post in 2011 and inherited the nearly $17 million deficit from his predecessor.</p>\n\n<p>The group Free Cooper Union is circulating a petition to fire Bharucha. A recent post on the Twitter account <a href=\"https://twitter.com/FreeCooperUnion\" target=\"_blank\">@freecooperunion</a> claimed to have more than half of the university&#x2019;s 1,000 student body signed on.</p>\n<p>The decision to end free tuition was first announced in April. The Cooper Union Board of Trustees said the decision was made after \"18 months of intense analysis and vigorous debate.\"</p>\n<p>From a <a href=\"http://cooper.edu/about/trustees/board-trustees-statement-future-plans-cooper-union\" rel=\"nofollow\" target=\"_blank\">press release</a> issued by the Board: \"Being mostly alumni ourselves, we share your sense of the loss of this extraordinary tradition,\" the trustees said. \"In the final analysis, however, we found no viable solutions that would enable us to maintain the excellence of our programs without an alteration of our scholarship policy.\"</p>\n<p>Starting in the fall of 2014, new students will have to pay $20,000 a year. Current students will not be affected.</p>\n<p>By turns, speakers at the rally reminded one another of Cooper Union's mission: The art, architecture, and engineering college was founded with the implicit directive to offer a free education in perpetuity.</p>\n<p>Their battle cry&#x2014;hanging from a banner over head and painted on the school&#x2019;s windows&#x2014;Keep it free!</p>\n<p>But it's a cry whose echo is quickly snuffed out in a national debate about crippling debt&#x2014;the kind that takes several decades to repay.</p>\n<p>It wasn't that long ago that the idea of scaling the economic mobility ladder through an education for zero dollars was no big deal.</p>\n<p>New York's City College, CCNY, is a school with such a stellar academic record that it's been called the Harvard of the Proletariat, the poor man's Harvard, and Harvard-on-the-Hudson. The school was free until 1976.</p>\n<p>The entire University of California system was free when it first opened. Then in 1968, Governor Ronald Reagan \"dealt a heavy blow\" when he <a href=\"http://ucsa.org/section/view/mission___history\" rel=\"nofollow\" target=\"_blank\">instituted the first student fee</a>.</p>\n<aside class=\"inline-content inline-content-nodes \">\n      <article class=\"node-32817 node node-openpublish-photo-gallery view-mode-inline-content view-mode-inline_content clearfix\">\n  <header>\n    <a class=\"inline-content-link\" href=\"http://www.takepart.com/photos/shocking-truths-need-know-student-loan-debts\">\n            <h2 class=\"inline-title\">10 Shocking Truths You Need to Know About Student Loan Debt</h2>\n        </a>\n  </header>\n</article>\n  </aside>\n\n<p>Still, Cooper Union was one of the few surviving academic institutions to offer a free education.</p>\n<p>Here are a few others, which, like Cooper Union, are highly competitive schools:</p>\n<p>The Webb Institute in Long Island, New York is an \"exceptional college of engineering\" and accepts 26 genius students a year.</p>\n<p>Berea College in Kentucky gives 400 needy applicants a four-year free ride. And Alice Lloyd College (also in Kentucky) offers full scholarships to students from Central Appalachia.</p>\n<p>College of the Ozarks in Missouri offers a free education in exchange for working on campus&#x2014;possibly on a dairy farm.</p>\n<p>Curtis Institute of Music is a music conservatory in Philadelphia that gives full scholarships.</p>\n<p>United State Military Academy, at West Point in New York, requires enrollees to serve in the military and play on school sports teams.</p>\n\n\n\n\n\n</div></div>",
    "date_published": "2013-05-12 00:00:00",
    "dek": null,
    "lead_image_url": null,
    "title": "Cooper Union Will Charge Tuition, Students Revolt",
    "rendered_pages": 1
}