{
    "domain": "hyperallergic.com",
    "next_page_id": null,
    "url": "http://hyperallergic.com/65545/cooper-union-saga-continues-as-administration-refuses-early-art-acceptances/",
    "short_url": "http://rdd.me/txwehd4h",
    "author": "Jillian Steinhauer on February 20, 2013 Tweet 0",
    "excerpt": "A student holding a sign stating Cooper Union President Jamshed Bharucha&#x2019;s salary at today&#x2019;s rally (all photos by Kyle Petreycik for Hyperallergic)Not long after the faculty of the&hellip;",
    "direction": "ltr",
    "word_count": 838,
    "total_pages": 0,
    "content": "<div><div class=\"format_text entry-content\"><div id=\"attachment_65551\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-65551\" alt=\"A student holds a sign stating Cooper Union President Jamshed Bharucha's salary at today's rally.\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/02/Cooper-rally1.jpg\" width=\"640\"><p class=\"wp-caption-text\">A student holding a sign stating Cooper Union President Jamshed Bharucha&#x2019;s salary at today&#x2019;s rally (all photos by Kyle Petreycik for Hyperallergic)</p></div><p>Not long after the faculty of the Cooper Union School of Art <a href=\"http://hyperallergic.com/64893/cooper-union-art-faculty-rejects-proposal-for-tuition/\">rejected plans</a> to begin charging tuition, the college&#x2019;s administration has struck back: it is now refusing to accept any School of Art applications for early admission, instead deferring all of them to the general admission pool.</p><p>According to <a href=\"http://cusos.org/student-rally-and-press-conference-for-deferred-early-decision-applicants/\">Cooper Union Student Action to Save Our School</a>:</p><blockquote><p>On Wednesday February 13th, two weeks after School of Art faculty submitted admissions results to be sent out to Early Decision applicants on schedule, an email was sent out by the Dean of Admissions stating simply that &#x201C;As requested by our Board of Trustees, all early decision art applicants after being reviewed by our Art Admissions Committee were either deferred to be reviewed along with the rest of the regular decision pool or denied admission. This letter is to inform you that your application has been deferred.&#x201D;</p></blockquote><div id=\"attachment_65553\" class=\"wp-caption alignleft\"><img class=\"size-full wp-image-65553\" alt=\"Victoria Sobel, a senior in Cooper Union's School of Art, addressing the audience prior to the start of the rally\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/02/Cooper-rally4.jpg\" width=\"320\"><p class=\"wp-caption-text\">Victoria Sobel, a senior in Cooper Union&#x2019;s School of Art, addressing the audience prior to the start of the rally</p></div><p>President Jamshed Bharucha also sent a letter to the Cooper Union Community elaborating on the decision. The language makes it completely clear that the administration&#x2019;s refusal to consider early admissions is exclusive to the School of Art and is a result of the art faculty&#x2019;s refusal to put forward their revenue-raising proposals:</p><blockquote><p>As you may recall from my memo in December, the Faculties of the Albert Nerken School of Engineering and the Irwin S. Chanin School of Architecture have forwarded their reports to me, and I have forwarded them to the Board for study and analysis. The Faculty of the School of Art &#x2026; has reversed its course &#x2026; stating that they &#x201C;can neither propose nor vote on a motion that moves these proposals forward,&#x201D; &#x2026; Pending the Board&#x2019;s decisions in March about the future of the institution, and in the absence of a sustainable model for the School of Art, the Executive Committee of the Board of Trustees has directed the administration to notify students seeking early admission to the School of Art that their applications will be considered as part of the art school&#x2019;s general application pool. We apologize to our early admission applicants to the School of Art for the delay in the decision process.</p></blockquote><p>In response to the situation, the Free Cooper Union students group held a <a href=\"https://www.facebook.com/events/334180480015112/\">rally</a> this afternoon. &#x201C;We can not stand by as the Board egregiously holds the futures of our incoming class hostage! These applicants are not collateral!&#x201D; their announcement proclaimed. Hyperallergic attended the rally, which, despite the cold weather, drew roughly 100 people by the end.</p><p>School of Art senior Victoria Sobel initiated the event, reading a prepared statement followed by a list of demands. Among those were:</p><blockquote><ul><li>the administration publicly affirm the college&#x2019;s commitment to free education. That they will stop pursuing tuition-based programs and eliminate other ways students are charged for education.</li><li>students and faculty members of from each school be appointed as voting members of the board.</li><li>the Executive Committee release the original acceptance and deferral decisions for the Early Decision applicants to the School of Art as decided by the Faculty.</li></ul></blockquote><p>After Sobel, a series of 13 statements written by early applicants to the Cooper Union School of Art were read aloud. Three of the hopeful students were on hand to read their own words; the first one, Owen Law, captured much of the frustration and disillusionment evident throughout all the statements.</p><p>&#x201C;I was angry to learn that my future had been deferred and was now a bargaining chip,&#x201D; Law said at one point. &#x201C;It is a disappointment that the administration is willing to use such sour negotiation tactics instead of engaging in constructive dialogue with the faculty.&#x201D;</p><p>The other 10 statements from prospective students were read by current students and alumni. Among the readers were barter-system&#xA0;<a href=\"http://tradeschool.ourgoods.org/\">Trade School</a> organizers <a href=\"http://hyperallergic.com/48115/a-conversation-with-caroline-woolard/\">Caroline Woolard</a> and Aimee Lutkin, who spoke to Hyperallergic about the situation at Cooper.</p><p>&#x201C;My entire mode of operating in the world was defined by peers who were all in the same playing field and didn&#x2019;t have to pay,&#x201D; said Woolard. &#x201C;So it&#x2019;s sad to imagine that we would have to accept what&#x2019;s supposedly the norm when clearly it isn&#x2019;t, even in Europe.&#x201D;</p><div id=\"attachment_65552\" class=\"wp-caption aligncenter\"><a href=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/02/Cooper-rally3-big.jpg\"><img class=\"size-full wp-image-65552 \" alt=\"A panorama of the crowd gathering at the start of the rally\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/02/Cooper-rally3.jpg\" width=\"640\"></a><p class=\"wp-caption-text\">A panorama of the crowd (with a human glitch at the center) gathering at the start of the rally (click to enlarge)</p></div><p>&#x201C;It&#x2019;s an issue of transparency,&#x201D; Lutkin told us. &#x201C;A lot of the things that we are demanding is to be aware of what&#x2019;s happening at board meetings and make it public. Why have we gotten into these financial constraints? Who would lead us down this path, and who&#x2019;s accountable for what happened?</p><p>&#x201C;We&#x2019;re making it public that people who applied early were deferred and that could be an issue to just be swept under the rug and people wouldn&#x2019;t know about it,&#x201D; she added. &#x201C;Now they know, and it&#x2019;s really messed up.&#x201D;</p><p>* &#xA0; * &#xA0; *</p><p><em>With additional reporting by Kyle Petreycik and JD Siazon</em></p> <p class=\"post_tags\">Tagged as: <a href=\"http://hyperallergic.com/tag/art-education/\" rel=\"tag nofollow\">art education</a>, <a href=\"http://hyperallergic.com/tag/cooper-union/\" rel=\"tag nofollow\">Cooper Union</a>, <a href=\"http://hyperallergic.com/tag/free-cooper-union/\" rel=\"tag nofollow\">Free Cooper Union</a></p>  </div></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/02/Cooper-rally1.jpg",
    "title": "Cooper Union Saga Continues as Administration Refuses Early Art Acceptances",
    "rendered_pages": 1
}