{
    "domain": "benlorber.wordpress.com",
    "next_page_id": null,
    "url": "http://benlorber.wordpress.com/2013/05/10/hawking-joins-boycott-foreclosing-on-wells-fargo-cooper-union-gets-occupied/",
    "short_url": "http://rdd.me/brklblc3",
    "author": null,
    "excerpt": "Stephen Hawking Joins BDS Movement:&#xA0;This week, Professor Stephen Hawking&#xA0;threw his weight&#xA0;behind the academic boycott of Israel pioneered by the global Boycott, Divestment and&hellip;",
    "direction": "ltr",
    "word_count": 328,
    "total_pages": 0,
    "content": "<div><div class=\"entry entry-content\">\n\t\t<p><strong>Stephen Hawking Joins BDS Movement:&#xA0;</strong>This week, Professor Stephen Hawking&#xA0;<a href=\"http://www.guardian.co.uk/world/2013/may/08/stephen-hawking-israel-academic-boycott\">threw his weight</a>&#xA0;behind the academic boycott of Israel pioneered by the global Boycott, Divestment and Sanctions (BDS) movement, refusing to attend a June conference hosted by Israeli President Shimon Peres in Jerusalem. In a letter written to Peres, Hawking announced he had decided not to attend the conference, in the words of a statement published with Hawking&#x2019;s approval, &#x201C;based upon his knowledge of Palestine, and on the unanimous advice of his own academic contacts there.&#x201D; In 2009, Hawking visited Israel and the West Bank and denounced Israel&#x2019;s brutal treatment of Palestinians in Gaza, remarking that &#x201C;the situation is like that of South Africa before 1990 and cannot continue.&#x201D;</p>\n<p><strong>Foreclosing on Wells Fargo</strong>: Protesters in downtown Los Angeles briefly&#xA0;<a href=\"http://www.citywatchla.com/8br-hidden/5027-occupy-protesters-shut-down-wells-fargo-over-fraudulent-foreclosures\">shut down the branch</a>&#xA0;of a Wells Fargo bank on Tuesday to draw attention to its foreclosure practices. About 80 activists, some of whom were owners of foreclosed homes, blockaded the bank&#x2019;s entrance for half an hour in an action organized by Occupy Fights Foreclosures, an Occupy Los Angeles subcommittee. The group, which has been defending a home in East Los Angeles for six months, pressures banks to negotiate with underwater homeowners. In several cases, it has taken dramatic direct actions to keep families in their homes, such as barricading the houses to prevent law enforcement and mortgage companies from entering .</p>\n<p><strong>Cooper Union Occupation:</strong>&#xA0;On May 8, students at New York&#x2019;s Cooper Union&#xA0;<a href=\"http://www.huffingtonpost.com/2013/05/08/cooper-union-presidents-office-occupy-tuition_n_3239403.html\">occupied the President&#x2019;s office</a>, days after the startling announcement that the historically free school would begin charging tuition to undergraduates. At least 50 students took over President Jamshed Bharucha&#x2019;s office and signed a statement of no confidence, which has been circulating among students and faculty. The Students For A Free Cooper Union have been waging a war of publicity and direct action against the administration&#x2019;s fight to erode the full scholarship it awards to every student, which activists claim is a hallmark sign of the neoliberal trend in education.</p>\n\n\n\n\n<div id=\"jp-post-flair\" class=\"sharedaddy sd-like-enabled sd-sharing-enabled\"><div class=\"sharedaddy sd-block sd-like jetpack-likes-widget-wrapper jetpack-likes-widget-unloaded\" id=\"like-post-wrapper-43658310-466-53f96c4900a26\"><h3 class=\"sd-title\">Like this:</h3><p class=\"likes-widget-placeholder post-likes-widget-placeholder\"><span class=\"button\"><span>Like</span></span> <span class=\"loading\">Loading...</span></p><a class=\"sd-link-color\"></a></div>\n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</p></div>\t</div>\n\n\t</div>",
    "date_published": "2013-05-10 00:14:03",
    "dek": null,
    "lead_image_url": null,
    "title": "Hawking Joins Boycott; Foreclosing on Wells Fargo; Cooper Union Gets Occupied",
    "rendered_pages": 1
}