{
    "domain": "hyperallergic.com",
    "next_page_id": null,
    "url": "http://hyperallergic.com/64893/cooper-union-art-faculty-rejects-proposal-for-tuition/",
    "short_url": "http://rdd.me/repl9g4q",
    "author": "Jillian Steinhauer",
    "excerpt": "Cooper Union art professor Day Gleeson speaking at a press conference in DecemberIt&#x2019;s been two months since the Cooper 11 students ended their clock tower occupation, but the battle at the&hellip;",
    "direction": "ltr",
    "word_count": 1030,
    "total_pages": 0,
    "content": "<div><div class=\"format_text entry-content\"><div id=\"attachment_64907\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-64907\" alt=\"Cooper Union art professor Day Gleeson speaking at a press conference in December\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/02/Cooper-U.jpg\" width=\"640\"><p class=\"wp-caption-text\">Cooper Union art professor Day Gleeson speaking at a press conference in December</p></div><p>It&#x2019;s been two months since the Cooper 11 students ended their <a href=\"http://hyperallergic.com/61755/cooper-union-students-end-their-occupation/\" target=\"_blank\">clock tower occupation</a>, but the battle at the Cooper Union over the question of tuition is far from over. The latest news is that the faculty of the School of Art has taken a public stand against the idea of charging tuition.</p><p>The statement comes in the form of a letter addressed to the administrative heads of the school. The letter places the struggle at the Cooper Union in the context of the larger educational crisis in this country, citing the increasingly and insanely high cost of college as the precise reason why the Cooper Union must remain free. It&#x2019;s quite eloquent, and worth quoting at some length:</p><blockquote><p>We have now come full circle, reaffirming our belief that The Cooper Union is not only the last citadel of the social reforms movement of the 19th century, but is in fact the vanguard of the 21st century &#x2014; a beacon of access to free education.</p><p>This is a moment of crisis in higher education nationwide. The cost of institutions of higher education is expanding at an alarming rate, while chasing elusive revenues from a decreasing population of increasingly burdened students and their families. In the context of a national prevailing tendency, the expansion on the scale proposed by the current process seems neither prudent nor sustainable. Expansion through the development of tuition dependent programs depreciates the historic identity of The Cooper Union and sacrifices the institution&#x2019;s most important asset: the mission.</p><p>In this light, at this moment, and under these conditions the Faculty of The School of Art opposes the very principle of generating revenue through tuition from academic programs. Any solution to The Cooper Union&#x2019;s current financial crisis that depends, even in part on tuition compromises and irreversibly damages the ideals of art, education, freedom, and citizenship that faculty, students, staff, and administrators have worked so hard to uphold and maintain, generation after generation.</p></blockquote><p>The full text is available on the website of the <a href=\"http://www.cusos.org/cooper-union-art-faculty-vote-to-reject-tuition/\">Cooper Union Student Action to Save Our School</a>, where a blog post characterizes the move as &#x201C;meaning that at this point in time 1/3 of Cooper Union&#x2019;s faculty has voted to&#xA0;<em>block&#xA0;</em>any tuition-related plans.&#x201D;</p><p><img class=\"alignleft\" alt=\"\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/Foundation-Building-3201.jpeg\" width=\"320\">The truth of that statement &#x2014; i.e. whether or not the letter holds any weight as a real obstructive tool or is more of a symbolic protest &#x2014; isn&#x2019;t entirely clear. But even if it&#x2019;s only the latter, the letter is important for publicly laying out the faculty&#x2019;s position on the unfolding, complicated, sometimes ugly situation at the school.</p><p>Part of understanding that position and its significance involves understanding what&#x2019;s been going on for the past year. To that end,&#xA0;Hyperallergic spoke with two adjunct faculty members at (and alumni of) the Cooper Union School of Art, Adriana Farmiga and Yuri&#xA0;Masnyj. They explained that soon after&#xA0;President Bharucha&#x2019;s arrival, he announced that the university was in a dire financial situation and charged the faculty at each of the three schools (Art, Architecture, Engineering) with brainstorming graduate programs that would generate revenue. They complied.</p><p>&#x201C;They were all doing it in the interest that they wanted to help the school; they were going along with it,&#x201D; said Masnyj. &#x201C;But it became clear that it was really just an expansion. The language that was being used was, &#x2018;If you don&#x2019;t come up with these programs, we will close your school. There will be target numbers, and if you don&#x2019;t reach those numbers, your school will be closed.&#x2019; There were a lot of threats going on.</p><p>&#x201C;What&#xA0;started to emerge was that if the faculty were to vote on these programs, they were essentially voting on financial matters for the school, which jeopardizes their status as laborers, not managers,&#x201D; Masnyj&#xA0;continued. This is what drove the art faculty to write the letter, which states that although they had originally generated their proposals in good faith, they can no longer endorse them in a similar manner. &#x201C;[We] can neither propose nor vote on a motion that moves these proposals forward,&#x201D; the letter reads.</p><p>Farmiga pointed out, however, that one of the best things to come out of the tuition debate is the consensus that&#x2019;s emerged both among the faculty and with the students and the school at large. &#x201C;What we&#x2019;re most excited about is how galvanized the resident faculty has been &#x2014; we haven&#x2019;t seen such a public testament to that as we have in the last few weeks,&#x201D; said Farmiga. &#x201C;It&#x2019;s heartening that there is a cultural change happening at Cooper, and one of the things that came out of a recent meeting was an acknowledgement that reinvention can also be a cultural reinvention.</p><p>&#x201C;I don&#x2019;t think I&#x2019;ve ever seen Cooper Union so united,&#x201D; she added. &#x201C;What it&#x2019;s also created for the first time is an open line of communication between faculty between the schools, which in the past&#xA0;hadn&#x2019;t existed on the level that it does now,&#x201D; Masnyj said.</p><p>The art faculty&#x2019;s letter speaks of &#x201C;exceptional gestures, efforts and solutions&#x201D; to address the institution&#x2019;s financial crisis, so we asked Farmiga and&#xA0;Masnyj what those might be. If not tuition, then what?</p><p>&#x201C;There&#x2019;s a history of decisions that have been made previous to what&#x2019;s happened in the last two years at Cooper that may or may not have been the most logical decisions,&#x201D; Farmiga said. &#x201C;I think that &#x2014; instead of leaning out, with tuition and tuition-generating programs, why don&#x2019;t we examine what we have? Why don&#x2019;t we reinvent within our means? It&#x2019;s adjusting the perspective.&#x201D;</p><p>&#x201C;The perspective would be,&#x201D; Masnyj explained, &#x201C;what can we do with the money that we bring in now and the budget that we operated on several years ago? Instead of thinking about how much more money we need to bring in.&#x201D;</p><p>&#x201C;This faculty letter is a display of consensus that the merit-based tuition scholarships are the central thing that need to be sustained,&#x201D; Farmiga told us. &#x201C;Using the engagement that can emerge from that consensus &#x2014; that&#x2019;s where we should really be focusing. I feel very lucky to be an artist that graduated from the Cooper Union,&#x201D; she said, &#x201C;because that&#x2019;s how I was taught to think.&#x201D;</p> <p class=\"post_tags\">Tagged as: <a href=\"http://hyperallergic.com/tag/adriana-farmiga/\" rel=\"tag nofollow\">Adriana Farmiga</a>, <a href=\"http://hyperallergic.com/tag/art-education/\" rel=\"tag nofollow\">art education</a>, <a href=\"http://hyperallergic.com/tag/cooper-union/\" rel=\"tag nofollow\">Cooper Union</a>, <a href=\"http://hyperallergic.com/tag/free-cooper-union/\" rel=\"tag nofollow\">Free Cooper Union</a>, <a href=\"http://hyperallergic.com/tag/yuri-masnyj/\" rel=\"tag nofollow\">Yuri Masnyj</a></p>  </div></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://hyperallergic.com/wp-content/uploads/2013/02/Cooper-U.jpg",
    "title": "Cooper Union Art Faculty Rejects Proposal for Tuition",
    "rendered_pages": 1
}