{
    "domain": "nyunews.com",
    "next_page_id": null,
    "url": "http://nyunews.com/index.php/2012/12/03/cooper-2/13800",
    "short_url": "http://rdd.me/rmmw2wc2",
    "author": null,
    "excerpt": "Eleven Cooper union students and 1 New School Free Press reporter have barricaded themselves in the Foundation Building of Cooper Union for the Advancement of Science and Art. In a scheduled&hellip;",
    "direction": "ltr",
    "word_count": 965,
    "total_pages": 0,
    "content": "<div><div class=\"single-article-content\"><p>Eleven Cooper union students and 1 New School Free Press reporter have barricaded themselves in the Foundation Building of Cooper Union for the Advancement of Science and Art. In a scheduled &#x201C;Day of Action,&#x201D; the protest was organized to object potential plans by President Jamshed Bharucha and the board of trustees to begin charging tuition for education programs in the coming fall semester.</p>\n<div id=\"attachment_13811\" class=\"wp-caption alignnone\"><a href=\"http://nyunews.com/index.php/2012/12/03/cooper/13800/photo-3\" rel=\"attachment wp-att-13811\"><img class=\"size-full wp-image-13811\" title=\"photo\" src=\"http://nyunews.com/wp-content/uploads/photo1-e1354569356380.jpg\" alt=\"\" width=\"605\"></a><p class=\"wp-caption-text\">Amy Zhang for WSN</p></div>\n<p><strong>UPDATE: 4:00 p.m.</strong>&#xA0;Students for a Free Cooper Union representative said the students barricaded themselves at approximately noon today.</p>\n<p><strong>UPDATE: 4:20 p.m.&#xA0;</strong>Kristi Cavataro, a junior in the Cooper Union&#x2019;s School of Arts who is in the barricade, said the administrators tried to drill in when the group of students first entered the room to set up the barricades.</p>\n<p>&#x201C;We told them to stop and that our bodies were up against the doors and our bodies were chained to the doors,&#x201D; Cavataro said. &#x201C;And we haven&#x2019;t heard them on the other side of our barricades.&#x201D;</p>\n<p>&#x201C;We&#x2019;ve got plenty of food, we&#x2019;re not planning on leaving until these demands are met,&#x201D; she said. &#x201C;Until we&#x2019;re forcibly removed, we are not leaving.&#x201D;</p>\n<p>Claire McCarthy, director of public affairs at the Cooper Union, said the university has been discussing various ways to keep the institution financially sustainable and preserve its academic excellence.</p>\n<p>&#x201C;Right now, undergraduate tuition is still secure, but there has been a tremendous amount of communication over the last year,&#x201D; McCarthy said.</p>\n<p>McCarthy added that no official decision has been made on tuition.</p>\n<p>&#x201C;There is a process under way where programs are being developed and will be evaluated by the president and the board,&#x201D; she said.</p>\n<p>She said the protesters are a small group of students, as most of them are from the School of Art: &#x201C;They do not necessarily represent the entire thousand-member student body or the faculty,&#x201D; she said.</p>\n<p>McCarthy said even though the university has been in contact with the group of students who are protesting, she does not know the outcome or if it has been reached at the time of the post.</p>\n<p><strong>UPDATE: 5:05 p.m.&#xA0;</strong>A maintenance worker for the Cooper Union, who wanted to remain anonymous, said he was placed on the roof by the school.</p>\n<p>He said the university noticed around 8 a.m. that students had started setting up for a demonstration in the Peter Cooper suite, located at the roof of the Cooper Union Foundation Building.</p>\n<p>&#x201C;That&#x2019;s when we started figuring out that something was going on,&#x201D; he said. &#x201C;We thought the elevator was probably broken, but it was actually that the students were holding the elevator to control it in the Peter Cooper&#x2019;s suite.&#x201D;</p>\n<p><strong>UPDATE: 5:28 p.m.&#xA0;</strong>Jasmine Stein, a Cooper Union senior, said she came to show her support for the movement.</p>\n<p>She said the students and faculty may share a challenging relationship because the professors have been asked to create revenue-generating plans.</p>\n<p>&#x201C;They have sort of been coerced into doing this. They don&#x2019;t really have much of a choice, and we&#x2019;re protesting against these programs,&#x201D; Stein said. &#x201C;I think a lot of them, or most of them, sympathize with us, but they can&#x2019;t officially be united with us.&#x201D;</p>\n<p><strong>UPDATE: 5:44 p.m. </strong>Molly Fabbri, a CAS junior, said she saw the protest on her way to class today.</p>\n<p>She said even though she understands why Cooper Union students are upset, she is not sure what the protest will achieve.</p>\n<p>&#x201C;If Cooper Union&#x2019;s financial straits are so bad that their tuition has to jump from zero to, from the looks of their website, $40,000 a year, they probably can&#x2019;t afford to relent just because students are angry,&#x201D; she said.</p>\n<p>&#x201C;I also don&#x2019;t think the students will be able to get a lot of powerful outside support,&#x201D; Fabbri said. &#x201C;I am a sympathetic party, but as someone who pays $60,000 a year for my education, the students who expected that their school would remain free even in the current economic environment seem naive.&#x201D;</p>\n<div id=\"attachment_13849\" class=\"wp-caption alignnone\"><a href=\"http://nyunews.com/index.php/2012/12/03/cooper/13800/12-04-cooperunion2\" rel=\"attachment wp-att-13849\"><img class=\"size-full wp-image-13849\" title=\"12-04-cooperunion2\" src=\"http://nyunews.com/wp-content/uploads/12-04-cooperunion2.jpg\" alt=\"\" width=\"610\"></a><p class=\"wp-caption-text\">Kristina Bogos/WSN</p></div>\n<p><strong>UPDATE: 6:31 p.m.&#xA0;</strong>Andrew Crudge, a Cooper Union senior and co-president of Student Council, said he does not agree with the issues the group of students raised through the protest.</p>\n<p>&#x201C;They think the administration isn&#x2019;t transparent. They don&#x2019;t think the administration has their best interests in mind. They&#x2019;re frustrated with the school,&#x201D; he said. &#x201C;I think the administration is working hard to come up with solutions that are appropriate.&#x201D;</p>\n<p>Peter Wirzbicki, a GSAS alumnus, participated in Take Back NYU&#x2019;s occupation of Kimmel Center for University Life in 2009. Take Back NYU coalition <a title=\"demanded\" href=\"http://www.nytimes.com/2009/02/20/nyregion/20nyu.html\">demanded</a> the university to be more transparent through various issues that included having an open account of the university&#x2019;s budget and investments and building a finance committee consisting of students.</p>\n<p>&#x201C;Both NYU&#x2019;s protests in 2009 and what is going on at Cooper Union now are fundamentally about tuition that is rising far faster than students have the ability to pay,&#x201D; he said.</p>\n<p>&#x201C;I notice that the Cooper Union students have demanded a more democratic means of communication and decision making within the university,&#x201D; Wirzbicki said. &#x201C;This is good and is something that NYU students have also demanded. When people speak of the corportization of higher ed, what they mean is that universities are increasingly becoming top down, profit-driven and anti-democratic places.&#x201D;</p>\n<p><strong>UPDATE: 6:44 p.m.&#xA0;</strong>Floyd Hammack, associate professor of Educational Sociology and Higher Education in Steinhardt School of Culture, Education and Human Development, said the Cooper Union protest is not parallel to the Kimmel Occupation from three years ago, as NYU never had free tuition.</p>\n<p>&#x201C;CU has experienced a financial crisis in the last year or so &#x2014; actually it has been building for a number of years &#x2014; and can no longer be put off,&#x201D; Hammack said. &#x201C;Colleges have real cost that must be paid, and if their income does not exceed their expenses, then cuts have to be made.&#x201D;</p>\n</div>\n\n\n    </div>",
    "date_published": "2012-12-03 00:00:00",
    "dek": null,
    "lead_image_url": "http://nyunews.com/wp-content/uploads/photo1-e1354569356380.jpg",
    "title": "BREAKING: Students set up barricade in Cooper Union, demand free education",
    "rendered_pages": 1
}