{
    "domain": "www.democracynow.org",
    "next_page_id": null,
    "url": "http://www.democracynow.org/2013/5/16/debate_what_caused_cooper_unions_fiscal",
    "short_url": "http://rdd.me/dklusrpw",
    "author": null,
    "excerpt": "This is a rush transcript. Copy may not be in its final form. JUAN GONZ&#xC1;LEZ: We turn now to education news, where students and administrators are clashing over the future of one of the last&hellip;",
    "direction": "ltr",
    "word_count": 3440,
    "total_pages": 0,
    "content": "<div><div id=\"story-transcript\">\n      \n      <div id=\"story-rush-transcript\">\n        <p>\n          This is a rush transcript. Copy may not be in its final form.\n        </p>\n      </div>\n      <p><strong><span class=\"caps\">JUAN</span> GONZ&#xC1;LEZ:</strong> We turn now to education news, where students and administrators are clashing over the future of one of the last private universities in the United States to offer free tuition. Students at Cooper Union in New York City are occupying the president&#x2019;s office for a ninth day after the school announced an end to more than a century of free tuition for undergraduates. Student activist Sebastian  Link read an open letter to Cooper Union President Jamshed Bharucha condemning his decision to end the school&#x2019;s long-standing tradition.</p>\n<blockquote>\n<p><strong><span class=\"caps\">SEBASTIAN</span> <span class=\"caps\">QUIJADA</span> <span class=\"caps\">LINK</span>:</strong> We, the students of The Cooper Union for the Advancement of Science and Art, can no longer uphold or endorse the direction our college has taken under the leadership of Jamshed Bharucha, with the support of the current board of trustees. As a student&#x2014;as the students, we are indebted and steadfastly committed to fulfilling the historic mission of Cooper Union as an institution committed to providing students with an exceptional educational experience without the burden of tuition, regardless of need.</p>\n</blockquote>\n<blockquote>\n<p>Central to this mission is the imperative to continue challenging the institutional and societal norms regarding education, accessibility, class mobility, pedagogy and organizational structures. The Union of Art, Architecture and Engineering has empowered a historically diverse student body that for over 150 years has served to shape engaged and creative citizens in and beyond New York City.</p>\n</blockquote>\n<blockquote>\n<p>As stewards of The Cooper Union, we are viscerally interconnected to Cooper&#x2019;s mission of championing free education to all. We know more intimately than any consulting firm that the integrity of academic and creative excellence achieved by The Cooper Union is intrinsic to the college providing its students full-tuition, merit-based scholarships.</p>\n</blockquote>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> Not all Cooper Union students support the protesters&#x2019; actions. Earlier this month, three students from the Engineering Students Council sent an email to the Cooper Union student body that read in part, quote, \"[We] acknowledge that the administration spent countless hours considering all other options before making this decision. We do not fault Jamshed for being tasked with solving a problem that he did not cause,\" unquote.</p>\n<p>President Jamshed Bharucha himself finally addressed students on Monday. An accomplished violinist, he tried to express himself through musical metaphor.</p>\n<blockquote>\n<p><strong><span class=\"caps\">JAMSHED</span> <span class=\"caps\">BHARUCHA</span>:</strong> I hear your mournful tones. I hear your high-pitched agitation. I hear your yearning for resolution and harmony. But I also hear the crescendo of hope. Our roller-coaster journey to avert financial insolvency has quite naturally ignited a spectacular array of expression. We would expect nothing less from Cooper students. The anger of protest, the hope of \"why Cooper,\" and if sorry could ever be stunning, the beautiful black third floor is both. I regret the need to bring about this kind of change that sparks these feelings. I wish we didn&#x2019;t have to. We should always aspire to be free again and to seek the resources to do so. Meanwhile, we must visit all these feelings as we heal, as we move on. I love Cooper Union. I&#x2019;m committed to working with you, with all my heart and soul.</p>\n</blockquote>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> For a roundtable discussion, we are joined on the phone by Mark Epstein. He&#x2019;s the chair of the board of trustees for Cooper Union. Here in the studio, Victoria Sobel, a Cooper Union student organizer who&#x2019;s been working on the Free Cooper campaign, among the activists who has occupied the president&#x2019;s office for over a week. Also with us, Reuters finance blogger Felix Salmon, who&#x2019;s been covering the story.</p>\n<p>We welcome you all to <em>Democracy Now!</em> Let&#x2019;s begin with the chair of the board of trustees of Cooper Union, Mark Epstein. Can you talk about this historic decision that the board and president have taken, for the first time in a century to charge the students of Cooper Union, the undergraduate students, tuition? Mark? Mark Epstein?</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> Yes, can you hear me? I know I&#x2019;m&#x2014;</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> Ah, I can hear you now.</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> Yeah, can you hear me now?</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> Yes, we hear you perfectly.</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> OK, fine. I want to make it really clear once again that this was not a presidential decision. I&#x2019;ve made public statements that this was a decision made by the board of trustees. That&#x2019;s our role. The students keep trying to put this on Jamshed&#x2019;s shoulders, which is completely improper. This is not his decision to make. He is a voting member of the board, but he&#x2019;s only one vote on the board.</p>\n<p>So, the problem is that the school&#x2014;let me first categorically state that had we had enough money and were able to generate enough revenue to cover our expenses and keep the school with 100 percent scholarship policy, that was our intention. But we can&#x2019;t. We don&#x2019;t have the ability to raise enough revenue.</p>\n<p>A big part of that problem&#x2014;and I&#x2019;ve made this public before&#x2014;is that we don&#x2019;t have enough alumni support. Traditionally, only 20 percent of our alumni, who have gotten 100 percent scholarships, give back to the school on a regular basis. You know, contrast that with Princeton. Princeton charges now $40,000-some-odd a year for scholarships, and they&#x2019;re one of the best schools at alumni participation. They get a participation rate of approximately 65 percent. And most&#x2014;some of the loudest voices of our alumni against this new change in policy&#x2014;you know, without giving out confidential information&#x2014;their names do not appear on donor lists. So, I question their commitment to the school other than verbal.</p>\n<p>Peter Cooper himself said, \"In the course of a century\"&#x2014;and this is a quote. \"In the course of a century, there will of course be a great number of graduates of the Cooper Union and that they will surely come when they, these graduates, will rally around this institution. And if the plans I have formed can be executed in no other way, they will see that they are carried out.\" But the alumni are not doing that.</p>\n<p>Again, if we had the money to keep the policy going, we would. And the policy change was that we were reducing the 100 percent scholarship to 50 percent, a minimum of 50 percent for all admitted students. Those students truly of need will still get a 100 percent scholarship.</p>\n<p><strong><span class=\"caps\">JUAN</span> GONZ&#xC1;LEZ:</strong> And, Mr. Epstein, what has happened in recent years to the finances of the school that have required this? Because some critics are saying that it was errors of the trustees in their financial plans, like building a new building and taking out a huge new mortgage that they couldn&#x2019;t pay, that have resulted in these problems.</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> All right, you know, I&#x2019;d like, again, to clear this up one more time. The building helped us financially; it did not hurt us. We had two buildings that were in need of tens of millions of dollars in upgrading to make them building and fire code compliant, to make them <span class=\"caps\">ADA</span> compliant. The accrediting boards that determine whether or not we can offer degrees questioned the validity and the viability of our facilities, because they were falling behind par.</p>\n<p>The new building was paid for by selling the ground lease under our old engineering building, which we got $97 million for, right before the crash. And we raised $60 million in specific naming opportunities for the new building as part of the capital campaign. The new building going up on our old engineering building site, being built by Minskoff, will generate $2 million a year at least, ongoing, to the school. The building was paid for by those funds, not the loan.</p>\n<p>The loan proceeds were eaten up by the deficit. That&#x2019;s our problem. The school has been running a deficit, primarily because the costs of education have gone up. That&#x2019;s why Princeton and Harvard and other schools are now charging $40,000, $50,000 a year per student. We never had the luxury of being able to raise tuition to meet our expenses. It&#x2019;s just the cost&#x2014;and this is a problem throughout higher education, not just at Cooper Union.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> Felix Salmon, you&#x2019;ve been covering this story for quite some time. You&#x2019;re a blogger for Reuters. Your response to what the chair of the board of trustees has said?</p>\n<p><strong><span class=\"caps\">FELIX</span> <span class=\"caps\">SALMON</span>:</strong> So, yeah, Mr. Epstein, can you just explain this? Because it&#x2019;s really not very clear. You&#x2019;re saying that the $175 million loan, which you took out, the mortgage you have on the new building, basically, that all of that $175 million went into accumulated past deficits which had somehow become very salient overnight, and that you had some plan to pay the $10-million-a-year mortgage payments on that loan, which&#x2014;yeah, what happened to that plan?</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> OK. First of all, you know, in your article, you have so much inaccuracies that I&#x2019;m surprised Reuters publishes you. First of all, the loan is not on the new building. The loan was taken out against the Chrysler Building, which is a very secure asset. Also, the hundred&#x2014;part of the $175 million loan went to pay off $23 million of existing debt, because Met Life would not loan us the $150 million we asked to loan, because we had an outstanding debt that would take precedent. So they offered to loan us $175, so we could pay off the other dormitory bonds, so there wouldn&#x2019;t be any other debt in front of theirs. And the money was&#x2014;not all of the money is gone. We still have $110 million or so in the endowment. But the difference has been eaten up by the deficit. I don&#x2019;t see why that&#x2019;s so difficult for you to understand.</p>\n<p><strong><span class=\"caps\">FELIX</span> <span class=\"caps\">SALMON</span>:</strong> So, you have $110 million in the deficit, and you have a $175 million loan.</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> No, we have $110 million in the endowment.</p>\n<p><strong><span class=\"caps\">FELIX</span> <span class=\"caps\">SALMON</span>:</strong> Right, in the endowment.</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> Invested portion of the endowment. The rest of our endowment is in real estate, such as the Chrysler Building land.</p>\n<p><strong><span class=\"caps\">FELIX</span> <span class=\"caps\">SALMON</span>:</strong> And what was the $175 million for?</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> To cover our expenses going forward. Part of it was used as a bridge loan, while the building was being built, because the moneys from the capital campaign takes years to come in. Most people that make substantial gifts pay it out over five years. So, while that money was coming in, we use part of the proceeds from the loan. Money is fungible. You know, it&#x2019;s not that the&#x2014;if you take two weeks of your salary and put it in your checking account, and then you go to pay your electric bill of $200, does it matter which check that $200 came out of? No, it goes into the general pool. So, you know, you people keep trying to pin the $175 million loan [inaudible]&#x2014;</p>\n<p><strong><span class=\"caps\">FELIX</span> <span class=\"caps\">SALMON</span>:</strong> Could I ask one more question?</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> &#x2014;the building. That&#x2019;s not the case.</p>\n<p><strong><span class=\"caps\">FELIX</span> <span class=\"caps\">SALMON</span>:</strong> Let&#x2019;s&#x2014;let&#x2019;s stop talking about balance sheets and start talking about income statements. The amount of money coming in from the Chrysler Building and from other sources barely covered the amount&#x2014;the expenses of the university. You then took out a loan, which had interest payments associated with it of another $10 million-plus per year. Where was that $10 million-plus per year supposed to come from?</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> Well, we were hoping that it would come from more doning&#x2014;donations from the capital campaign. This was done before the crash of 2008, 2009. You know, you have to remember, in that period of time, schools like Harvard lost 36 percent of their endowment. We lost a lot smaller percentage than that. Our percentage of performance made us one of the best-performing endowments in the country, because we lost a smaller percentage than just about everybody else. But as one of our trustees said, you can&#x2019;t spend relative performance. We lost money, which we could not afford to lose. Everybody lost money.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> Just for&#x2014;</p>\n<p><strong><span class=\"caps\">JUAN</span> GONZ&#xC1;LEZ:</strong> I&#x2019;d like to bring in&#x2014;</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> Just for one clarification, in the reference to the Chrysler Building, which is a famous world-renowned building in New York, it is Cooper Union that owns the land under it, where it makes so much of its money, the leasing of the land by the Chrysler Building. It gets something like, according to <em>The New York Times</em>, nearly 84 percent of its assets. Juan?</p>\n<p><strong><span class=\"caps\">JUAN</span> GONZ&#xC1;LEZ:</strong> Yeah, Victoria Sobel, I&#x2019;d like to bring you in. One, the trustee chairman talking about that this&#x2014;the students will still be getting 50 percent of their costs covered who come to the university. Talk about the impact on the students and why you decided to sit in.</p>\n<p><strong><span class=\"caps\">VICTORIA</span> <span class=\"caps\">SOBEL</span>:</strong> I think that we see that, even given a 50 percent discount to the tuition that&#x2019;s going to happen, that this will be something that bars students who have maybe not the largest need, but a middle version of need, that come from middle-class families, who might be receiving competitive scholarships elsewhere to not be able to attend the school. It&#x2019;s something that is going to impact students on a class and racial, like, level. And we see that that&#x2019;s something that&#x2014;I know if it was me, I&#x2019;m sure that the <span class=\"caps\">FAFSA</span> would tell my family that we would be expected to give some sort of giving. I already take out private loans to attend Cooper. I&#x2019;ve got about $60,000 worth of debt just to attend the free school as it is, and this doesn&#x2019;t take that into account at all.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> Because? That debt comes from?</p>\n<p><strong><span class=\"caps\">VICTORIA</span> <span class=\"caps\">SOBEL</span>:</strong> I have&#x2014;I have a debt that is both private loans and also from the government.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> So why have you occupied the president&#x2019;s office?</p>\n<p><strong><span class=\"caps\">VICTORIA</span> <span class=\"caps\">SOBEL</span>:</strong> We&#x2019;ve seen that over the past two years both the chairman of the board and Jamshed Bharucha have effectively served as a bottleneck for the community trying to reach the board. I hear what Mark is saying about how he believes that the students are targeting Jamshed, but he is also a functioning member of the board and fails to report back to the board the wishes of the community. We have still failed to receive a response to a vote of no confidence, which includes over 400 members of the student body of a school that&#x2019;s over&#x2014;that&#x2019;s about a thousand students total, with 200 faculty, and a vote of no confidence from the full-time faculty of the School of Art.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> You&#x2019;re holding up all the petitions.</p>\n<p><strong><span class=\"caps\">VICTORIA</span> <span class=\"caps\">SOBEL</span>:</strong> I&#x2019;m holding up all of the petitions that have been signed. And our biggest complaint is that there is no form, in the existing governance, which allows the student body and the faculty body or the deans to criticize or to remove members of the board of trustees, including Jamshed, because he is a functioning member of the board.</p>\n<p>And in regards to the 20 percent donation rate that Mark has mentioned, in speaking to many alumni, the largest complaint that I see is that there is no way for alumni to give in a way that would be specified specifically for tuition. They&#x2019;re expected to give into an annual fund or a restricted fund in which, like, the money can be moved around. And I have seen many alumni&#x2014;there&#x2019;s been pledges online that would be more than willing to give, if the money could be explicitly saved for covering the tuition costs of students.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> Mark Epstein, in the <em>New York Times</em> <a href=\"http://www.nytimes.com/2013/05/11/business/how-cooper-unions-endowment-failed-in-its-mission.html\">piece</a> by James Stewart about&#x2014;which was headlined \"How Cooper Union&#x2019;s Endowment Failed in Its Mission,\" James Stewart writes, \"This week, angry students were occupying the president&#x2019;s office in protest. They might be even angrier to learn that some of their future tuition dollars could be going to support wealthy hedge fund managers who oversee some of the school&#x2019;s $666.7 million endowment.\" Your response to that?</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> First of all, about $500 million of that is the value of the Chrysler Building land. Hedge fund managers don&#x2019;t touch that. Yes, we have money invested in hedge funds, and traditionally, all schools that do that pay fees to the people that manage the funds. They don&#x2019;t do it for free.</p>\n<p>You know, one thing I want to comment about raising money for tuition, every dollar we raise goes to tuition. That&#x2019;s our business. We provide education. So all the money goes to tuition. So, to say to raise money specifically for tuition doesn&#x2019;t really make sense. I&#x2019;m sorry, but that&#x2019;s&#x2014;every dollar we raise, traditionally, goes to pay for these students at the&#x2014;we provide close to a thousand students with a full-tuition scholarship. It&#x2019;s just, unfortunately, not available, not&#x2014;we&#x2019;re not able to do it anymore.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> So, how much will the tuition be, starting in September? How much?</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> OK. OK, our published tuition rate is $38,500 a year. So, everybody will automatically get half of that as a scholarship. It&#x2019;s $19,250, which is a nice gift. The balance will be paid by those who can afford it on a sliding scale. We still anticipate, you know, maybe 25 to 30 percent of the students will still get a 100 percent scholarship. Approximately the same number will be able to pay the $19,250. And the others will be a sliding scale.</p>\n<p>You also have to remember that when the school was founded, Peter Cooper founded the school to provide an education for those who cannot otherwise afford it. That was his goal. That was the era. He wasn&#x2019;t petitioning Harvard and Columbia, telling them that they should give it away for free. He knew they were tuition-driven models that excluded people like himself that couldn&#x2019;t afford it. So he set up The Cooper Union to help people like himself.</p>\n<p><strong><span class=\"caps\">JUAN</span> GONZ&#xC1;LEZ:</strong> And, Mr. Epstein&#x2014;</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> The full-tuition&#x2014;</p>\n<p><strong><span class=\"caps\">JUAN</span> GONZ&#xC1;LEZ:</strong> &#x2014;I wanted to get back to this issue of&#x2014;</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> The full-tuition scholarship has been around for a hundred years. The school has been around for 154 years, because those first 50 years people were paying. Some people were paying. And Peter Cooper&#x2019;s own writing said that for each student that pays, it covers the cost of two other students that can&#x2019;t afford to pay. It was only in the early 1900s, after a number of substantial gifts, including the land that&#x2019;s now under the Chrysler Building, that Abram Hewitt made the school free for all.</p>\n<p><strong><span class=\"caps\">JUAN</span> GONZ&#xC1;LEZ:</strong> And, Victoria&#x2014;</p>\n<p><strong><span class=\"caps\">MARK</span> <span class=\"caps\">EPSTEIN</span>:</strong> And it&#x2014;</p>\n<p><strong><span class=\"caps\">JUAN</span> GONZ&#xC1;LEZ:</strong> &#x2014;your response? We have about a minute left.</p>\n<p><strong><span class=\"caps\">VICTORIA</span> <span class=\"caps\">SOBEL</span>:</strong> I think that, actually, there are many historians, some of which work at the school, which will disagree with Mark&#x2019;s characterization of the history of the school. I think that given that the board of trustees has cited there has been some fiscal mismanagement for the past 30 years, and it&#x2019;s only been announced to the Cooper community in the past two, we really regret, very strongly, it&#x2019;s&#x2014;I find it abhorrent that the community doesn&#x2019;t have a conduit to remove members of the board or to have any representation, voting representation, of students and faculty on the board. Mark&#x2014;</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> What do you see as the alternative to raising&#x2014;to imposing tuition? And what would end your occupation of the president&#x2019;s office?</p>\n<p><strong><span class=\"caps\">VICTORIA</span> <span class=\"caps\">SOBEL</span>:</strong> We have cited both that&#x2014;either if Jamshed Bharucha steps down&#x2014;we believe that that would be a way for us to be addressing the board more clearly&#x2014;but also we have three outstanding demands from the last occupation, which include the administration publicly reaffirming the mission statement of the school as being free to all students who attend, and also making major changes in the governance, which would allow for students and faculty to have representation on the board and for minutes of the board meetings to be made public and accessible. As they stand right now, there are neither.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> And the alternative to tuition?</p>\n<p><strong><span class=\"caps\">VICTORIA</span> <span class=\"caps\">SOBEL</span>:</strong> We see that there is like&#x2014;and I believe Mark will agree, that there is a five-year gap until the property value of the Chrysler Building will jump. And there have been many different proposals, which include different versions of bringing in revenue that could help sustain us in that time.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> We&#x2019;re going to have to continue this discussion another time, but I thank you so much for being with us. Victoria Sobel&#x2014;</p>\n<p><strong><span class=\"caps\">VICTORIA</span> <span class=\"caps\">SOBEL</span>:</strong> Thank you.</p>\n<p><strong><span class=\"caps\">AMY</span> <span class=\"caps\">GOODMAN</span>:</strong> &#x2014;is a student organizer at Cooper Union. Mark Epstein, chair of the board of trustees. And Felix Salmon, Reuters finance blogger.</p>\n      <div id=\"transcript-expand-collapse\">\n        <p id=\"transcript-expand\">Show Full\n          Transcript &#x203A;\n        </p>\n        <p id=\"transcript-collapse\">&#x2039; Hide Full\n          Transcript\n        </p>\n      </div>\n    </div>\n</div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.democracynow.org/images/story/81/22981/splash/cooper_decor.png?3_0",
    "title": "Debate: What Caused Cooper Union’s Fiscal Woes and Is Ending Free Tuition the Answer?",
    "rendered_pages": 1
}