{
    "domain": "www.crainsnewyork.com",
    "next_page_id": null,
    "url": "http://www.crainsnewyork.com/article/20130605/ECONOMY/130609962",
    "short_url": "http://rdd.me/nowhcwwq",
    "author": "Theresa Agovino",
    "excerpt": "Cooper Union for the Advancement of Science and Art, which announced in April that it will end its policy of providing free tuition to all students, received two little-known tax breaks from the city&hellip;",
    "direction": "ltr",
    "word_count": 671,
    "total_pages": 0,
    "content": "<div><div id=\"article-body\" class=\"-ce-capture\">\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t  \n\t\t\t\t\t\t\t\t\t\t<p>\nCooper Union for the Advancement of Science and Art, which announced in April that it will end its policy of providing free tuition to all students, received two little-known tax breaks from the city for real estate that is either totally unrelated to education or will only be marginally connected to its mission, according to the city's Independent Budget Office.</p><p>Schools typically get a property tax break for locations where classes are held, students are housed, or administrative operations conducted. Cooper Union's charter from 1859 exempted the institution from any taxes to city and state, sources said.</p><p>For nearly 100 years the college provided free tuition for all its students but administrators announced in April that its financial problems were forcing the school to start charging for undergraduate education in the fall of 2014. Those undergraduates will pay about $19,250, for the year or roughly half of what their education costs the school to provide. It is also much cheaper than other private institutions. For example, Columbia University charges $45,028 for its Columbia College undergraduate program while Pace University charges $35,320.</p><p>City officials, however, began questioning some of Cooper Union's preferential tax treatment even before the tuition announcement. Several years ago, the city challenged the tax exempt status of two parcels of land when the college said it had plans to lease them to private developers in order to raise money, sources said.</p><p>In 2007, Cooper Union struck a deal with the city that required it to pay what is called \"a payment in lieu of taxes\" which is equal to about half of the taxes a commercial enterprise would have to pay. One of the properties is at its former engineering building at 51 Astor Place, and the other a former parking lot at 22-36 Astor Place.</p><p>\"The other universities don't get to do these kinds of commercial deals,\" said Doug Turetsky, chief of staff at the Independent Budget Office.</p><p>Cooper Union leased the parking lot on Astor Place to The Related Cos., which built a 21-story luxury residential building that opened there in 2005. Under the agreement, Cooper Union was exempt from any payments until fiscal year 2011. The Independent Budget Office estimates that the city will lose $2.1 million in tax revenue from the residential building this year because of the deal between the city and Cooper Union. A spokesman for the city's finance department didn't return calls, and a Cooper Union spokesman declined comment.</p><p>The extent of the tax break on the other piece of real estate isn't known yet because the building hasn't opened. Developer Edward J. Minskoff Equities is constructing an office tower on land it leases from Cooper Union at 51 Astor Place. The city gave Cooper Union that land in 1959 on the condition it only be used for educational purposes.</p><p>However, in 2002, The City Planning Commission allowed Cooper Union to develop a commercial property on the land restricted by law to education and philanthropic uses, in part because the school needed the money and offered free education to its students. In 2007, the Bloomberg administration released Cooper Union from the requirement of using the land for educational purposes in exchange for a $980,000 payment and a promise that part of any new building would be used for school purposes. Only one floor of the 13-story building will be used by Cooper Union, Mr. Turetsky said.</p><p>Cooper Union also owns the land under the Chrysler Building and uses the rent it collects to fund part of its budget. The tax breaks the school gets on that land have been previously reported: Cooper Union pays no tax on the land, and the owner of the building gives what it would have paid in taxes to the school to help fund its budget.</p><p>All told, the city will lose $20 million in taxes between the breaks Cooper Union gets on the land beneath the Chrysler Building and Related's residential tower.</p><p>\"I don't know if there is anything the city can do about these deals now that there is no more totally free tuition,\" Mr. Turetsky said.\n</p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t     \t\n\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t     \n\t\t\t\t\t\t</div>",
    "date_published": "2013-06-05 00:00:00",
    "dek": null,
    "lead_image_url": "http://www.crainsnewyork.com/apps/pbcsi.dll/storyimage/CN/20130605/ECONOMY/130609962/AR/0/Cooper-Union.jpg?maxw=800&q=70",
    "title": "IBO questions Cooper Union tax breaks",
    "rendered_pages": 1
}