{
    "domain": "eastvillage.thelocal.nytimes.com",
    "next_page_id": null,
    "url": "http://eastvillage.thelocal.nytimes.com/2013/02/20/cooper-union/",
    "short_url": "http://rdd.me/mgreh1bz",
    "author": "SAMANTHA BALABAN",
    "excerpt": "As expected, current and prospective students gathered outside Cooper Union’s Foundation Building today to protest the deferral of early-decision applicants. Students from the group Cooper Union SOS&hellip;",
    "direction": "ltr",
    "word_count": 687,
    "total_pages": 0,
    "content": "<div class=\"entry-content\" score=\"33.75\">\n\t\t\t\n<div class=\"w240 right\"><a title=\"IMG_3413 by The Local East Village Flickr, on Flickr\" href=\"http://www.flickr.com/photos/local-east-village/8493212870/\"><img src=\"http://farm9.staticflickr.com/8233/8493212870_8729d2a48b_m.jpg\" alt=\"IMG_3413\" width=\"240\"></a></div>\n<p>As <a href=\"http://eastvillage.thelocal.nytimes.com/2013/02/19/cooper-union-students-will-protest-latest-turn-in-tuition-saga/\">expected</a>, current and prospective students gathered outside Cooper Union’s Foundation Building today to protest the deferral of early-decision applicants. Students from the group Cooper Union SOS read statements from prospective students who are in limbo ahead of the school’s vote next month regarding the possibility of charging tuition.</p>\n<p>Victoria Sobel, a senior in the School of Art, kicked off the event at 1 p.m. with a statement in support of deferred students and a list of demands for the administration, including that it publicly affirm the college’s commitment to free education and let early-decision applicants know whether they have been accepted to the School of Art.</p>\n<p>“I think we need public redress on this issue. I think it’s something that the city needs to be aware of, that other institutions and other students need to be aware of given the climate of higher education globally and what’s going on with student debt,” said Ms. Sobel.</p>\n<p>Earlier today, The Cooper Union explained its decision to defer early-decision applicants to the regular admission pool.<br><span id=\"more-43556\"></span></p>\n<div class=\"w240 right\"><a title=\"IMG_3417 by The Local East Village Flickr, on Flickr\" href=\"http://www.flickr.com/photos/local-east-village/8492111665/\"><img src=\"http://farm9.staticflickr.com/8391/8492111665_b375fba509_m.jpg\" alt=\"IMG_3417\" width=\"240\"></a> <span class=\"caption\">Protestors gather outside The Cooper Union </span></div>\n<p>“The simple, sobering fact is that The Cooper Union’s expenses exceed its revenues,” read the statement. “Ignoring that won’t alter fundamental reality: the present financial model is unsustainable.  Despite having achieved $4 million in cost reductions, the weight of a long-standing structural deficit, intensified by the recession, has left the institution with a $12 million annual deficit — or 20 percent of its cash budget.”</p>\n<p>The full statement is reprinted below.</p>\n<p>Patrick Collingworth, a sophomore studying architecture, held up a sign suggesting he disagreed with the college’s assessment of its financial situation: “[President] Jamshed’s Salary: $750,000 and a free house.”</p>\n<div class=\"w240 right\"><a title=\"IMG_3430 by The Local East Village Flickr, on Flickr\" href=\"http://www.flickr.com/photos/local-east-village/8492110551/\"><img src=\"http://farm9.staticflickr.com/8388/8492110551_1c6d7303d8_m.jpg\" alt=\"IMG_3430\" width=\"240\"></a> <span class=\"caption\">Students Casey Gollan and Patrick Collingworth</span></div>\n<p>“Last night I was just so angry at 11 p.m. and I just thought ‘All right I’m going to do something,’” said Mr. Collingworth. “And the sign means that endowment is being spent on the wrong things. I mean this isn’t just nitpicking about one person’s salary or two people’s salaries, but it’s symbolic of the mass misspending of our wealth.”</p>\n<p>Owen Law, a high school senior and early-decision applicant from Ontario, Canada, said he traveled 12 hours by bus to attend the protest. “I’ve been obsessed with [Cooper Union] for about four years now,” said Mr. Law. “We just want to see a meritocracy work in the U.S.A. And what’s happening is it’s being turned into a business.”</p>\n<p>The statement from Cooper Union:</p>\n<blockquote><p>The simple, sobering fact is that The Cooper Union’s expenses exceed its revenues. Ignoring that won’t alter fundamental reality: the present financial model is unsustainable. Despite having achieved $4 million in cost reductions, the weight of a long-standing structural deficit, intensified by the recession, has left the institution with a $12 million annual deficit—or 20% of its cash budget.</p>\n<p>That is why the President asked the faculties of the School of Art, The Albert Nerken School of Engineering and the Irwin S. Chanin School of Architecture each to submit plans for generating sufficient revenue to lead to a sustainable future. The plans of the engineering and architecture schools have been submitted and are being reviewed by the Board of Trustees. The art school prepared a plan, but a quorum of the school’s faculty, several days later, attached a post-script preventing the plan from being considered, saying the School of Art Faculty “opposes the very principle of generating revenue through tuition from academic programs,” including summer school or graduate programs. That course is unsustainable.</p>\n<p>This is an existential crisis, not a plebiscite about tuition. It should also be obvious that little is served by staking out a high road that leads off a cliff. Rather we must openly confront the challenges we face and by doing so—responsibly, inventively and cooperatively—preserve this great institution today and for generations to come.</p>\n<p>Early admission applications to the art school will be considered as part of the general admission pool. We regret any inconvenience caused to these students.</p>\n<p>We remain committed to a sustainable institution that is true to the legacy of Peter Cooper—based on the highest standards of academic excellence and merit-based admission.</p></blockquote>\n\t\t</div>\n\t",
    "date_published": "2013-02-20 15:55:00",
    "dek": null,
    "lead_image_url": "http://farm9.staticflickr.com/8233/8493212870_8729d2a48b_m.jpg",
    "title": "Photos: Cooper Union Students Vow to Stay Free or Die Tryin’",
    "rendered_pages": 1
}