{
    "domain": "occupywallst.org",
    "next_page_id": null,
    "url": "http://occupywallst.org/article/students-occupy-cooper-union-presidents-office/",
    "short_url": "http://rdd.me/usutuisp",
    "author": null,
    "excerpt": "@FreeCooperUnion on Twitter &#x201C;This is a non-violent direct action, you are not being held in this room, you are free to exit when you please. We no longer recognize your presidency at Cooper as&hellip;",
    "direction": "ltr",
    "word_count": 563,
    "total_pages": 0,
    "content": "<div><div class=\"words\">\n    \n      \n            \n\n<p><br><a href=\"http://twitter.com/FreeCooperUnion\" target=\"_blank\">@FreeCooperUnion on Twitter</a></p>\n<p><em>&#x201C;This is a non-violent direct action, you are not being held in this room, you are free to exit when you please. We no longer recognize your presidency at Cooper as legitimate and in so doing we commit to re-claim this office in the interim until a suitable administrative alternative is secured.\"</em> </p>\n<p>Over 50 students have overtaken the office of Cooper Union President Jamshed Bharucha in response to the Administration and the Board of Trustees announcing the implementation of tuition for the incoming class of 2014- desecrating a 154 year old tradition of meritocracy and free education. \"We stand together with the extended Cooper community in opposition to this decision; we reaffirm all of the previous and future actions of our fellow students and allies.\"</p>\n<p><strong>UPDATE:</strong> Cooper Union Students are calling for a <a href=\"https://www.facebook.com/events/666580176701209/\">Solidarity Rally</a> Tonight at 6PM outside the Foundation Building at Cooper Square Park.</p>\n<p>The students delivered a <a href=\"http://cusos.org/students-take-presidents-office/\">Statement of No Confidence</a> from the School of Art, one of the three colleges that make up Cooper Union. Similar Statements of No Confidence are currently in the process of being drafted and voted upon by the School of Architecture and the School of Engineering.</p>\n<p>On April 23, 2013, Cooper Union&#x2019;s board of trustees announced that they will begin <a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?pagewanted=all&amp;_r=0\">charging tuition</a>, <a href=\"http://en.wikipedia.org/wiki/Cooper_Union\">ending the university&#x2019;s 144-year-old mission of providing free education to all those who merited entry.</a>  The decision was met with a united uproar of dissent from nearly all sectors of the university community, including students, faculty, and alumni. While it might seem counterintuitive to get behind a relatively small struggle at one of the most exclusive universities in the country&#x2014;an old-fashioned meritocracy in a world in which a young person&#x2019;s &#x201C;potential&#x201D; is directly proportionate to their family&#x2019;s economic station&#x2014;Cooper Union is by far the most diverse of all elite colleges: white students are a minority here and two-thirds of the student body attended public high schools.</p>\n<p>Institutions funded by philanthropy and real estate earnings are clearly unsustainable as foundations for a quality education, but the school&#x2019;s economic problems and its board&#x2019;s regressive solutions mirror the situation currently taking place at countless other universities, both public and private. From CUNY tuition hikes to the <a href=\"http://www.psc-cuny.org/clarion/january-2013/middle-states-commission-warns-medgar-evers-college-over-accreditation\">torpedoing of Medgar Evers College</a> to NYU&#x2019;s <a href=\"http://nyunews.com/2013/04/10/protest-3/\">unprecedented land grab</a>, students across the city are fighting back. As student struggles continue across the globe, Cooper Union is a flashpoint for something much larger than itself.</p>\n<p><a href=\"http://en.wikipedia.org/wiki/Peter_Cooper\">Peter Cooper,</a> the school&#x2019;s founder, railed against the scourge of student debt a century and a half before the streets of Montreal exploded with resistance, before New York universities faced a string of militant occupations, before students in California put their bodies on the line against tuition hikes and the commodification of higher education. The ongoing fight at Cooper Union is but one part of the broader struggle against austerity, debt, and all other symptoms of capitalism.</p>\n<p>On May 1, a 36-page mini-zine that serves as a postscript to last year&#x2019;s <em><strong><a href=\"http://year0.org/2012/12/04/why-is-cooper-union-being-occupied/\">Why is Cooper Union Being Occupied?</a></strong></em> was produced and distributed around the city. Collecting recent articles, editorials, and primary source documents, this basic update outlines the current situation at Cooper Union, at once a eulogy and a call for new resistance.</p>\n<p>Download the <a href=\"http://groupaffect.files.wordpress.com/2013/05/cooper-union-may1.pdf\">PDF</a> here, read online <a href=\"http://www.mediafire.com/view/?sdvyrchjog93e5e\">here</a>, or come down to Cooper Union and pick up a hard copy.</p>\n<p>For Live Updates, follow Free Cooper Union on <a href=\"http://ustream.tv/channel/free-cooper-union\">UStream</a> and <a href=\"http://twitter.com/freecooperunion\">Twitter</a></p>\n      \n    \n  </div>\n  \n    \n  \n  \n</div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": null,
    "title": "LIVE: Students Occupy Cooper Union President's Office",
    "rendered_pages": 1
}