{
    "domain": "www.shareable.net",
    "next_page_id": null,
    "url": "http://www.shareable.net/blog/fighting-for-a-free-education",
    "short_url": "http://rdd.me/kv8xvmua",
    "author": "Willie Osterweil",
    "excerpt": "Yesterday, 10 Cooper Union students locked themselves inside the top floor of the university&#x2019;s iconic Foundation Building. They occupied as part of a day of action against proposed tuition&hellip;",
    "direction": "ltr",
    "word_count": 540,
    "total_pages": 0,
    "content": "<div><div class=\"field-item odd\">\n                    <p>Yesterday, 10 Cooper Union students locked themselves inside the top floor of the university&#x2019;s iconic Foundation Building. They occupied as part of a day of action against proposed tuition measures being brought by the college's administration. They are demanding the president step down, the board face accountability, and an end to all future tuition hikes. And they do it in a special context, because Cooper Union is an anomaly: it is one of the best universities in the country, a high-ranking accredited private college with no tuition costs whatsoever.</p>\n<p>Adminsitrators want that to end. They want to start charging tuition to cover the university&#x2019;s costs. But, according to the protesters, Cooper Union has mismanaged its funds, using their endowment for a huge new building, marketing and bloated administrative salaries (the president alone receives a yearly salary of $688,000), and the &#x201C;fiscal crisis&#x201D; caused by these administrators should not be paid for by students.</p>\n<p><img alt=\"Protesters support the occupiers and distribute information\" src=\"http://www.shareable.net/sites/default/files/resize/upload/inline/2778/images/ratprotest-480x360.jpg\" width=\"480\"></p>\n<p>At a time when student debt and tuition make up a market of over one trillion dollars, Cooper Union shows that education can be funded another way. Cooper Union offers degrees in art, architecture and engineering, and it frequently ranks in the top of the country for the quality of those programs, all without tuiton.</p>\n<p>The students who are occupying aren&#x2019;t actually fighting for their own interest: as part of the administration&#x2019;s tuition plan, all students currently enrolled will continue to receive full scholarship. The occupiers are fighting for the future of their school, and for future students to receive the opportunity they did.</p>\n<p>During the huge student strike last spring in Quebec, many people criticized the striking students by saying that Quebec already had the cheapest tuition in Canada, and so they should accept a price adjustment. But even a small hike can have disastrous consequences. For most of its history, the City University of New York (CUNY) system, made up of excellent public colleges distributed throughout the city, were completely or nearly free, meaning they educated many people who didn&#x2019;t have the means to go to a traditional college. In 1976, however, CUNY instituted a tuition plan, which, at the time, was affordable and relatively modest. Now, in-state tuition is $5,400 a year, pricing out many of the people CUNY once served. If you don&#x2019;t fight when the hikes are small, it becomes much harder to stop them from getting huge.</p>\n<p>And that is just what could happen at Cooper Union if the students lose. In a communique released by the occupiers yesterday, they wrote &#x201C;an anonymous source shared a report with us detailing the results of a committee convened to analyze the feasibility of implementing undergraduate tuition in the School of Engineering. The research concluded that within 10 years, students could face between $40,000 and $80,000 in tuition fees.&#x201D;</p>\n<p>As much as they continue to educate students, Universities have also become methods of funneling money, through indebted students, to university administrators and banks, all of it federally guaranteed and impossible to default on. Cooper Union has shown that an excellent education can instead be free, and the students who are fighting for that vision deserve our support. You can follow the occupiers on twitter at <a href=\"http://twitter.com/FreeCooperUnion\" target=\"_blank\">@FreeCooperUnion</a>, and read their demands and follow their website <a href=\"http://cusos.org\" target=\"_blank\">here.</a></p>\n        </div>\n        </div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.shareable.net/sites/default/files/resize/upload/inline/2778/images/ratprotest-480x360.jpg",
    "title": "Related Articles",
    "rendered_pages": 1
}