{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2013/05/video_cooper_occupy.php",
    "short_url": "http://rdd.me/ueoupaff",
    "author": "Sydney Brownstone",
    "excerpt": "Sydney BrownstoneA little before 11 a.m. this morning, more than 50 students took over Cooper Union president Jamshed Bharucha's office on the seventh floor of the school. Students say they're&hellip;",
    "direction": "ltr",
    "word_count": 334,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"><table class=\"image center\" border=\"0\" width=\"560\"><tr><td><img alt=\"cubanner.jpg\" src=\"http://blogs.villagevoice.com/runninscared/cubanner.jpg\" width=\"560\"></td></tr><tr><td class=\"credit\">Sydney Brownstone</td></tr></table></span>A little before 11 a.m. this morning, more than 50 students took over Cooper Union president Jamshed Bharucha's office on the seventh floor of the school. Students say they're holding <a href=\"https://www.facebook.com/FreeCooperUnion\" target=\"_blank\">a vote of no confidence</a> in Bharucha's leadership--and trying to gather as many signatures to the petition as possible. </p>\n\n<p>The action comes two weeks after the school's board of trustees announced that future students, including the incoming class of 2014, <a href=\"http://blogs.villagevoice.com/runninscared/2013/04/cooper_union_en.php\" target=\"_blank\">would be paying tuition</a> for an education that has been historically free. This isn't the students' first protest: In December of last year, 11 art students occupied the Peter Cooper Suite on the eighth floor for a week in protest of <a href=\"http://www.huffingtonpost.com/2012/12/10/cooper-union-occupation-ends_n_2271737.html\" target=\"_blank\">the proposed tuition hike</a>, fully barricading themselves in.</p>\n\n<p>Security wouldn't let press upstairs, but students did send down two representatives to meet me in the lobby--Angus Buchanan, a second year, and Aaron Graham, a senior.</p>\n\n<p>\"All the people upstairs and doing these sorts of actions to keep this school free--we're not fighting for ourselves. We're fighting for future students because we're all already guaranteed the scholarship we've been given,\" Graham said.</p>\n\n<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/LuunFJZSnYs\"></iframe>\n\n<p>Even with the black banners draped from windows on the building's fa&#xE7;ade, bystanders could easily mistake the protest for a school-supported art installation. No cops were present, and students were milling freely in and out of the building while the administration held talks with those carrying on the sit-in upstairs.</p>\n\n<p>\"This a peaceful and nonviolent action. Meetings are being held with students to discuss it further,\" said Claire McCarthy, director of public affairs. </p>\n\n<p>\"It's a little chaotic, we're waiting,\" said organizer and senior art student Victoria Sobel. \"We know they're going to come back and give us some sort of ultimatum.\"</p>\n\n<p>At least there's pizza. After students wrapped up an interview with <em>Democracy Now!</em>, alumna Kerry Carnahan sent the students several stacks of hot melty cheese. </p>\n\n<p>City College of New York students will join Cooper Union students to rally <a href=\"https://www.facebook.com/events/666580176701209/666637376695489/\" target=\"_blank\">today at 6 p.m. in Cooper Square</a>. Watch this space for updates. </p>\n\n<p>[<a href=\"https://twitter.com/sydbrownstone\">@sydbrownstone</a>][<a href=\"mailto:sbrownstone@villagevoice.com\">sbrownstone@villagevoice.com</a>]<br></p>                                                <article-signup type=\"email\" size=\"large\"></article-signup>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                </div>",
    "date_published": "2013-05-08 03:20:24",
    "dek": null,
    "lead_image_url": "http://blogs.villagevoice.com/runninscared/cubanner.jpg",
    "title": "VIDEO: Cooper Union Students Take Over President's Office, Hold Vote of No Confidence",
    "rendered_pages": 1
}