{
    "domain": "slavin.tumblr.com",
    "next_page_id": null,
    "url": "http://slavin.tumblr.com/post/50440757285/until-recently-my-parents-had-supported-the",
    "short_url": "http://rdd.me/wax2qlbj",
    "author": null,
    "excerpt": "\"Until recently [my parents] had supported the administration. This is no longer the case. I have their permission to share this, and cannot thank them enough for their love and support. I would not&hellip;",
    "direction": "ltr",
    "word_count": 1121,
    "total_pages": 0,
    "content": "<div><div class=\"description\"><blockquote>\n<p><em><strong>\"Until recently [my parents] had supported the administration.</strong> <strong>This is no longer the case.</strong> I have their permission to share this, and cannot thank them enough for their love and support. I would not be at Cooper, nor here in this moment without them. I know that their message resonates with Cooper students, alumni, faculty, and staff everywhere. Mark Epstein and Jamshed Bharucha cannot continue to ignore these countless voices that oppose their decisions and authority at the Cooper Union.&#x201D;</em></p>\n</blockquote>\n<p>&#x2014; Joe Riley, one of the Cooper Union students who has occupied the President&#x2019;s Office since Wednesday. For the record, I don&#x2019;t demand what they are demanding, and I&#x2019;ve worked a bit to help the Emergency Management Team to understand the situation. I also spent a bit of time with the students up there when I was in NYC. </p><p>The letter below is from Joe&#x2019;s parents to the head of the Board of Trustees Mark Epstein. It speaks with a very different type of voice than we&#x2019;ve heard up till now, and is worth paying attention to.</p>\n\n<p class=\"p1\"><em>Sent: May 13, 2013&#xA0;11:51 AM</em><br><em> Subject: RE: Voice Your Support: Petition Enclosed</em></p><p> Mr. Epstein,</p><p> We recently received an email from you with a &#x201C;petition&#x201D; attached, which you asked us to sign. Given recent events at the Cooper Union and what we have learned from reviewing information that has come to our attention, we feel compelled to respond as follows:</p><p> President Jamshed Bharucha&#x2019;s administration has completely mishandled the current situation with the students from the beginning. President Bharucha should not have threatened to dismiss these students or withhold their diplomas, but should have been offering to hire them instead. I have observed many hours of the live stream video from the President&#x2019;s office where anywhere from 30 to 100+ students are furiously typing on laptops, texting or talking on phones, communicating with the larger community and generating plans, websites, ideas and even artwork to move forward on the issues. </p><p> Why has Bharucha turned a blind eye to their dedication, their talent, their effectiveness and indeed their fundraising potential? Why has he not instead taken advantage of this tremendously powerful human resource to work toward truly effective alternative financial solutions? His plan to charge tuition, arrived at in closed-door meetings in sometimes undisclosed locations (which plan, clearly, does no more than put a band-aid on a deep gash) is akin to cutting off his nose despite his face. His total failure to acknowledge alternatives that students are willing to offer is foolhardy at best, and at worst, may ultimately lead to the downfall of the school from both a financial and public relations standpoint. In fact, given the energy, work ethic and passion of the students, had Bharucha worked with them instead of against them from the beginning, the school&#x2019;s financial woes could have been well on their way toward a sustainable solution by now. But instead of taking the role as a community builder, President Bharucha&#x2019;s conduct has been divisive at the very least.</p><p> If I were in Bharucha&#x2019;s shoes, the first thing I would do is walk into my office and listen to what this amazingly effective group of young people has to say. I would not go into hiding, refusing to leave my home and refusing to communicate with the main constituents on this issue - the students. I would put them to work for me to help raise significant funds, realizing that they have the interests of the school at heart and tremendous fundraising potential. President Bharucha should be true to his purported &#x201C;open door&#x201D; policy, and have the courage to walk through his own door. There are no more dedicated, passionate, smart and willing students on the planet than those who are currently waiting to see him in his own office. What is he so afraid of? As a leader of the Cooper community, Bharucha has behaved in a secretive, passive aggressive, and frankly cowardly, manner, and as such no longer has our support. </p><p> As for the Board of Trustees, you should be ashamed of themselves. We have carefully digested all the information that has been brought to light about the truth of the financial disaster which, granted, began years ago. Yet the current board has done nothing to stem the tide of fiscal irresponsibility; indeed you are complicit in it. You approved the decision to borrow many millions of dollars to build the new building with no idea how to pay for it, knowing already that the endowment was in serious trouble. Moreover, you have squandered millions of dollars in fees to hedge fund managers. At the same time, the very clear public relations message you disseminated was that the Cooper Union was in good financial health.</p><p> When our son Joe first started at Cooper Union we were sold a bill of goods &#x2013; repeatedly we were told at orientation meetings that Cooper&#x2019;s endowment was in excellent shape, and that they were so successful in managing their funds that they could afford to build a new fabulous building when most other schools around the country were struggling just to survive. There were even articles in the news media to that effect when construction was completed. But board members knew full well what the truth was. Nevertheless, you sent out the message to parents and the community at large that all was well. That is more than gross mismanagement. It is in fact misrepresentation, misuse of funds, and a failure of fiduciary duty. In light of all that, the &#x201C;petition&#x201D; we received from you, Mr. Epstein, and your request that we sign it, is appalling. So no, we will not sign it. Our support is with the students and faculty who have had the courage to stand up and challenge the assumptions, representations and conclusions of the board and this administration. These constituents are a force to be reckoned with, and they must have a voice on this issue. </p><p> We are not a wealthy family, and so we harbor no illusions that our views carry weight with you. Initially, much to our son Joe&#x2019;s chagrin, both the Board and President Bharucha had our support. But now we count ourselves among the thousands who have asked all of you to listen, and to change course. It is clear you are unwilling to do so. In our opinion therefore, you should all be summarily dismissed.</p>\n<p><span>Annetta and Bill Riley, parents of Joe Riley</span></p>\n<p><div class=\"messageBody\">&#x2014; <p>Last night, President Bharucha met with what looked like 100 or so students in his office and talked with them past 1AM. I missed most of it, so can&#x2019;t say what it adds up to. But students remain in the office and it&#x2019;s not obvious how the occupation will end.<br></p></div></p></div>\n\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n                \n\t\t\t\t</div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": null,
    "title": "Fresser.",
    "rendered_pages": 1
}