{
    "domain": "traditional-building.com",
    "next_page_id": null,
    "url": "http://traditional-building.com/clem_labine/",
    "short_url": "http://rdd.me/fiys6j3u",
    "author": null,
    "excerpt": "ORTHODOXY: Mainstream architectural critics, functioning as Modernism&#x2019;s religious police, heaped praise on this new engineering building by Thom Mayne, FAIA, for New York City&#x2019;s Cooper&hellip;",
    "direction": "ltr",
    "word_count": 1102,
    "total_pages": 0,
    "content": "<div><div class=\"content\">\n\t\t\t\t<div id=\"attachment_858\" class=\"wp-caption alignleft\"><img class=\"size-full wp-image-858\" title=\"CooperUnion\" src=\"http://traditional-building.com/clem_labine/wp-content/uploads/2012/12/CooperUnion.jpg\" alt=\"\" width=\"250\"><p class=\"wp-caption-text\">ORTHODOXY: Mainstream architectural critics, functioning as Modernism&#x2019;s religious police, heaped praise on this new engineering building by Thom Mayne, FAIA, for New York City&#x2019;s Cooper Union. &#x201C;Bold,&#x201D; &#x201C;extroverted,&#x201D; &#x201C;charismatic,&#x201D; and &#x201C;genuine civic value&#x201D; were some of the laudatory terms bestowed upon a building that creates a disruptive presence among its neighbors. (Photo: Stephanie Keith for the <em>Wall Street Journal</em>)</p></div>\n<p>Many of my traditionalist colleagues have always preached that it&#x2019;s counter-productive to attack Modernism.&#xA0; But it is increasingly apparent that this live-and-let-live attitude is not reciprocated.&#xA0; A recent event made it clear that much of what passes for architectural criticism these days is driven more by theology than by rational analysis. The majority of mainstream architectural critics are Modernists whose primary mission is to enforce Modernist orthodoxy.&#xA0; These critics are the Taliban of the architectural world.</p>\n<p>This became<a href=\"http://traditional-building.com/clem_labine/?p=838\"> blazingly obvious to me </a>after getting my initial look at the context-sensitive design proposed by <a href=\"http://www.ramsa.com/projects-search/cultural/museum-of-the-american-revolution.html\">Robert A.M. Stern Architects </a>for the new <a href=\"http://www.americanrevolutioncenter.org/\">Museum of the American Revolution</a> in Philadelphia.&#xA0;&#xA0;Because the new museum building is intended to be a good citizen and fit sensitively into its <a href=\"http://www.visitphilly.com/history/philadelphia/independence-hall/\">historic Philadelphia neighborhood, </a>I knew instantly that the architecture critics would hate Stern&#x2019;s design.&#xA0; Sure enough, the reviews were almost uniformly negative because <a href=\"http://www.artinfo.com/news/story/808903/robert-am-stern%E2%80%99s-conservative-museum-of-the-american-revolution-design-snuffs-the-revolutionary-spirit\">the design was not &#x201C;revolutionary.&#x201D;</a> The carping critics &#x2013; uniformly Modernists &#x2013; were evaluating the design not by thoughtful analysis of the building&#x2019;s role in its urban context, but rather by what amounts to a religious litmus test. If a design does not exude sufficient quantities of shock-and-awe, it fails to pass the Modernist test &#x2014; and thus is not worthy of the name Architecture (with the capital &#x201C;A&#x201D;).</p>\n<p>Modernists seized control of the architectural academies in the mid-twentieth century and converted them essentially into madrasas of Modernism &#x2013; a process that was documented in Malcolm Millais&#x2019;s book,<a href=\"http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Dstripbooks&amp;field-keywords=Malcolm+Millais\"> <em>Exploding the Myths of Modern Architecture.</em></a> The new architectural elite banned not only the Beaux-Arts curriculum, but also any references to over two millennia of architectural tradition. Soon, their acolytes issued forth into the world to spread the gospel of novelty.&#xA0; Some of those disciples advanced to the high ground of architectural criticism &#x2013; and from those lofty pulpits have ever since imposed the rules of Modernist architectural orthodoxy on an unwilling but helpless public. Architectural juries, commissions on public monuments, governmental bodies, corporate clients, cultural institutions and anyone else commissioning new public buildings&#xA0;are keenly aware of the media scorn that will be heaped upon them by the critics if they come up with the &#x201C;wrong answer.&#x201D;&#xA0;&#xA0; And the wrong answer is any design that contains a hint of traditional influence.&#xA0; Fear of ridicule is the powerful force that ensures conformity to the Modernist credo in the public realm.</p>\n<p>Interestingly, the one sector that has largely escaped this fundamentalist tyranny is residential architecture.&#xA0; Private clients overwhelmingly opt for traditional designs when commissioning homes for their own comfort and pleasure. Their private nature renders them immune from denunciation by the fundamentalist mullahs. Usually, only clients and architects hoping to have the <a href=\"http://archrecord.construction.com/residential/hotm/default.aspx\">&#x201C;House of the Month&#x201D; in <em>Architectural Record </em></a>opt for austere, hard-edged Modernism or some form of &#x201C;blobitecture.&#x201D;</p>\n<p><strong>Questions That Are Never Asked </strong><br>\nArchitecture is a public and social art.&#xA0; As such, it should have qualities that relate to the humans who interact with it.&#xA0; It seems reasonable to expect that when a new project is undergoing critical review, people would ask questions such as:&#xA0; Does this building . . .</p>\n<ul><li>provide a pleasing and healthy environment for its users?</li>\n<li>function efficiently and economically?</li>\n<li>enhance and harmonize with its surroundings?</li>\n<li>create a pleasant experience for passersby?</li>\n<li>demonstrate responsible use of the earth&#x2019;s resources?</li>\n</ul><p>Rarely are such questions asked.&#xA0; Rather, when a new building is being reviewed by mainstream architectural critics, the basic issue is: Does this design look totally <em>new</em>?&#xA0; Novelty is what critics celebrate; little attention is paid to how the structure relates to people and the community.&#xA0; The question of artistic beauty is never raised.&#xA0;&#xA0; The First Commandment of the Modernist Holy Book reads: It is forbidden that any building show a connection to architecture built prior to 1920.&#xA0; This prohibition against historical precedent and ornament is all that is left of the well-meaning combination of scientific and social justice principles that undergirded original Modernist architectural theory.</p>\n<div id=\"attachment_861\" class=\"wp-caption alignright\"><img class=\"size-full wp-image-861\" title=\"american revolution\" src=\"http://traditional-building.com/clem_labine/wp-content/uploads/2012/12/americanrevolution1.jpg\" alt=\"\" width=\"300\"><p class=\"wp-caption-text\">HERESY: The proposed design for Philadelphia&#x2019;s new Museum of the American Revolution in the city&#x2019;s historic core is quite context sensitive, intended to complement the traditional character of its surroundings. The proposal, by Robert A.M. Stern Architects, was roundly denounced by media critics because it was not &#x201C;revolutionary.&#x201D; (Image: Robert A.M. Stern Architects)</p></div>\n<p>Today, the idealistic social principles of Modernism have been long forgotten.&#xA0; All that remains is the worship of boundary-breaking design for its own sake &#x2013; and the abhorrence of any reference to historical styles. Any design that violates these edicts is blasphemy and is damned with the most devastating pronouncement a critic can deliver: &#x201C;historical pastiche!&#x201D;</p>\n<p>Ironically, it is Robert Stern himself who has had the greatest success in bridging this religious divide.&#xA0; He views Modernism &#x2013; and all the other subsequent &#x201C;-isms&#x201D; &#x2014; merely as part of one long architectural tradition and works with Modernism as a style, rather than as a repository of divinely revealed truths.&#xA0; When appropriate to the context, Stern has designed Modernist buildings that have drawn praise from the very same critics who slap the dreaded &#x201C;pastiche&#x201D; label on his traditionally influenced work.</p>\n<p><strong>Outlasting the Taliban</strong><br>\nAlas, not much can be done with today&#x2019;s architectural Taliban.&#xA0; They believe what they believe, and psychologists have shown conclusively that reason cannot dislodge firmly held beliefs. No amount of evidence and dialogue is likely to deter them from their mission to enforce Modernist dogma.</p>\n<p>Over the long term, our goal must be to reach young architects before their belief systems become deeply rooted. That was how the Modernists eventually gained control over the highest levels of the architectural establishment.&#xA0; Some progress is already being made. The Institute of Classical Architecture &amp; Art offers a wide and growing array of continuing-education programs in classical design through its New York City&#xA0;headquarters and 15 regional chapters.&#xA0; Yale University&#x2019;s School of Architecture, under Stern&#x2019;s direction, is now exposing its students to both sides of architecture&#x2019;s religious schism. And architecture schools such as Notre Dame and the University of Miami offer instruction in traditional design and urbanism.</p>\n<p>As individuals, we should also seize every opportunity to give lectures and teach classes as visiting faculty. Education is the most powerful weapon with which to counteract the strict fundamentalism preached by the architectural Taliban.&#xA0; It&#x2019;ll take years.&#xA0; But it can be done.</p>\n\t\t\t\t<p class=\"under\">\n\t\t\t\t\t<span class=\"author\"><a href=\"http://traditional-building.com/clem_labine/?author=1\" title=\"Posts by Admin\" rel=\"author\">Admin</a></span>\t\t\t\t\t<span class=\"categories\"><a href=\"http://traditional-building.com/clem_labine/?cat=1\" title=\"View all posts in Uncategorized\" rel=\"category\">Uncategorized</a></span>\t\t\t\t\t\t\t\t\t</p>\n\t\t\t\t\n\t\t\t</div>\n\t\t</div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://traditional-building.com/clem_labine/wp-content/uploads/2012/12/CooperUnion.jpg",
    "title": "The CIVITAS Chronicles",
    "rendered_pages": 1
}