{
    "domain": "hyperallergic.com",
    "next_page_id": null,
    "url": "http://hyperallergic.com/61424/student-occupiers-call-for-cooper-union-presidents-resignation/",
    "short_url": "http://rdd.me/sefa6lzd",
    "author": "Janelle Grace on December 4, 2012 Tweet 3",
    "excerpt": "Students Rachel Appel (right) and Audrey Snyder (center) speak to the press on behalf of the protesters occupying Cooper Union&#x2019;s Foundation Building (all photos by the author for&hellip;",
    "direction": "ltr",
    "word_count": 760,
    "total_pages": 0,
    "content": "<div><div class=\"format_text entry-content\"><div id=\"attachment_61427\" class=\"wp-caption alignleft\"><a href=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/students-speak.jpeg\"><img class=\"size-full wp-image-61427\" title=\"students speak\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/students-speak.jpeg\" alt=\"\" width=\"320\"></a><p class=\"wp-caption-text\">Students Rachel Appel (right) and Audrey Snyder (center) speak to the press on behalf of the protesters occupying Cooper Union&#x2019;s Foundation Building (all photos by the author for Hyperallergic).</p></div><p>Students for a Free Cooper Union held a press conference this afternoon, addressing a set of frequently asked questions regarding their occupation of the college&#x2019;s Foundation Building. Undergraduate art students Rachel Appel and Audrey Snyder served as spokespeople for the 11 students occupying the building&#x2019;s clock tower and read a prepared statement to a crowd of about 100 press, students, faculty, and other staff and community members.</p><p>Their speech was highly critical of President Jamshed&#xA0;Bharucha, stating that Bharucha is incapable of the upholding the responsibility of defending and maintaining free tuition and reiterating their demand that he resign. They cited his &#x201C;expansionist and tuition-based&#x201C; tactics as contradictory to the school&#x2019;s mission, and that he has &#x201C;ignored the community&#x2019;s call for accountability.&#x201D;</p><p>Appel and Snyder went on to say that the administration &#x201C;has placed an emphasis on profitability over quality,&#x201D; and that free tuition for undergrads is likely to be done away with quickly should they move forward with charging for graduate studies. As evidence for this, the students cited <a href=\"http://www.pdf-archive.com/2012/12/04/summary/\">a document</a> leaked by an anonymous faculty member that discusses plans for charging tuition in greater detail than previously announced.</p><p>They also stated that they have received support from faculty as well as from groups like Strike Debt. Early on, Appel and Snyder mentioned that administration has issued a formal statement asking the protesters to leave the room. &#x201C;Apparently they have been threatened with arrest,&#x201D; Appel said at a later point in the conference.</p><div id=\"attachment_61425\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-61425 \" title=\"Faculty speak\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/Faculty-speak.jpeg\" alt=\"\" width=\"640\"><p class=\"wp-caption-text\">Day Gleeson and other faculty speak out in support of the school&#x2019;s mission.</p></div><p>After the initial statements made by Appel and Snyder, Day Gleeson, professor in the School of Art, spoke at the podium, flanked by several other faculty members. She said that there had recently been a meeting with faculty from across all three schools within Cooper to discuss the college&#x2019;s financial concerns. She then read a letter, signed by an undisclosed number of faculty, out to the crowd, explicitly stating the undersigned faculty&#x2019;s support of the current mission statement, as it is written in the current academic catalogue.</p><p>After the press conference had ended, New School staff member Annie Shaw introduced herself and called a mic check up to the students in the clock tower, asking &#x201C;Are students going to reach out to the workers who make this free environment [possible] and share the same grievances as you?&#x201D; The protester&#x2019;s unified response was an unqualified &#x201C;Yes.&#x201D;</p><p>I spoke with Shaw afterwards, who elaborated on her question to the students. She said that &#x201C;[a free education] wouldn&#x2019;t be fair if it means exploiting workers,&#x201D; that there shouldn&#x2019;t be a choice between one or the other. &#x201C;If we demand free education for [ourselves], we need to demand free education for all.&#x201D;</p><p>She further clarified her statement, saying, &#x201C;More direct conversations need to occur between students and administrative staff regarding these issues, that we can&#x2019;t use free education to exploit workers, faculty, staff, and administration.&#x201D;</p><p>A Cooper Union staff member I spoke with, who wishes to remain anonymous, echoed many of Shaw&#x2019;s concerns. She expressed concern that the exorbitant cost of tuition often entails a low-paid work force that is expected to take on a greater work-load without more compensation. This staff member said she would like to see a &#x201C;broader critique of the neo-liberal approach to higher education that is common across the country,&#x201D; and the creation of a &#x201C;united front instead of several competing issues.&#x201D; She and Shaw both said that these labor issues are &#x201C;typical&#x201D; and &#x201C;prevalent&#x201D; at institutions across the nation, and not unique to Cooper.</p><p><img class=\"size-full wp-image-61428 aligncenter\" title=\"Foundation Building 2\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/Foundation-Building-2.jpeg\" alt=\"\" width=\"640\"></p><p>Later this afternoon, Cooper Union posted <a href=\"http://cooper.edu/about/news/president-bharuchas-memo-student-blockade\">a press release</a> from President Bharucha on their website, stating that &#x201C;Our priority is the safety of our students and to insure that the actions of a few do not disrupt classes for all.&#x201D; The release goes on to state that the administration&#x2019;s approach &#x201C;will continue to be one of discourse &#x2014; engaging in a dialog with the students.&#x201D;</p><p>Cooper Union officials have not yet responded to our requests for information. The <em>Wall Street Journal</em>&#x2019;s <a href=\"http://blogs.wsj.com/metropolis/2012/12/04/students-barricaded-in-cooper-union-livestream-protest/\">Metropolis blog</a> reports the following:</p><blockquote><p>&#x201C;A college spokeswoman said the president has held meetings with other students this morning, and a new &#x201C;financially sustainable plan is critical to the institution&#x2019;s survival.&#x201D;</p><p>&#x201C;The 11 art students who have locked themselves in the Peter Cooper Suite do not reflect the views of a student population of approximately 1,000 architects, artists and engineers,&#x201D; spokeswoman Jolene Travis said in an e-mailed statement.&#x201D;</p></blockquote><p id=\"jp-relatedposts\" class=\"jp-relatedposts\"><h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3></p><p class=\"post_tags\">Tagged as: <a href=\"http://hyperallergic.com/tag/cooper-union/\" rel=\"tag nofollow\">Cooper Union</a>, <a href=\"http://hyperallergic.com/tag/education/\" rel=\"tag nofollow\">education</a>, <a href=\"http://hyperallergic.com/tag/protests/\" rel=\"tag nofollow\">protests</a></p></div></div>",
    "date_published": "2012-12-05 04:10:07",
    "dek": null,
    "lead_image_url": "http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/Faculty-speak.jpeg",
    "title": "Student Occupiers Call for Cooper Union President’s Resignation",
    "rendered_pages": 1
}