{
    "domain": "www.fastcoexist.com",
    "next_page_id": null,
    "url": "http://www.fastcoexist.com/1682073/tricky-activists-protest-the-corporatization-of-education-with-a-brilliant-fake-site",
    "short_url": "http://rdd.me/jdurijrp",
    "author": null,
    "excerpt": "After the prestigious New York art-school Cooper Union decided last month to charge its students tuition for the first time in 111 years, students have taken to Occupy-style tactics to protest the&hellip;",
    "direction": "ltr",
    "word_count": 281,
    "total_pages": 0,
    "content": "<div><header>                    \n                        \n            \n        </header><div class=\"content \">\n          <p>After the prestigious New York art-school Cooper Union decided last month to charge its students tuition for the first time in 111 years, students have taken to Occupy-style tactics to protest the change, <a href=\"http://blogs.villagevoice.com/runninscared/2013/05/bharucha_talks_to_occupiers.php\" target=\"_blank\">taking over</a> the president&#x2019;s office for a full week.</p>\n\n<p>And while the issue is quite serious--students wept at the news that the soul of their school is in jeopardy--a new piece of media activism takes a tone that&#x2019;s wryly comical.</p>\n\n<figure class=\"inline-large inline\"><img src=\"http://www.fastcoexist.com/multisite_files/coexist/imagecache/inline-large/inline/2013/05/1682073-inline-inline-cooper-union-fake-website.jpg\" alt=\"\"></figure><p>&#x201C;Welcome to the NEW Cooper Union,&#x201D; reads the headline of the faux website <a href=\"http://cooperunion.biz/\" target=\"_blank\">CooperUnion.Biz</a>, which comes up in Google results when you search for the school&#x2019;s name and presents a sardonic vision of the institution&#x2019;s future as it adopts a more economic mindset.</p>\n\n<aside class=\"note editors-note \"></aside><p>Changes at the school include such innovations as the \"Home Depot School of Architecture,\" Donald Trump as chairman of the board of trustees, and money-making satellite campuses in Beijing and Dubai. Campus events include an art auction in the school&#x2019;s great hall, while <em>Fast and the Furious</em> plays in its screening rooms. Applying is as simple as entering credit card details. It&#x2019;s the corporatization of academia at its most extreme, with the accompanying dilution of the quality of an education, values, and standards.</p>\n\n<p>This isn&#x2019;t the first time student activists have used fake websites to decry Cooper Union&#x2019;s dire economic situation. Last year, a student graphic designer created a successful media hoax when his fake website and press release announcing that Cooper Union would rent out its new $177 million dollar academic building to NYU <a href=\"http://gothamist.com/2012/04/16/shocker_cash-strapped_cooper_union.php\" target=\"_blank\">got picked up</a> by blogs. The glamorous building is viewed by many as an icon of the school&#x2019;s economic mismanagement, of which future students will be forced to bare the brunt.</p>        </div>\n\n        </div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.fastcoexist.com/multisite_files/coexist/imagecache/inline-large/inline/2013/05/1682073-inline-inline-cooper-union-fake-website.jpg",
    "title": "Tricky Activists Protest The Corporatization Of Education With A Brilliant Fake Site",
    "rendered_pages": 1
}