{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2013/05/cooper_commencement_mic_check.php",
    "short_url": "http://rdd.me/85h1pwjf",
    "author": "Sydney Brownstone",
    "excerpt": "Livestream/thecooperunion1Mayor Bloomberg's commencement speech at the Cooper Union on Wednesday came in the midst of an ongoing occupation of the president's office, and just a day after students&hellip;",
    "direction": "ltr",
    "word_count": 514,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"><table class=\"image right\" border=\"0\" width=\"240\"><tr><td><img alt=\"sprang.jpg\" src=\"http://blogs.villagevoice.com/runninscared/sprang.jpg\" width=\"240\"></td></tr><tr><td class=\"credit\">Livestream/thecooperunion1</td></tr></table></span>Mayor Bloomberg's commencement speech at the Cooper Union on Wednesday came in the midst of an ongoing occupation of the president's office, and just a day after students launched a guerrilla art show on the seventh floor in honor of their mission. The confrontation could have been nasty--after all, it was Bloomberg, villain of the Zuccotti Park eviction of 2011--but graduating students largely kept their efforts honed in on president Jamshed Bharucha, who faced a horizon of red protest squares pinned to black gowns, including some faculty's.</p>\n\n<p>Still, the event was not without some vocal protest.<br></p>\n<a name=\"more\"></a>\n<p>Before Mayor Bloomberg could give a speech peppered with anecdotes about his own scholarship at Johns Hopkins (and a first job counting securities in his underwear in an un-air-conditioned cage on Wall Street), and before a group of students turned their backs to Dr. Bharucha as he spoke, student commencement speaker James A. Sprang took the stage to deliver a message about hope. </p>\n\n<p>\"Your doubts may bring thoughts of the thousands of the minority and undocumented persons that will no longer have the opportunity to enjoy the free education we have received,\" Sprang said, referring to the school's decision to charge tuition after more than a century of keeping the Cooper Union free.</p>\n\n<p>He continued: \"It is not a stretch by any imagination to say that we doubt because we hope. I'm not asking by any means to dismiss the aforementioned, rather I'm asking us to accept our doubts for what they truly are.\"</p>\n\n<p>Sprang went on to describe the mission of the school as something unconfined by the structure of the institution itself--and towards the end of his speech asked that the graduating class stand. \"Let us speak for those who cannot, for those who will not, and for those who have now lost the ability to do so. Mic check!\" </p>\n\n<p>Roughly ten feet in front of the seated mayor, Sprang then led the Cooper Union class of 2013 with the crowd amplification tool popularized by Occupy Wall Street.</p>\n\n<p>Contrary to the mayor's later speech, which largely dealt with owing a debt to Peter Cooper and to the school (though Bloomberg professed he would not take sides in the tuition debate), here's what the Cooper graduates repeated back to Bloomberg, to parents, faculty, and students in the Great Hall:</p>\n\n<blockquote>Hope--hope is everything. A fresh way to approach a dull or dangerous thing. To do a dull thing with hope will never be preferable to doing a dangerous thing with hope. To do a dangerous thing with hope is what I call art. Hope is a way of doing, a way of being done.\n</blockquote>\nSprang's speech ended on the idea that Cooper Union students were responsible for creating hope unhindered. Bloomie's concept of debt, even a social one, may be an easier idea to understand than a responsibility to create freely, but it also reflects a major gap--much larger than 10 feet--in how the mayor saw the school's mission, and how the students graduating choose to seize it.\n\n<p><em><br>\nSend your story tips to <a href=\"mailto:sbrownstone@villagevoice.com\">sbrownstone@villagevoice.com</a>. Follow her on Twitter <a href=\"https://twitter.com/sydbrownstone\" target=\"_blank\">here</a>.</em></p>                                                <article-signup type=\"email\" size=\"large\"></article-signup>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                </div>",
    "date_published": "2013-05-30 10:20:39",
    "dek": null,
    "lead_image_url": "http://blogs.villagevoice.com/runninscared/sprang.jpg",
    "title": "Cooper Union Speaker James Sprang Mic-Checked Commencement in Front of Mayor Bloomberg",
    "rendered_pages": 1
}