{
    "domain": "www.wsws.org",
    "next_page_id": null,
    "url": "http://www.wsws.org/en/articles/2013/05/13/coop-m13.html",
    "short_url": "http://rdd.me/nkvtmehq",
    "author": null,
    "excerpt": "A student sit-in at the college president&#x2019;s office began last week to protest last month&#x2019;s decision by the Cooper Union Board of Trustees to put an end to the policy of free tuition for&hellip;",
    "direction": "ltr",
    "word_count": 1077,
    "total_pages": 0,
    "content": "<div><div id=\"content\">\n      \n\n  \n  \n  \n  \n  \n\n\n  \n      \n      \n        \n        \n      \n      \n      \n      \n      \n      \n  \n  \n  <p>A student sit-in at the college president&#x2019;s office began last week to protest last month&#x2019;s decision by the Cooper Union Board of Trustees to put an end to the policy of free tuition for undergraduates that has existed at the New York City school for more than a century.</p>\n<p>The decision was announced by Board of Trustees chairman Mark Epstein on April 23, and will take effect with the incoming freshman class in the school of architecture, art and engineering in the fall of 2014. It is the culmination of a two-year process in which the board examined the issue of ending the tradition of free education at the school, which has been closely associated with its record of excellence as well as opportunity for generations of young people.</p>\n<p>Last year tuition was imposed for graduate students. The board, along with CU President Jamshed Bharucha, also hired a consulting firm to advise them on assessing tuition on the 1,000 undergraduates.</p>\n<p>Peter Cooper founded The Cooper Unvion for the Advancement of Science and Art in 1859 in lower Manhattan. A year later Abraham Lincoln made his famous speech in the Great Hall, an event that brought him national attention and was soon followed by his nomination for president by the Republican Party on an anti-slavery platform.</p>\n              <div class=\"imageFull\">\n                  <img src=\"http://www.wsws.org/asset/d4e02ba4-baac-4cfc-9d50-f69226fa947G/cooper.jpg?rendition=image480\"><span>Supporters listening at press conference</span>\n              </div>\n\n<p>Cooper was an industrialist and an abolitionist who believed in low-cost education. Tuition was relatively low for the first several decades, and free tuition, in line with Cooper&#x2019;s insistence that higher education should be as &#x201C;free as the air and the water,&#x201D; was established in 1902.</p>\n<p>Reports indicate that the school&#x2019;s endowment, which today stands at $666.7 million, took a 14 percent hit in the fiscal year that ended on June 30, 2009. While it didn&#x2019;t drop as much as the stock market in that year, it didn&#x2019;t recover as much as the stock market has subsequently. A recent article in the <em>New York Times</em> connected this to the school&#x2019;s heavy investment in hedge funds, which take a 2 percent administration fee and 20 percent of the profits for each investor.</p>\n<p>The school borrowed heavily before the 2008 crash to build a new engineering facility.</p>\n<p>The <em>Times</em> reports the banks have refused to allow Cooper Union to refinance that loan at a lower interest rate despite the fact the prime rate that the Fed lends to the biggest banks is now at almost zero.</p>\n<p>Overall, banking, real estate, and hedge fund interests have a dominant say on the fate of and future of higher education in the US. The consensus within the ruling elite is clearly that Cooper Union&#x2019;s policy of free tuition is an anachronism, a throwback to an earlier time that is simply unacceptable today.</p>\n<p>Although some have claimed that wealthy alumni and others could solve Cooper Union&#x2019;s financial problems with philanthropic contributions that would represent nothing more than pocket change for them, the fact is that for the entire political and corporate establishment, led in the area of education policy by billionaires like Eli Broad and Bill Gates, the last thing they want is to encourage the idea that higher education is a right and should be made available to all regardless of ability to pay.</p>\n<p>Students and faculty at the Cooper Union are understandably outraged by the decision to eliminate free tuition. On Wednesday May 8, students, mainly from the Cooper Union art school, began an occupation of President Bharucha&#x2019;s office, demanding that he resign.</p>\n<p>Asher Mones, a second year art student, told the WSWS, &#x201C;I&#x2019;ve been here since we came Wednesday morning at 11:00 AM. Thirty-nine students entered the President&#x2019;s office through this door. We sat on the floor, and said anyone was free to leave. This was addressed to the administrators who came into the room. There were secretaries who were recovering documents from the president&#x2019;s desk and around the office space. Later on in the day they took a file cabinet out. His computer was retrieved also.</p>\n<p>&#x201C;We are in favor of transparency. This is why we have a live stream video going and make our statements on Facebook publicly because everything the administration has done has been without our participation and behind our backs.</p>\n<p>&#x201C;No one is being held against their will. It is a non-violent action. Our purpose is to get the president to step down. Soon after we arrived, we put a document on his desk, which is a petition for him to resign. The last time I checked there were over 300 signatures on the petition here, and there is an on-line petition where we have over 1,000 signatures.</p>\n<p>&#x201C;About 120 students from the school of engineering marched to City Hall on Tuesday. The faculty of the Art School has passed a vote of no confidence in Bharucha, and we are hoping the faculty of the other two schools&#x2014;Architecture and Engineering&#x2014;will take no confidence votes as well.</p>\n<p>&#x201C;Twenty-four members of the Art School faculty have signed the petition. This is finals week, but the institution is more important than finals now. This seems like a heist of the institution.&#x201D;</p>\n<p>Brandon Ndlife is an art student at Cooper Union, who will be graduating this year said, &#x201C;The administration made their decision for tuition but obviously the sit-in is in opposition to it. The conflict is a reflection of the general situation in the country, although it is more complex and unique.</p>\n<p>&#x201C;The money for supporting the school comes generally from rent from the land under the Chrysler Building. We, and I as a student who will be graduated this year, are not only fighting for our school but for those who come later. Transparency is the thing; the decisions should involve all of us.&#x201D;</p>\n<p>At a press conference Friday night that preceded a march of about 100 students, faculty and supporters on the president&#x2019;s house, a student who had been part of the occupation said a private security force had been sent into the Foundation Building to watch and guard them. They bolted shut the bathroom and turned off the water supply on the seventh floor where the president&#x2019;s office is located.</p>\n<p>On May 9 students threatened with unstated disciplinary action if they didn&#x2019;t leave. They were given a 7:30 PM deadline to get out of the building. The New York City Police Department (NYPD) came onto the premises. The administration later postponed, at least temporarily, the threat to eject the students, and asked the NYPD to leave.</p>\n  \n\n\n\n\n\n\n\n\n    </div>\n    \n  </div>",
    "date_published": "2013-05-13 00:00:00",
    "dek": null,
    "lead_image_url": "http://www.wsws.org/asset/d4e02ba4-baac-4cfc-9d50-f69226fa947G/cooper.jpg?rendition=image480",
    "title": "World Socialist Web Site",
    "rendered_pages": 1
}