{
    "domain": "www.huffingtonpost.com",
    "next_page_id": null,
    "url": "http://www.huffingtonpost.com/2012/12/05/cooper-union-tuition-protest_n_2240768.html",
    "short_url": "http://rdd.me/zwp2oauu",
    "author": "Tyler Kingkade",
    "excerpt": "NEW YORK -- Eleven students at Cooper Union who have been barricaded in the school's Foundation Building since Monday afternoon to protest the school's tuition plan received additional support from&hellip;",
    "direction": "ltr",
    "word_count": 1075,
    "total_pages": 0,
    "content": "<div class=\"articleBody\" score=\"22.5\">\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                                    \n\t\t\t\t\t\t\t\t\t<p>NEW YORK -- Eleven students at Cooper Union who have been barricaded in the school's Foundation Building since Monday afternoon to protest the school's tuition plan received additional support from faculty members, while the administration has avoided direct communication with the student protesters.</p>\n\n<p>Day Gleeson, an associate professor and academic adviser, spoke alongside several faculty members in front of the Foundation Building in support of the demonstrating students. Gleeson said a group of faculty had met to sign a statement declaring the faculty \"unreservedly supports [Cooper Union's] mission statement,\" which refers to full scholarships for all enrolled students. The letter of support had more than 50 signatories as of this writing, and Gleeson suggested more were adding their names.</p>\n\n<p>Another group of 25 freshmen at Cooper Union held a mini-occupation overnight Monday, camping out on a lower level of the Foundation Building, and were told they had to leave or risk arrest. On Wednesday morning, a group of about 30 students gathered just outside of the school's Board of Trustees' meeting to protest tuition implementation, and a few were able to enter the room.</p>\n\n<p>Throughout the school's 110 year history, since 1902, it has not charged tuition. That changed in April, when the administration announced <a href=\"http://www.nytimes.com/2012/04/25/nyregion/cooper-union-will-charge-tuition-for-graduate-students.html\" target=\"_hplink\">that it will begin charging graduate students</a>, and a <a href=\"http://www.pdf-archive.com/2012/12/04/summary/\" target=\"_hplink\">document</a> leaked to the occupiers shows <a href=\"http://www.huffingtonpost.com/2012/12/04/cooper-union-tuition-protests_n_2236936.html?1354638273\" target=\"_hplink\">undergraduate tuition for certain programs</a> is under consideration. According to Cooper Union, although every student is covered by full scholarships, tuition is currently valued at $38,550.</p>\n\n<p>For FY 2011, Cooper Union reported on its <a href=\"http://big.assets.huffingtonpost.com/2011-135562985-0852933d-9.pdf\" target=\"_hplink\">990 IRS form</a> a $17 million deficit, which a<a href=\"http://cooper.edu/sites/default/files/uploads/assets/site/files/RTF-FINAL-REPORT.pdf\" target=\"_hplink\"> task force report</a> attributed in part to the global financial crisis' impact on its investment funds. Revenue to the endowment also fell short of projections over 10 years by approximately $53 million. Around the same time, the school <a href=\"http://archrecord.construction.com/projects/bts/archives/universities/11_Cooper/default.asp\" target=\"_hplink\">spent $166 million on a new academic building </a>in 2006, which was completed in 2009. Cooper has invested $32 million of its money in its endowment hoping to earn a higher rate of return. </p>\n\n<p>\"Tuition is the end of Cooper and there are sustainable ways to avoid it,\" said Audrey Snyder, a senior in the School of Art at Cooper. Any graduate program, she said, could be expanded to generate revenue to support undergraduates. But, she said, since the Cooper Union only has a small handful of buildings in lower Manhattan, they have \"no means or space to serve such programs\" and could hardly accommodate the lab research associated with graduate-level education.</p>\n\n<p>Charging tuition for masters programs, according to the <a href=\"http://cooper.edu/sites/default/files/uploads/assets/site/files/RTF-FINAL-REPORT.pdf\" target=\"_hplink\">Revenue Task Force report</a>, will bring the school millions of dollars, but it doesn't address where the students will study. Students believe any implementation of tuition at a traditionally tuition-free school is the first step on a slippery slope that will remake the institution.</p>\n\n\t<p>\"Any tuition-based program will require space and resources that Cooper Union does not have,\" said Joe Riley, one of the occupying students. \"As such, the revenue-generating graduate programs will seriously encroach on the resources of the current, tuition-free undergraduate program and will require expansion of the institution -- falling into the same business model that large, expensive universities follow.\"</p>\n\n<p>Every current student has already secured their scholarships, said Rachel Appel, senior in the School of Art, so they won't be affected -- only future Cooper Union students would. But they believe the school's administration is not being adequately transparent about what changes might be implemented.</p>\n\n<p>\"It took [11] students occupying a room upstairs for a faculty member to leak a document to us,\" Appel said, which <a href=\"http://www.pdf-archive.com/2012/12/04/summary/\" target=\"_hplink\">revealed that the administration</a> is considering undergraduate tuition. </p>\n\n<p>In a statement from Jolene Travis, Assistant Director of Public Affairs at Cooper, the school insists that it is \"fully engaged in an open process\" to get its finances in order. President Jamshed Bharucha held informal meetings with students on campus Tuesday morning, and T.C. Westcott, vice president of finance, is in contact with the students' designated spokesperson. However, the school doesn't appear to be ready to give in to the occupiers' demands any time soon.</p>\n\n<p>\"The 11 art students who have locked themselves in the Peter Cooper Suite do not reflect the views of a student population of approximately 1,000 architects, artists and engineers,\" Travis said.</p>\n\n<p>The occupying students said they haven't received any direct or formal communication from Bharucha, and the informal meetings, they suggest, were with students who approached him when they saw him on campus.</p>\n\n<p>Cooper's administration has requested the students leave, but has not given them a deadline to do so. Students working from outside the barricaded room told HuffPost that there isn't a way for anyone to get in, so it's unlikely that anyone will join the occupation. They also said the students barricaded in the building have access to a bathroom, as well as food and water.</p>\n\n<p>The demonstration has the look and feel of other Occupy Wall Street gatherings: using \"mic checks\" to make announcements, creating signs to announce their grievances and slogans, and on Monday, they held a series of teach-ins. The protest beyond the barricaded room was aided by unusually warm weather in New York on Monday and Tuesday, attracting dozens of Cooper and New School students, as well as other spectators.</p>\n\n<p>The student activists want a student representative to the Board of Trustees, and for the board to hold meetings that are open to the public, like many public university governing boards do. When pressed by HuffPost, Travis and other officials would not respond as to whether they are open to these ideas.</p>\n\n<div id=\"hp-slideshow-wrapper-267701\" class=\"hp-slideshow-wrapper-loading\" score=\"9.5\">\n\t<div class=\"hp-slideshow-wrapper-loading-div\"><em>Loading Slideshow</em><img src=\"http://www.huffingtonpost.com/images/ajax-loader.gif\" alt=\"...\"></div>\n\t<ul class=\"hp-slideshow\" id=\"hp-slideshow-267701\"><li><h4>Written On The West Side Of The Foundation Building</h4></li><li><h4>Outside The Foundation Building</h4></li><li><h4>Banners Draped From The Cooper Union Foundation Building</h4></li><li><h4>Outside the Foundation Building</h4></li><li><h4>Press Conference Outside The Foundation Building</h4><p>Audrey Synder (left) and Rachel Appel speak at a podium Tuesday afternoon.</p></li><li><h4>Press Conference Outside The Foundation Building</h4><p>Audrey Synder (left) and Rachel Appel speak at a podium Tuesday afternoon.</p></li><li><h4>Press Conference Outside The Foundation Building</h4><p>Audrey Synder (left) and Rachel Appel speak at a podium Tuesday afternoon.</p></li><li><h4>Tenured Faculty At The Press Conference</h4><p>Day Gleeson, a professor at the school of art at Cooper Union, speaks alongside other faculty members in support of the protesting students.</p></li><li><h4>Occupiers From The 8th Floor</h4><p>Students wave down on Tuesday afternoon.</p></li><li><h4>An Occupier From The 8th Floor</h4><p>A student occupying the 8th floor of the Cooper Union Foundation Building pops his head out.</p></li><li><h4>25 Freshmen Joined In</h4><p>From the Free Cooper Union Facebook: \"VERY inspiring freshman occupation going on down below us in the Foundation Building! #solidarity\"</p></li></ul>\n\t\n</div>\n\n<p class=\"video_box_title\">Related on HuffPost:</p>\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t",
    "date_published": "2012-12-05 12:12:15",
    "dek": null,
    "lead_image_url": "http://i.huffpost.com/gen/890012/thumbs/o-COOPER-UNION-TUITION-PROTEST-facebook.jpg",
    "title": "Cooper Union Occupation Gains Momentum As Administration Stays Quiet (PHOTOS)",
    "rendered_pages": 1
}