{
    "domain": "www.dnainfo.com",
    "next_page_id": null,
    "url": "http://www.dnainfo.com/new-york/20121207/east-village/cooper-union-students-hold-live-in-protest-for-free-education",
    "short_url": "http://rdd.me/dnjtdg0r",
    "author": "Serena Solomon",
    "excerpt": "EAST VILLAGE &#x2014; A small group of students from the Cooper Union who barricaded themselves inside the college this week to protest a plan to charge tuition at the traditionally free school took&hellip;",
    "direction": "ltr",
    "word_count": 721,
    "total_pages": 0,
    "content": "<div><div class=\"story_area two_column_left\">\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\n\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t<p>EAST VILLAGE &#x2014; A small group of students from the Cooper Union who barricaded themselves inside the college this week to protest a plan to charge tuition at the traditionally free school took their \"live-in\" into a fourth day Thursday.</p>\n<p>On Monday, 11 students from the cash-strapped Cooper Union locked themselves, their supplies and sleeping bags in the clocktower of the school's Foundation Building on Cooper Square,&#xA0;vowing to remain there until students are guaranteed that their free education will continue.</p>\n<p>The protesters, along with other student organizers not staying in the clock tower, are demanding that the college continue to offer full scholarships to all its students, which it has done since for more than a century.</p>\n<p>\"We are just up here creating this storm to save free education,\" said live-in protestor Casey Gollan, a 21-year-old senior in the Cooper Union's the School of Art.</p>\n<p>\"It [free education] has almost vanished in the U.S., and Cooper is one of the last holdouts,\" he added.</p>\n<p>The school, which offers art, architecture and engineering degrees for both graduate and undergraduate students, was founded by Peter Cooper in 1859 with the mission of \"free education for all,\" according to its <a href=\"http://cooper.edu/about/history\">website.</a></p>\n<p>Before 1902, when a large endowment was received, students who could afford to pay did, according to Cooper Union's press office. However, after 1902 all students were admitted with a full scolarship, which is currently valued at $38,550, according to a statement from the school.</p>\n<p>However, shortly after the school appointed Jamshed Bharucha as its 12th president in July 2011, he stated that&#xA0;charging students had become an option due to the recent economic downturn.</p>\n<p>\"It made us think, 'Why haven't we been more involved in shepherding [a free education],'\" Gollan said. \"This has always been a great thing that has always existed.\"</p>\n<p>The student group, going by the name <a href=\"http://www.cusos.org/students-for-a-free-cooper-union-lock-in-to-cooper-unions-foundation-building-to-preserve-free-education-2/\">Students for a Free Cooper Union</a>, have both the clock tower faction and those on the ground who are liaising with the administration, as well as organizing their own activism.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\n\t\t\n\t\t\t\t\t\t\t\t\t\n\n\n\n\n<div class=\"slot_panel_2_aug2012\">\n\n\t\t\n\t\t\t\n\t\t\n\n\t  \t\t<a class=\"bottom_link new_flag\">\n\t\t\t<img src=\"http://cloud.dnainfo.com/static/set/default/img/common/play_video.png\"></a>\t\t\t\n\t\t\t\t\n\t\n\t\t\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t<a>\n\t\t\t\t\t\t\t\t\t\t<img src=\"http://assets.dnainfo.com/generated/video/2012/12/cooper-union-protest-1354840832.mp4/image240x180.jpg\" width=\"240\"><img class=\"video_arrow\" src=\"http://cloud.dnainfo.com/static/set/default/img/story/video_play.png\"></a>\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\n\t\t</div>\n\t\t\n\t\t\n\t\n</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\n<p>On Wednesday, the ground team <a href=\"http://eastvillage.thelocal.nytimes.com/2012/12/05/students-disrupt-cooper-union-board-meeting-with-sobs-songs-plus-more-balloons/\">reportedly stormed a trustee meeting and interrupted it by weeping in front of members</a>, an action that was live-streamed to those in the clock tower.</p>\n<p>\"It felt like they were there with us,\" said Rachel Appel, a 23-year-old art student and protestor on the ground.</p>\n<p>So far the school has remained mostly silent on the issue, even with increased media coverage of the protest, including a four-minute segment on <a href=\"http://www.msnbc.msn.com/id/26315908/#50096340\">Rachel Maddow's MSNBC show Wednesday night.</a></p>\n<p>\"The eleven art students who have locked themselves in the Peter Cooper Suite do not reflect the views of a student population of approximately 1,000 architects, artists and engineers,\" the school said in its only statement so far on the protests.</p>\n<p>The statement also defended the transparency of the school's president. Protestors have listed Bharucha's dismissal as one of their demands, as well an increased involvement from the student body in the administration&#x2019;s decisions.</p>\n<p>The school has not yet involved the police, but has been speaking with law enforcement officials on the matter, said lawyer Wylie Stecklow, who is representing the protestors pro-bono.&#xA0;</p>\n<p>He said because police have not been called in, the student occupation is not yet illegal. But depending on the Cooper Union's ongoing response to the \"live-in,\" protestors could eventually face a trespassing charge, he said.</p>\n<p>\"The worst fear is that the students could be expelled, and most of these students are seniors, and that would be a grave concern,\" Stecklow said.&#xA0;</p>\n<p>For the protesters in the clock tower, Gollan said they had supplies to last \"a long time\" behind barricade made from wood and steel.</p>\n<p>\"I just washed by hair this morning in the basin,\" he explained.</p>\n<p>The 11 have been eating sandwiches, pasta and cans of beans, as well as pizza purchased by school alumni that was hoisted up the building's outside by a pulley system installed by the students, Gollan said.</p>\n<p>Armed with their laptops, a video tour of the protestors' living quarters shows them hard at work coordinating efforts against the Cooper Union administration.</p>\n<p>\"We are organizing a student citywide rally for Saturday starting at Washington Square Park and ending at Cooper Union,\" said Gollan, noting that more detailed information will be posted on the group's <a href=\"https://www.facebook.com/FreeCooperUnion?ref=stream\">Facebook</a> and Twitter accounts.&#xA0;</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n<p>\"It seems like it is really working.\"</p>\n\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\n\t\n\n  \n\t\t\n\t\n\t\n\t\t\t\n\t\n</div>&#13;\n\t</div>",
    "date_published": "2012-12-07 00:00:00",
    "dek": null,
    "lead_image_url": "http://assets.dnainfo.com/generated/photo/2012/12/cooper-union-protest-13548402644901.jpg/image160x120.jpg",
    "title": "Cooper Union Students Hold 'Live-In' Protest for Free Education Updated 4 hrs ago",
    "rendered_pages": 1
}