{
    "domain": "hyperallergic.com",
    "next_page_id": null,
    "url": "http://hyperallergic.com/93141/cooper-union-board-suspends-student-trustee-elections/",
    "short_url": "http://rdd.me/tpmrdpvg",
    "author": "Mostafa Heddaya on November 12, 2013 Tweet 1",
    "excerpt": "The Cooper troubles continue (image via Free Cooper Union)In an announcement made through Cooper Union&#x2019;s Office of Student Affairs yesterday, the university&#x2019;s trustees canceled the&hellip;",
    "direction": "ltr",
    "word_count": 408,
    "total_pages": 0,
    "content": "<div><div class=\"format_text entry-content\"><div id=\"attachment_93157\" class=\"wp-caption alignnone\"><img class=\" wp-image-93157 \" alt=\"cooper\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/11/cooper.jpg\" width=\"640\"><p class=\"wp-caption-text\">The Cooper troubles continue (image via Free Cooper Union)</p></div><p>In an <a href=\"http://pastebin.com/6kiNMshr\">announcement</a> made through Cooper Union&#x2019;s Office of Student Affairs yesterday, the university&#x2019;s trustees canceled the upcoming elections for a student trusteeship previously ratified at their September board meeting. A student voice on the Board of Trustees had been a long-standing demand of the Free Cooper Union activist movement at the school; the decision made by the board at their September 18 meeting to allow a single, non-voting student trustee with a&#xA0;two-year term was itself a compromised implementation of Free Cooper&#x2019;s demands for voting student trustees representing each of the university&#x2019;s three schools: art, architecture, and engineering.</p><p>Linda Lemiesz, who had been previously served as Dean of Students and head of the Office of Student Affairs, was let go two weeks before the start of this term and replaced by Dean Baker, formerly director of athletics. At the same time, the university also appointed Chris Chamberlain, who had previously managed student housing, to the Office of Student Affairs. Victoria Sobel, a student and organizer with Free Cooper Union, described the new leaders of the Office of Student Affairs as &#x201C;administration puppets&#x201D; who precipitated the nullification of the student trusteeship. &#x201C;We were not involved with determining the criteria decided upon in the September board meeting,&#x201D; Sobel added, noting that the board reserved the right to interview three candidates presented by the student body before selecting one.</p><p>Reacting to this constraint, Cooper students kept the field of candidates purposely small, with the intention of nominating only a single candidate to the board &#x2014; despite the stipulations presented in September. According to Sobel, three students, all of them affiliated with Free Cooper Union, attained the 100 signatures required&#xA0;to be eligible to run for office. This field narrowed to two when one of the candidates was deemed academically ineligible. Though the administration&#x2019;s tone suggests that insufficient student interest yielded a weak field of candidates, Free Cooper Union organizers maintain steadfastly that once again, the school&#x2019;s board is relying on technocratic tactics to suppress widely held student demands. In its statement on behalf of the board, the Office of Student Affairs suggested that the appointment of a student representative on the board is eventually within reach. &#x201C;It should be possible to complete such a process in time to allow the trustees to interview and confirm a Student Representative to assume the position beginning with the March 2014 meeting,&#x201D; the statement reads.</p><p class=\"post_tags\">Tagged as: <a href=\"http://hyperallergic.com/tag/cooper-union/\" rel=\"tag nofollow\">Cooper Union</a>, <a href=\"http://hyperallergic.com/tag/free-cooper-union/\" rel=\"tag nofollow\">Free Cooper Union</a></p></div></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/11/cooper.jpg",
    "title": "Cooper Union Board Suspends Student Trustee Elections",
    "rendered_pages": 1
}