{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2013/11/cooper_union_board_student_representative.php",
    "short_url": "http://rdd.me/hc2azwwk",
    "author": "Tessa Stuart",
    "excerpt": "Facebook.com/FreeCooperUnion\"Board of Trustees, you have made a terrible mistake.\"When Cooper Union students ended their 65-day occupation of university president Jamshed Bharucha's office in July,&hellip;",
    "direction": "ltr",
    "word_count": 516,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"><table class=\"image center\" border=\"0\" width=\"565\"><tr><td><a href=\"http://blogs.villagevoice.com/runninscared/cooperunionbomb.jpg\"><img alt=\"cooperunionbomb.jpg\" src=\"http://blogs.villagevoice.com/runninscared/assets_c/2013/11/cooperunionbomb-thumb-565x424.jpg\" width=\"565\"></a></td></tr><tr><td class=\"credit\">Facebook.com/FreeCooperUnion</td></tr><tr><td class=\"caption\">\"Board of Trustees, you have made a terrible mistake.\"</td></tr></table></span>When Cooper Union students ended their 65-day occupation of university president Jamshed Bharucha's office in July, it was with a certain understanding. </p>\n\n<p>They understood the administration would create a working group of students, faculty, and alumni that had until December 2013 to \"leave no stone unturned\" in its effort to keep Cooper Union free. They understood the administration would open a communal space for students, faculty and alumni, and they understood that a student member would be added to the board of trustees.</p>\n<a name=\"more\"></a>\n<p>Now the board of trustees appears to be changing its mind about that whole student representative thing. </p>\n\n<p>On Monday the board announced it would not consider the representative nominated by Cooper Union's Joint Student Council. Their reasoning? The students were in <em>too much</em> agreement about which of their peers they wanted representing their interests on the board. </p>\n\n<p>Here's what the board said Monday:</p>\n\n<blockquote>It has now come to the Board's attention that the process implemented by the JSC to select candidates for the Student Representative position only resulted in two candidates even running for the position, and that the Joint Student Council has since voted only to submit to the Committee on Trustees the one candidate with the highest number of votes.\n\n<p>Unfortunately, the process and parameters put into place by the Joint Student Council are not in concert with the criteria established by the Board of Trustees for the Student Representative position. Further, the decision by the JSC to submit only a single candidate to the Committee on Trustees is a clear attempt to circumvent those requirements and as such, the Board will not consider a candidate resulting from this process.</p></blockquote>\n\n<p>The board went on to say that because of the obstacle it has introduced into the process, it would not be appointing a student representative in time for the December 2013 meeting. </p>\n\n<p>The board remains optimistic, however, that it would be able to find a suitable representative in time for the March 2014 meeting... Which is convenient considering most of the fighting over tuition is expected to happen at the December meeting.</p>\n\n<p>In a statement released Tuesday, Free Cooper Union <a href=\"http://cusos.org/post/66786423755/for-immediate-release-cooper-board-suspends\" target=\"_blank\">explained</a>: </p>\n\n<blockquote>If a representative is not seated by December 2013, as was originally scheduled, students will not have input on the the plans to be presented by the Working Group generating tuition alternatives; the current candidates will have too few semesters remaining to be eligible, and Board-community relations will be further strained.</blockquote>\n\n<p>The student representative is a non-voting position, so what the board's decision effectively means is there will not even be a student voice in the room during the meeting in which members decide whether students will have to pay tuition.</p>\n\n<p>Free Cooper Union says it won't stand for that. The group ended Tuesday's statement saying, \"Students will be at the December Board meeting, one way or another.\" </p>\n\n<p>Shortly after, the group posted a photo (above) that is either a publicity shot for their new rap group, or a warning to the administration. </p>\n\n<p><em><strong>Send story tips to the author, <a href=\"mailto:tstuart@villagevoice.com\" target=\"_blank\">Tessa Stuart</a></strong></em></p>\n\n<p><a href=\"https://twitter.com/tessastuart\" class=\"twitter-follow-button\">Follow @tessastuart</a><article-signup type=\"email\" size=\"large\"></article-signup></p>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                </div>",
    "date_published": "2013-11-13 08:30:00",
    "dek": null,
    "lead_image_url": "http://blogs.villagevoice.com/runninscared/assets_c/2013/11/cooperunionbomb-thumb-565x424.jpg",
    "title": "Cooper Union Board Refuses to add Student Rep; Cooper Union Students not Pleased About it",
    "rendered_pages": 1
}