{
    "domain": "newyork.cbslocal.com",
    "next_page_id": null,
    "url": "http://newyork.cbslocal.com/2012/12/09/cooper-union-students-push-on-with-fight-against-end-to-free-tuition/",
    "short_url": "http://rdd.me/b77pm3ps",
    "author": null,
    "excerpt": "NEW YORK (CBSNewYork) — Students at Cooper Union this weekend continued to fight against a move from a free education to a tuition-based model with a march from Washington Square Park to the school’s&hellip;",
    "direction": "ltr",
    "word_count": 542,
    "total_pages": 0,
    "content": "<div class=\"entry-content-textbox\" score=\"40.0\">\n\t\t\t\t\t\n\n<p><strong>NEW YORK (CBSNewYork)</strong> — Students at Cooper Union this weekend continued to fight against a move from a free education to a tuition-based model with a march from Washington Square Park to the school’s East Village campus.</p>\n<p><a href=\"http://interoccupy.net/blog/free-cooper-union-rally/\" target=\"_blank\">The march was held Saturday</a>, organized by Cooper Union students along with Occupy Wall Street and other groups. The Huffington Post reported about 200 people attended the march, which ended with a rally outside the school in which attendees held signs reading, “We are students, not customers.”</p>\n<p>The students have been protesting plans by the board of trustees at the Cooper Union for the Advancement of Science and Art to charge tuition at the school for the first time in 110 years.</p>\n<p><a href=\"http://www.cusos.org/photos-videos-and-reflections-on-the-free-cooper-union-rally-dec-8th-2012/\" target=\"_blank\">On the Web site for the group Cooper Union Student Action to Save Our School</a>, former professor and alumnus Ben Degen called the rally a “great success,” and praised the students’ effort.</p>\n<p>“These are not anarchic rabble-rousers,” Degen wrote in a post on the site. “The group of students that are currently occupying the Peter Cooper Suite and the students who organized and attended this rally represent some of the best and brightest at Cooper. These young people are Cooper Union’s student council representatives and top academic achievers. These are Cooper Union’s leaders. These students are the embodiment of Peter Cooper’s vision of education as a means to facilitate continuing generations of politically active, smart and socially conscious LEADERS for our democratic society.”</p>\n<p>In the post on the Web site, Degen also lauded Cooper Union alumni, staff and faculty, East Village neighbors, NYPD officers, and even the school’s administrators for their part in the rally. He pointed out that Cooper Union vice president T.C. Westcott and dean of students Linda Lemiesz came to the rally to ensure that students were safe and convey “a message of peaceful cooperation.”</p>\n<p><a title=\"Cooper Union Students Take Over University Clock Tower To Protest Tuition Change\" href=\"http://newyork.cbslocal.com/2012/12/04/cooper-union-students-take-over-university-clock-tower-to-protest-tuition-changes/\">Last week, students seized the Cooper Union clock tower and said they would not come out until demands were met.</a> Eleven students have remained barricaded in the tower ever since.</p>\n<p>“We’re fighting for free education here, but we’re also fighting against the rising tuition costs nationwide and the student debt nationwide,” senior Rachel Appel told CBS 2′s John Slattery on Monday.</p>\n<p>The university is considering <a href=\"http://newyork.cbslocal.com/2011/11/01/cooper-union-considers-charging-tuition/\">charging tuition to graduate students</a>. But students fear undergraduates may soon be charged, too.</p>\n<p>“We are demanding that the school publicly reaffirm its mission statement of providing free education to all and that President Jamshed Bharucha step down,” student Joe Riley said last week.</p>\n<p>Students have noted that school founder Peter Cooper opened the school with a mission of free education in 1859. Prior to 1902, when the school received a large endowment, students paid for their tuition if they were able to do so, <a href=\"http://www.dnainfo.com/new-york/20121208/east-village/cooper-union-students-march-keep-college-free-of-tuition\" target=\"_blank\">the school told DNAInfo.</a></p>\n<p>The school’s administration said there are no plans to press charges or suspend the students occupying the clock tower.</p>\n<p>“Cooper Union has always been supportive of freedom of expression and peaceful demonstrations,” Jolene Travis, the university’s assistant director of communications, said. “We want to know and hear from the students.”</p>\n<p>But school officials have said charging tuition must be considered in the wake of the economic downturn.</p>\n<p><em><strong>Do you think free tuition should be preserved at Cooper Union? Leave your comments below…</strong></em>\n</p>\n\n\t\t\t\t</div>\n\n\t\t\t\t\n\t\t\t\t",
    "date_published": "2012-12-09 21:24:00",
    "dek": null,
    "lead_image_url": "http://cbsnewyork.files.wordpress.com/2012/12/cooper-union-protest.jpg?w=260",
    "title": "Cooper Union Students Push On With Fight Against End To Free Tuition",
    "rendered_pages": 1
}