{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2013/02/deferred_cooper.php",
    "short_url": "http://rdd.me/y0rxb06o",
    "author": "Jason Lewis",
    "excerpt": "Jason Lewis/Village VoiceThe hearts of the folks running Cooper Union seem to have turned rather cold lately. President Jamshed Bharucha informed faculty members from the School of Art last Wednesday&hellip;",
    "direction": "ltr",
    "word_count": 862,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"><table class=\"image right\" border=\"0\" width=\"300\"><tr><td><img alt=\"deferred_cooperunion.jpg\" src=\"http://blogs.villagevoice.com/runninscared/deferred_cooperunion.jpg\" width=\"300\"></td></tr><tr><td class=\"credit\">Jason Lewis/Village Voice</td></tr></table></span>The hearts of the folks running Cooper Union seem to have turned rather cold lately.</p>\n\n<p>President Jamshed Bharucha informed faculty members from the School of Art last Wednesday that <a href=\"http://cooperasc.github.com/notes/2013/02/13/bharucha-letter/\" target=\"_blank\">all of the school's early-decision applicants</a> would either be lumped in with the college's general admission pool or denied admittance altogether. The move came <a href=\"http://blogs.villagevoice.com/runninscared/2013/02/cooper_union_art_faculty.php\">shortly after Art School faculty members sent </a>a letter to Bharucha, informing the administration of their opposition to the implementation of any tuition-based programs at the Cooper Union.</p>\n\n<p>Current students and deferred applicants took to the front of the college's Foundation Building yesterday afternoon to voice their outrage over the decision.</p>\n<a name=\"more\"></a>\n<p>\"The impression conveyed by the letter from the university president is that, because the Art School did not provide a money-making opportunity for the school, but instead is standing up for the original principles of the school, the Art School is being punished,\" said deferred early-decision applicant Ben Adman in a letter read by a current Cooper Union student. \"Making the decision not to allow for early-decision not only robbed early-decision applicants of opportunity elsewhere, it also pits different schools within Cooper Union against one another.\"</p>\n\n<p>The Board of Trustees honored the early-decision process for applicants who applied to the college's architecture and engineering schools. </p>\n\n<p>\"This is an existential crisis, not a plebiscite about tuition. It should also be obvious that little is served by staking out a high road that leads off a cliff,\" the college said in a statement. \"The simple, sobering fact is that The Cooper Union's expenses exceed its revenues. Ignoring that won't alter fundamental reality: the present financial model is unsustainable.\"</p>\n\n<p>Last semester President Bharucha tasked each of the three schools with mapping out plans to implement revenue-generating programs. The School of Art had a proposal in place, but the faculty ultimately ruled to table those plans--calling Bharucha's mandate \"subtly coercive.\" </p>\n\n<p>Not only did they argue in favor of preserving the tradition of free-tuition at the Cooper Union, but after a thorough analysis of potential tuition-based  programs, they found that the cost of building and sustaining those programs would leave little revenue left over to support free undergraduate tuition. It should also be noted that they came to this conclusion while working with financial consultants hired by the college.</p>\n\n<p>\"The art school prepared a plan, but a quorum of the school's faculty, several days later, attached a post-script preventing the plan from being considered, saying the School of Art Faculty 'opposes the very principle of generating revenue through tuition from academic programs,' including summer school or graduate programs. That course is unsustainable,\" the college said in the statement.</p>\n\n<p>Members of the student-led group, Cooper Union Student Action to Save our Schools, <a href=\"http://cusos.org/response-to-135pm-statement-from-claire-mccarthy-to-press/\" target=\"_blank\">argue </a>that faculty from the other two schools are equally as against tuition-based programs as faculty from the school of art. The group cited the fact the faculties from the School of Architecture and the School of Engineering don't explicitly support tuition based initiatives in their proposals. </p>\n\n<p>The faculty of those schools merely outlined the academic basis for such programs, and also haven't found such revenue-based programs to be economically sustainable. CUSOS says that the School of Engineering removed half of its proposal before it was submitted in opposition to tuition-based programs. And, according to CUSOS, the School of Architecture wrote in its proposal:</p>\n\n<blockquote> \"[T]he question of the possible introduction of a fee-based model for the school is not an academic one and thus the Faculty has no authority to participate in the process of deciding such matters.\" </blockquote>\n\n<p>Despite the apparent objection to embracing fee-based programs at the college, the two schools did submit the required proposals. The School of Art didn't. </p>\n\n<p>And, even though the School of Art failed to submit its proposal, it's difficult to understand why the board of trustees would choose to punish would-be students. Early-decision applicants are supposed to get an <em>early</em> decision. That's the basis of the whole deal. And, the School of Art has had those decisions ready to be sent off for weeks now.</p>\n\n<p>\"Our admission is being held hostage in deferral limbo and arrangements for another round of acceptance decisions makes our chances even more slim,\" said deferred applicant William Stewart in a statement read by a current Cooper Union Student. \"We have been cheated. This news fell as a complete shock wave seeing that we were affirmed at open houses, mine on November 30, 2012, that the Class of 2017 would be unaffected by matters of tuition.\"</p>\n\n<p>The students had to forgo opportunities to apply early decision at other institutions. And, one can only imagine the work-load associated with such an application for a college as competitive as the Cooper Union. It's probably pretty damn heavy.</p>\n\n<p>\"This doesn't happen This is not a normal force of events ,\" Wylie Stecklow, a lawyer who provided legal advice to the students who staged last semester's lock-in protest, told the <em>Voice</em>. \"The trustees have breached an obligation It's harmed the school, not only by potentially opening them up to legal liability but it's harmed their reputation....They made an offer. These kid put their time in...They deserved a proper response--not a deferral, not a punt.</p>                                                <article-signup type=\"email\" size=\"large\"></article-signup>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t</div>",
    "date_published": "2013-02-21 11:38:05",
    "dek": null,
    "lead_image_url": "http://blogs.villagevoice.com/runninscared/deferred_cooperunion_100.jpg",
    "title": "Deferred Cooper Union Applicants Feel Like Collateral in Board's Beef With Art School",
    "rendered_pages": 1
}