{
    "domain": "mic.com",
    "next_page_id": null,
    "url": "http://mic.com/articles/38461/cooper-union-tuition-school-makes-a-mistake-in-charging-students",
    "short_url": "http://rdd.me/eitsjbuf",
    "author": null,
    "excerpt": "Cooper Union was founded with a vision: to provide a quality, free education for all. Unfortunately, that vision has come to a tragic end. On Tuesday, the university announced that it would&hellip;",
    "direction": "ltr",
    "word_count": 546,
    "total_pages": 0,
    "content": "<div><div id=\"article-body\">\n                                                                                \n\n<p>Cooper Union was founded with a vision: to provide a quality, free education for all. Unfortunately, that vision has come to a tragic end. On Tuesday, the university announced that it would start&#xA0;<a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?hp&amp;_r=0\">charging undergraduates</a>. To be specific, the school has suggested the tuition for those who can pay will be $20,000, while it will be free for those who cannot pay. The school, revered for being \"<a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?hp&amp;_r=0\">free as air and water</a>,\"&#xA0;attracts millions of applicants with its high level of instruction and its highly meritocratic system of choosing students. Regardless, reactions to the announcement have varied across the spectrum; some students began weeping while others stormed out. One professor suggested that&#xA0;<a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?hp&amp;_r=0\">the school be draped in black,</a>&#xA0;marking the end of an era of free tuition.</p>\n<p>One student who I had the opportunity to talk with, Harrison, believes that the university has not yet examined other options before coming to this decision. When I asked him what he thought of the announcement, he said it was \"heartbreaking,\" but it also allowed the student body to be more \"unified or focused [on] the task at hand (trying to undo the damage done by the Board of Trustees&#x2026;).\" While this decision has been difficult to stomach, it has allowed Cooper Union students and professors alike to challenge and question the decision. Harrison, like many other Cooper Union students, also suggests that it&#x2019;s \"impossible for students to reach their full potential when a price tag is placed on their head,\" regardless of whether it is marked at half price or not.</p>\n<p>It is important to note that even with the tuition, Cooper Union is still cheaper than&#xA0;<a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?pagewanted=1&amp;_r=1&amp;hp\">RISD ($42,622),</a>&#xA0;renowned for its art program, and&#xA0;<a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?pagewanted=1&amp;_r=1&amp;hp\">Carnegie Mellon University ($46,670)</a>, known for its highly ranked engineering program. Even the \"actual\" tuition for Cooper Union is lower than other schools at $38,500, but it has been extending a \"full scholarship\" to all its students thus far.</p>\n<p>However, there has been some praise about this announcement. Instead of reducing the tuition by 25%&#xA0;<a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?pagewanted=1&amp;_r=1&amp;hp\">as recommended by a consulting firm,</a>&#xA0;the Board has decided to reduce it by 50%. Mr. Epstein, the board chairman, has applauded this move, saying that reducing tuition more than recommended allows the imposition of tuition on a \"<a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?pagewanted=1&amp;_r=1&amp;hp\">sliding scale.\"</a>&#xA0;He also suggests that this new approach could&#xA0;<a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?pagewanted=1&amp;_r=1&amp;hp\">provide better financial support to needy students</a>&#xA0;by subsidizing the costs of living in the city along with tuition.</p>\n<p>Some of the other options that the Board of Trustees has looked at include shrinking the size of the student body and selling real estate. It is important to note that Cooper Union has been making money from&#xA0;<a href=\"http://www.nytimes.com/2013/02/16/nyregion/cooper-unions-tradition-of-free-tuition-may-be-near-end.html?hp&amp;_r=1&amp;\">the land under the Chrysler Building</a>, but has been running at a $12 million deficit at the same time. Despite this, some students feel that the Board of Trustees has not exhausted all of its options. According to Harrison, \"the lack of accountability when considering the Board of Trustees can't be ignored.\" Many students wish there was more transparency, which is \"nonexistent,\" at this point.</p>\n<p>Many believe that this decision has compromised the values and character of Cooper Union. However, others believe that this was a decision that had to be taken as a result of a falling economy. However, one thing is for sure: Cooper Union will forever be changed, affecting students and applicants going forward.&#xA0;</p>\n\n                                                            \n                    \n                                        \n                </div>\n                                </div>",
    "date_published": "2013-04-29 09:52:00",
    "dek": null,
    "lead_image_url": "http://mic.com/articles/38461/cooper-union-tuition-school-makes-a-mistake-in-charging-students",
    "title": "Cooper Union Tuition: School Makes a Mistake in Charging Students",
    "rendered_pages": 1
}