{
    "domain": "www.boweryboogie.com",
    "next_page_id": null,
    "url": "http://www.boweryboogie.com/2012/12/students-for-free-cooper-union-plan-rally-in-washington-square-park-today/",
    "short_url": "http://rdd.me/ifb234dz",
    "author": "Elie",
    "excerpt": "[Photo: Students for a Free Cooper Union]The Students for a Free Cooper Union, the eleven protestors We, The Students for a Free Cooper Union, having occupied The Peter Cooper Suite on the top floor&hellip;",
    "direction": "ltr",
    "word_count": 486,
    "total_pages": 0,
    "content": "<div><div id=\"attachment_45479\" class=\"wp-caption aligncenter\"><img class=\"size-medium wp-image-45479\" title=\"cooper-union-deman-publication\" src=\"http://cdn01.boweryboogie.com/content/uploads/2012/12/cooper-union-deman-publication-620x465.jpg\" alt=\"\" width=\"620\"><p class=\"wp-caption-text\">[Photo: Students for a Free Cooper Union]</p></div>The Students for a Free Cooper Union, the eleven protestors <blockquote><p>We, The Students for a Free Cooper Union, having occupied The Peter Cooper Suite on the top floor of The Cooper Union Foundation Building for more than 100 hours, have chosen to reissue our demands of the Cooper Union administration and guiding principles to the citywide higher education community and general public.</p>\n<p>Over the past five days, we have received amazing displays of solidarity from Cooper Union students, faculty, alumni, and supporters around the world. Meanwhile, the college&#x2019;s deadlocked administration has been shaken by community action and presence. Cooper Union has received positive attention as an institution, and the community&#x2019;s numerous creative responses to tuition- based, expansionist models have stressed the necessity and preservation of free education.</p>\n<p>However, Jamshed Bharucha and his administration have yet to officially respond to our demands. Rather than addressing the pressing issues raised by student, faculty, and alumni, Bhaurcha&#x2019;s administration has attempted to marginalize our voices along with the vision and mission of Cooper Union: to provide free education to all.</p>\n<p>We now find ourselves in a space of unity and true democratic discourse among students, faculty, and alumni. Our peers have taken this opportunity to come together across disciplines, forming a unification committee, carrying out guidelines for peaceful protests, and crossing institutional boundaries.</p>\n<p>To move forward with the support of the Cooper Union community and an assembly of New York City high schools, colleges, and universities, The Students for a Free Cooper Union have published 2,000 copies of our original communique and list of demands to be distributed at the Citywide Student/Faculty Rally on Saturday, December 8. The rally will begin at 11:00 AM in Washington Square Park with student and faculty speak-outs, followed by a march to Cooper Union at 3:00 PM. This celebration of free education and the student reclamation of higher education will conclude with a dance party.</p>\n<p>The march from Washington Square Park to Cooper Union will be fun, family-friendly, participatory, and welcoming to those not well-versed in protest.</p>\n<p>Our demands are as follows:</p>\n<p>1. The administration must publicly affirm the college&#x2019;s commitment to free education. They will stop pursuing new tuition-based educational programs and eliminate other ways in which students are charged for education.</p>\n<p>2. The Board of Trustees must immediately implement structural changes with the goal&#xA0;of creating open flows of information and democratic decision-making structures. The administration&#x2019;s gross mismanagement of the school cannot be reversed within the same systems which allowed the crisis to occur. To this end, we have outlined actions that the board must take:</p>\n<ul>\n<li>Record board meetings and make minutes publicly available.</li>\n<li>Appoint a student and faculty member from each school as voting members of the board.</li>\n<li>Implement a process by which board members may be removed through a vote from the&#xA0;Cooper Union community, comprised of students, faculty, alumni, and administrators.</li>\n</ul>\n<p>3. President Bharucha steps down.</p></blockquote>\n</div>",
    "date_published": "2012-12-08 14:01:24",
    "dek": null,
    "lead_image_url": "http://cdn01.boweryboogie.com/content/uploads/2012/12/cooper-union-deman-publication-620x465.jpg",
    "title": "Students for Free Cooper Union Plan Rally in Washington Square Park Today",
    "rendered_pages": 1
}