{
    "domain": "www.ny1.com",
    "next_page_id": null,
    "url": "http://www.ny1.com/content/news/education/214362/many-charter-school-students-already-back-in-class/",
    "short_url": "http://rdd.me/iqcupm9f",
    "author": "Lindsey Christ",
    "excerpt": "For most city students, this was one of the last weeks of summer vacation, but at many charter schools, it was already the first week of the new school year. NY1's Lindsey Christ filed the following&hellip;",
    "direction": "ltr",
    "word_count": 385,
    "total_pages": 0,
    "content": "<div><div class=\"article-content\"><p><i>For most city students, this was one of the last weeks of summer vacation, but at many charter schools, it was already the first week of the new school year. NY1's Lindsey Christ filed the following report.</i></p><p>At one Success Academy in Brooklyn, third graders are analyzing a poem about time, a topic their school is also focused on. </p><p>Like many city charter schools, the Success Academies say they're always trying to increase and maximize the time students spend learning, and that includes starting the year in August. </p><p>\"We think that kids do better the more high-quality learning they get, and there is so much to be taught, and we think there is really no cap to their learning or academic potential,\" said Javeria Khan, principal of Success Academy Bed-Stuy 1. </p><p>So they bring kids back early, keep them longer each day and give them work to do during the summer. </p><p>\"We also don't waste that much time, right. So the expectation is, anything that's not academic gets done quickly,\" Khan said.</p><p>That starts the very first week. Large stopwatches keep everyone on schedule, and students follow exact procedures to quickly and silently switch between activities. Still, parents say their children were counting down the time until school began. </p><p>\"She was saying, 'Mommy, five more days, we go to school! Four more days, tomorrow, school!'\" said parent Samaria Wright.</p><p>There will be 197 charters in the city this year, including 14 new schools. The New York City Charter Center says the vast majority have extended school years, and many have extended school days. Some, like Success Academies, have among the highest test scores in the state. Overall, city charters posted higher test scores in math compared to traditional public schools, but slightly lower scores in reading. </p><p>Some charters, including Success, raise millions of dollars in private money to help supplement their public funds. Others, like Democracy Prep Endurance, manage to extend the year with just their standard state funding.  </p><p>\"We are thrifty in all the things that we need to be thrifty in,\" said Margaret Marrer, principal of Democracy Prep Endurance.</p><p>Democracy Prep Endurance spent this week teaching new students all their systems and procedures. </p><p>\"So on September 2, you're learning reading, writing, math, music, dance, all of those things that we're really, really excited to dive into,\" Marrer said.</p></div>\n    \n        \t\t\t\t\t\n            \t\t\t\t\t\n    \n        \n    \n         \n    \n                \n   \n   \n\n\n        \n    \n\n\n\n\n\t\t\t\n\t\t\t\n\t\t</div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://media.ny1.com:80/media/2014/8/22/images/chartersklsb2a22ca3-e586-4781-8163-10acc4e0f3e9.jpg",
    "title": "Many Charter School Students Already Back in Class",
    "rendered_pages": 1
}