{
    "domain": "www.huffingtonpost.com",
    "next_page_id": null,
    "url": "http://www.huffingtonpost.com/2012/12/07/peter-cafiero-cooper-union_n_2259251.html",
    "short_url": "http://rdd.me/ofrnrlwi",
    "author": "Tyler Kingkade",
    "excerpt": "NEW YORK -- A growing movement of student activism at Cooper Union in New York has enraged the head of the school's alumni association. Peter Cafiero, president of the Cooper Union Alumni Association&hellip;",
    "direction": "ltr",
    "word_count": 723,
    "total_pages": 0,
    "content": "<div class=\"articleBody\" score=\"20.0\">\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                                    \n\t\t\t\t\t\t\t\t\t<p>NEW YORK -- A growing movement of <a href=\"http://www.huffingtonpost.com/2012/12/05/cooper-union-tuition-protest_n_2240768.html\" target=\"_hplink\">student activism at Cooper Union</a> in New York has enraged the head of the school's alumni association.</p>\n\n<p>Peter Cafiero, president of the Cooper Union Alumni Association and member of the school's board of trustees, lashed out at the student occupation in an email sent to the Cooper community, obtained by The Huffington Post.</p>\n\n<p>\"I have never been more embarrassed to be an alumnus of the Cooper Union than I was today,\" Cafiero wrote in the Friday afternoon message. \"To even call this a protest demeans the long history of Cooper Union activism and protest against people who actually owned slaves, who actually discriminated against women and minorities and union organizers, who locked young women in sweatshops -- in other words real issues of great seriousness that on occasion warranted actions beyond words and civil discourse.\"</p>\n\n<p>Eleven students have been barricaded in the 8th floor of the Cooper Union Foundation Building, <a href=\"http://www.huffingtonpost.com/2012/12/04/cooper-union-tuition-protests_n_2236936.html?1354638273\" target=\"_hplink\">protesting plans to implement tuition for the first time</a> in the college's 110-year history. They've locked themselves in the same <a href=\"http://www.huffingtonpost.com/2012/12/06/cooper-union-pizza_n_2253366.html?utm_hp_ref=college\" target=\"_hplink\">historic building where Abraham Lincoln once gave a speech</a> as a presidential candidate outlining his ideas about slavery.</p>\n\n<p>Cafiero, a 1983 graduate of the civil engineering school and Chief of Operations Planning for New York City Transit, wrote that he was also angry about <a href=\"http://www.huffingtonpost.com/2012/12/05/cooper-union-tuition-protest_n_2240768.html\" target=\"_hplink\">another student demonstration outside of a board of trustees meeting</a> on Wednesday. </p>\n\n<p>\"They toss around the latest buzzword 'transparency' when they really mean 'I don't want to hear what you are saying so I will just shout and not listen and maybe I won't hear it anymore,'\" Cafiero said. \"None of these people that I heard today seem to have the most basic knowledge of how to make their case, what their case is, or the realities of the world.\"</p>\n\n<p>Students were demonstrating outside the meeting in part because they want a student representative to the board. Currently, students do not have an advocate to the board, and the meetings are not open to the public, as they are with many public and private universities' governing boards.</p>\n\n\t<p>Cafiero said he considered resigning from the board and threatened to withhold his financial contributions because he doesn't want to fund what he calls \"childish antics.\"</p>\n\n<p>Bruce Degen, a 1966 graduate of the art school, was a bit bothered by Cafiero's email. \"I find it wonderful that there are students who will bring the issues to the world through their activism,\" Degen said in response to Cafiero's message, also obtained by HuffPost. \"If you are ashamed and embarrassed, Peter Caffiero, [sic] then resign.\"</p>\n\n<p>Degen also said he may abstain from donating to Cooper, but for different reasons, namely what he sees as a mismanagement of the school's finances by the trustees.</p>\n\n<p>\"Maybe all of the board of trustees should resign,\" Degen said. \"They were certainly without scruple to put the school in huge financial debt.\"</p>\n\n<p>Another former Cooper student, Kevin Slavin, said in a response that he knows plenty of alumni who support the protesters, who he said were \"brave enough to sacrifice their *own* interests in support of something more important.\" Slavin added a request that Cafiero not \"claim the sentiments of the Alumni of Cooper Union. You may find you're further from the ground than those students.\"</p>\n\n<p>As students call for the resignation of Cooper Union President Jamshed Bharucha, the board of trustees voted unanimously on Wednesday to support him and the planning process he is leading. </p>\n\n<p>Jolene Travis, assistant director of public affairs for Cooper Union, said the school has been holding public meetings to discuss ongoing issues with the community. Bharucha and Vice President of Finance Westcott have held \"more than 80 informational meetings with the Cooper Union community -- students, faculty, alumni and staff,\" according to a statement from Travis.</p>\n\n<p>\"It is important that despite the understandable passions involved,\" Travis said, \"we remain engaged in a civil process as we attempt to resolve critical issues relating to the institution's future and survival.\"</p>\n\n<p>So far, <a href=\"http://www.huffingtonpost.com/2012/12/05/cooper-union-tuition-protest_n_2240768.htmlhttp://www.huffingtonpost.com/2012/12/05/cooper-union-tuition-protest_n_2240768.html\" target=\"_hplink\">more than 50 current faculty have signed</a> a letter in support of the student demonstrators, and a group of Cooper Union <a href=\"http://www.huffingtonpost.com/2012/12/06/cooper-union-pizza_n_2253366.html?utm_hp_ref=college\" target=\"_hplink\">art school alumni have donated pizza</a> to the students. Students from the City University of New York and The New School have also shown up at the Foundation Building to show their support.</p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n<p class=\"video_box_title\">Related on HuffPost:</p>\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t",
    "date_published": "2012-12-07 16:12:28",
    "dek": null,
    "lead_image_url": "http://i.huffpost.com/gen/894977/thumbs/o-PETER-CAFFIERO-COOPER-UNION-facebook.jpg",
    "title": "Cooper Union Trustee Lashes Out At Student Protesters",
    "rendered_pages": 1
}