{
    "domain": "evgrieve.com",
    "next_page_id": null,
    "url": "http://evgrieve.com/2012/12/cooper-union-rally-today-administration.html",
    "short_url": "http://rdd.me/3ylbnfvh",
    "author": "Grieve",
    "excerpt": "From the EV Grieve inbox... From The Students for a Free Cooper Union: Over the past five days, we have received amazing displays of solidarity from Cooper Union students, faculty, alumni, and&hellip;",
    "direction": "ltr",
    "word_count": 615,
    "total_pages": 0,
    "content": "<div><div class=\"post-body entry-content\">\n<div class=\"separator\"><a href=\"http://1.bp.blogspot.com/-2AvuoJYAyL4/UMM6BgIJiAI/AAAAAAABhHA/F8-So99SrPg/s1600/-3.jpg\"><img border=\"0\" width=\"400\" src=\"http://1.bp.blogspot.com/-2AvuoJYAyL4/UMM6BgIJiAI/AAAAAAABhHA/F8-So99SrPg/s400/-3.jpg\"></a></div><br>\n<i>From the EV Grieve inbox...</i><br>\n<br>\n<blockquote>From The Students for a Free Cooper Union:<br>\n<br>\nOver the past five days, we have received amazing displays of solidarity from Cooper Union students, faculty, alumni, and supporters around the world. Meanwhile, the college&#x2019;s deadlocked administration has been shaken by community action and presence. Cooper Union has received positive attention as an institution, and the community&#x2019;s numerous creative responses to tuition-based, expansionist models have stressed the necessity and preservation of free education. <br>\n<br>\nTo move forward with the support of the Cooper Union community and an assembly of New York City high schools, colleges, and universities, The Students for a Free Cooper Union have published 2,000 copies of our original communique and list of demands to be distributed at the Citywide Student/Faculty Rally on Saturday, December 8. The rally will begin at 11:00 AM in Washington Square Park with student and faculty speak-outs, followed by a march to Cooper Union at 3:00 PM. This celebration of free education and the student reclamation of higher education will conclude with a dance party.<br>\n</blockquote><br>\n<a href=\"http://evgrieve.com/search/label/Cooper%20Union\">Previously.</a><br>\n<br>\nMeanwhile, yesterday afternoon, Cooper Union officials issued their first response to the events of the past week.<br>\n<br>\n<blockquote>Via the EV Grieve inbox...</blockquote><br>\n<blockquote>On midday Monday, December 3, 11 art students locked themselves in on the eighth floor of The Cooper Union&#x2019;s Foundation Building. The administration has asked them to leave on several occasions and they have not.<br>\n<br>\nOur primary concern is for the safety of all students and to ensure that the actions of a few do not disrupt classes and final exams. We remain in contact with the students&#x2019; designated representative who said the locked-in group has access to food, water and sanitary facilities. The Cooper Union has expressed concerns about their safety, and they responded that they have taken precautions. Our concerns also extend to actions and conditions that could affect the safety of the public.<br>\n<br>\nOn Dec 5, protesters disrupted a meeting of the Board of Trustees, preventing some faculty members from presenting their academic plans to the Board.<br>\n<br>\nIt is important that despite the understandable passions involved, we remain engaged in a civil process as we attempt to resolve critical issues relating to the institution&#x2019;s future and survival.<br>\n<br>\nThe Board of Trustees voted unanimously on Dec 5 to support President Jamshed Bharucha and the planning process he is leading.<br>\n<br>\nWe are in the midst of a deliberative process designed to position The Cooper Union for a future characterized by true distinction, THE HIGHEST STANDARDS OF MERIT-BASED ACCESS AND SCHOLARSHIP SUPPORT, academic excellence and financial sustainability. We must explore and evaluate a range of options&#x2014;without prejudging any. In order to retain the prospects for full tuition scholarships, you must retain The Cooper Union. A Revenue Task Force consisting of faculty, elected students, staff and alumni has recommended launching master&#x2019;s programs and summer programs that are fee-based, while seeking as far as possible to maintain the full scholarships for students in our three flagship undergraduate programs. The deans and the faculty of each of the three schools have been working to develop academic plans along these lines. The Board of Trustees will study reports as they come in, and will make key decisions early in the spring semester.<br>\n<br>\nPresident Bharucha and Vice President of Finance Westcott have held more than 80 informational meetings with the Cooper Union community&#x2014;students, faculty, alumni and staff. Earlier this week during a spontaneous discussion between the protesters and the President in the lobby of 41 Cooper Square, protesters asked the President to meet with them immediately. He agreed and invited them to the Rose Auditorium. However, most of the protesters declined and left the building.<br>\n<br>\nJolene Travis<br>\nAssistant Director Public Affairs, Media Relations</blockquote>\n\n</div>\n\n</div>",
    "date_published": "2014-08-24 07:00:00",
    "dek": null,
    "lead_image_url": "http://1.bp.blogspot.com/-2AvuoJYAyL4/UMM6BgIJiAI/AAAAAAABhHA/F8-So99SrPg/s400/-3.jpg",
    "title": "Cooper Union rally today; administration responds",
    "rendered_pages": 1
}