{
    "domain": "cityroom.blogs.nytimes.com",
    "next_page_id": null,
    "url": "http://cityroom.blogs.nytimes.com/2012/12/03/students-seize-cooper-union-room-to-protest-possible-tuition/",
    "short_url": "http://rdd.me/4x4ega4m",
    "author": "COLIN MOYNIHAN",
    "excerpt": "Photo from inside Cooper Union occupation. RT @hayskali: @nsfreepress twitter.com/HaysKali/statu…— Angus Johnston (@studentactivism) December 3, 2012Twelve students barricaded themselves inside an&hellip;",
    "direction": "ltr",
    "word_count": 418,
    "total_pages": 0,
    "content": "<div class=\"entry-content\"><blockquote class=\"twitter-tweet\"><p>Photo from inside Cooper Union occupation. RT @<a href=\"https://twitter.com/hayskali\">hayskali</a>: @<a href=\"https://twitter.com/nsfreepress\">nsfreepress</a> <a href=\"http://t.co/mrwQwu2X\" title=\"http://twitter.com/HaysKali/status/275651241617547266/photo/1\">twitter.com/HaysKali/statu…</a></p><p>— Angus Johnston (@studentactivism) <a href=\"https://twitter.com/studentactivism/status/275652507584299008\">December 3, 2012</a></p></blockquote><p>Twelve students barricaded themselves inside an eighth-floor room at the top of the Cooper Union building at noon on Monday to urge the school not to begin charging tuition to undergraduates.</p><p>The school has not made a decision on charging tuition for undergraduates. But in April, the school decided to begin <a href=\"http://www.nytimes.com/2012/04/25/nyregion/cooper-union-will-charge-tuition-for-graduate-students.html\">charging tuition to graduate students</a> for the first time in its 110-year history. The school’s president, Jamshed Bharucha, said he was <a href=\"http://cooper.edu/about/news/update-president-bharucha-framework-action\">searching for ways</a> to keep undergraduate education free for classes after the one entering in 2013.</p><p>The students demanded that the <span id=\"more-442298\"></span>school “publicly affirm the college’s commitment to free education” and “democratic decision-making structures” in a communiqué that they sent to administrators shortly after locking themselves inside the room and bracing the doors with a wooden barricade. They complained of a “lack of transparency and accountability that has plagued this institution for decades and now threatens the college’s mission of free education.”</p><p>Victoria Sobel, one of those participating in the occupation, said by phone that the students were partly inspired by similar actions at the New School and New York University as well as a recent student strike in Quebec and experiences with Occupy Wall Street.</p><blockquote class=\"twitter-tweet\"><p>Students for a Free Cooper Union have locked into CU to preserve free education <a href=\"http://t.co/nEfLdYlU\" title=\"http://www.cusos.org/students-for-a-free-cooper-union-lock-in-to-cooper-unions-foundation-building-to-preserve-free-education-2/\">cusos.org/students-for-a…</a> <a href=\"http://t.co/veByjgUJ\" title=\"http://twitter.com/FreeCooperUnion/status/275657328521531392/photo/1\">twitter.com/FreeCooperUnio…</a></p><p>— Free Cooper Union (@FreeCooperUnion) <a href=\"https://twitter.com/FreeCooperUnion/status/275657328521531392\">December 3, 2012</a></p></blockquote><p> Ms. Sobel said the students had entered the Peter Cooper suite of the building, also known as the clock tower, at noon, disseminated their communiqué, then draped a red banner from a window reading “Free Education for All.”</p><p> Soon afterward, she said, maintenance workers arrived and tried to force their way into the room.</p><p> “They were drilling and ramming the door,” she said. “It was very scary.”</p><p> The students pushed back, Ms. Sobel said, and yelled to the workers that their bodies were against the doors.  After about 20 minutes, she said, the entry attempts ended.</p><p> Ms. Sobel said that the students had brought sleeping bags and blankets and food, including oatmeal and ramen noodles, and were planning to stay “as long as necessary” to get their message across to the administration.</p><p> Ms. Sobel said that the Cooper students had spoken to students who participated in previous occupations and planned the clock tower occupation to coincide with student demonstrations planned for outside the school building, including sessions run by a group called The Free University, which will conduct lectures and classes on the sidewalk at no cost.</p></div>",
    "date_published": "2012-12-03 00:00:00",
    "dek": null,
    "lead_image_url": "http://graphics8.nytimes.com/images/blogs_v3/cityroom/cityroom75.gif",
    "title": "Students Seize Cooper Union Room to Protest Possible Tuition",
    "rendered_pages": 1
}