{
    "domain": "www.nytimes.com",
    "next_page_id": null,
    "url": "http://www.nytimes.com/2013/05/25/nyregion/cooper-union-protesters-living-high-life-out-of-presidents-office.html?_r=0",
    "short_url": "http://rdd.me/as4ab4fa",
    "author": "ARIEL KAMINER",
    "excerpt": "Students occupying the president’s office held an online chat on Wednesday with incoming freshmen. As embattled encampments go, the president’s office at the Cooper Union for the Advancement of S",
    "direction": "ltr",
    "word_count": 956,
    "total_pages": 0,
    "content": "<div id=\"article\" score=\"40.0\">\n\n<div class=\"columnGroup first\" score=\"37.5\">\t\t\t\t\n     <figure class=\"articleSpanImage\" score=\"35.4375\"><span score=\"-3.25\">\n<img src=\"http://graphics8.nytimes.com/images/2013/05/25/nyregion/Cooper-1/Cooper-1-articleLarge.jpg\" width=\"468\" alt=\"\" border=\"0\"><meta value=\"http://graphics8.nytimes.com/images/2013/05/25/nyregion/Cooper-1/Cooper-1-articleLarge.jpg\"><meta value=\"600\"><meta value=\"397\">\n<p class=\"caption\">Students occupying the president’s office held an online chat on Wednesday with incoming freshmen. </p>\n</span>\n</figure>  \n<nyt_byline>\n</nyt_byline>\n\n<meta name=\"emailThisHash\" value=\"6Si08hD+kO3KI283avc6qQ\"><div class=\"articleBody\">\n<span>\n<meta value=\"The New York Times Company\"><meta value=\"http://www.nytco.com/\"><meta value=\"NYSE NYT\"></span>\n<meta value=\"2013\"><nyt_text><nyt_correction_top></nyt_correction_top><p>\nAs embattled encampments go, the president’s office at the <a href=\"http://cooper.edu/\">Cooper Union for the Advancement of Science and Art</a> is not exactly Zuccotti Park in the fall of 2011. Rather than a warren of improvised shelters with a loud drum circle, the gracious office has open views through seven arched windows, and the only percussion comes from the tapping of laptop keys.        </p> \n</nyt_text></div>\n\n<div class=\"articleBody\" score=\"30.0\">\n <p>\nOn May 8, students moved in to protest the school’s decision to charge undergraduate tuition for the first time in 150 years. Since that day, their perch atop Greenwich Village has become an Occupy Wall Street in miniature. A steady stream of students has passed through the office — some staying for just a few hours, others for nearly the whole time — to spread word about the rebellion, posting various satires and subversions to the Web, searching for a better solution to Cooper’s financial crisis, eating catered meals and entertaining visits from well-known activists.        </p><p>\nThe school’s initial response was forceful: students were told they had an hour to vacate or face dire consequences. Bathrooms and water fountains were bolted and boarded up; armed guards were positioned throughout the building; fire exits were blocked. But within minutes, students said, 100 or so supporters made their way past the guards and into the office, where they locked arms in solidarity. A stack of pizzas somehow materialized, and soon the water fountains, bathrooms and fire exits were liberated.        </p><p>\nSince then, the college has taken the opposite approach, essentially allowing students to come and go at will, a liberty that has allowed them to take their exams, shower and even get a comfortable night’s sleep, always leaving behind a group of at least 15 or so to hold down the fort. Cooper’s president himself, Jamshed Bharucha, paid a visit after people attending his presentation in the building’s Great Hall goaded him into addressing the occupiers directly. Everyone talked until well after midnight, then he left and they stayed.        </p><p>\nA few security guards are on hand, but they are unarmed, and in some cases no older than the occupiers; some have even taken to wearing “Free edu” T-shirts under their uniforms. So inside-out is the situation that supporters of the administration have resorted to the favored medium of grass-roots protests: <a href=\"https://www.change.org/petitions/students-engaged-in-sit-in-of-the-cooper-union-s-president-s-office-vacate-the-office-immediately\">a petition on change.org</a>. “Vacate the office immediately,” it commands. “The occupation of the school has created a poisonous and dangerous atmosphere that can potentially destroy the school forever.”        </p><p>\n(As of Friday evening, around 500 people had signed, whereas <a href=\"http://friendsofcooperunion.org/vote-no-confidence/\">a petition</a> calling for the president and the board president to step down has attracted more than 2,000.)        </p><p>\nDr. Bharucha has been operating a government in exile from his home and other offices, doing what he can with e-mail and cellphones. “They have a tremendous amount of passion for Cooper,” he said diplomatically, “so this reflects a very understandable expression of their passion and frustration.” As for how long he was prepared to wait the students out, he said only, “We’re taking it one day at a time.”        </p><p>\nArmed with a sense of righteous purpose — and a Nintendo Wii for good measure — a rotating cast of students has been debating strategy. (From a list of possible future actions: “sculpture storage,” “get Jamshed another job,” “What if we all legally change our names to Jamshed Bharucha?”) They have been keeping the office exceptionally clean. And they have been getting their message out on virtually every known social media platform. The Free Cooper Union Facebook page now has more “likes” than the official Cooper Union page. On Wednesday night, they protesters held an online chat <a href=\"https://www.facebook.com/media/set/?set=a.471717716242385.1073741846.391957684218389&amp;type=1\">with incoming freshmen</a> to let them know about recent events. (Tuition, on a sliding scale expected to top out around $20,000, will not be charged to anyone enrolled by this fall.)        </p><p>\n“In a lot of ways we have become the P.R. team for the school,” said Joe Riley, a fourth-year art student, nibbling on some trail mix.        </p><p>\nAn earlier occupation of the Peter Cooper Suite, in the same building, by 11 students last December, <a href=\"http://cityroom.blogs.nytimes.com/2012/12/10/cooper-union-students-end-occupation-of-suite-after-a-week/\">lasted a week</a> and ended of its own accord. As for the conditions under which the current occupation might end, the students have no single answer. One student mentioned Dr. Bharucha’s departure, another mentioned more voice for students in the running of the school. Some envisioned a different structure of governance altogether. Casey Gollan, a graduating art student, suggested, “Maybe we don’t need a president at all — and boom!”        </p><p>\nWhatever happens, they have been making the most of the moment. Alumni and supporters sign up online to cover all the occupiers’ meals. Thai one day, Indian another; last week, someone sent platters of sushi. “I’ve eaten better these past two weeks than I did the two weeks previous,” one student said.        </p><p>\nThey set up red lights to illuminate the exterior of the office every night at sunset, and <a href=\"http://freecoopercountdown.tumblr.com/\">a tumblr page</a> of people counting down to that moment. They put together an <a href=\"https://www.facebook.com/media/set/?set=a.472044352876388.1073741847.391957684218389&amp;type=3\">online photo gallery</a> of the books on Dr. Bharucha’s shelves (they got a chuckle out of “Profiting from Education,” though it is actually about Japanese-American joint ventures) and another gallery, called “Jam’s Head,” of <a href=\"https://www.facebook.com/media/set/?set=a.466044733476350.1073741831.391957684218389&amp;type=3\">people holding pictures</a> of Dr. Bharucha up in front of their own. They plan to open a free school and salon to coincide with next week’s collegewide end-of-year show.        </p><p>\nCommencement is scheduled for Wednesday. Mr. Gollan, who has been reading the book “Can Jokes Bring Down Governments?,” hinted that Mayor Michael R. Bloomberg’s keynote speech might not be the only highlight. “I would not be surprised if there were crazy plans for commencement,” he said, “and if I somehow got involved.”        </p><nyt_correction_bottom score=\"7.5\">\n</nyt_correction_bottom><nyt_update_bottom></nyt_update_bottom></div>\n</div>\n\n\n\n\n\n\n\n\n\n\n\n\n</div>\n",
    "date_published": "2013-05-24 00:00:00",
    "dek": null,
    "lead_image_url": "http://graphics8.nytimes.com/images/2013/05/25/nyregion/Cooper-1/Cooper-1-articleLarge.jpg",
    "title": "Tuition Protesters Still in Top Office at Cooper Union",
    "rendered_pages": 1
}