{
    "domain": "thebillfold.com",
    "next_page_id": null,
    "url": "http://thebillfold.com/2013/05/hanging-with-free-cooper-union/",
    "short_url": "http://rdd.me/az3hj9zn",
    "author": "Brendan O’Connor",
    "excerpt": "Like the six floors below it, the seventh floor of the Cooper Union&#x2019;s Foundation Building has been transformed into an art gallery&#x2014;Tuesday night was the first night of the annual Cooper&hellip;",
    "direction": "ltr",
    "word_count": 892,
    "total_pages": 0,
    "content": "<div><div class=\"entry clearfix\">\n          <p><img src=\"http://s23.theawl.com/bill/up/2013/05/Screen-shot-2013-05-29-at-3.03.06-PM-640x312.jpg\" alt=\"\" title=\"FUCKINTUITION\" width=\"640\" class=\"alignnone size-post640 wp-image-30642\"></p>\n<p>Like the six floors below it, the seventh floor of the Cooper Union&#x2019;s Foundation Building has been transformed into an art gallery&#x2014;Tuesday night was the first night of the annual Cooper Union End of Year Show. The seventh floor is not listed on any official materials, however, because for the past three weeks it has been occupied by students protesting the proposal that the school <a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?pagewanted=all&amp;_r=0\">begin charging undergraduate tuition</a>, a violation, they feel of the Cooper Union&#x2019;s stated mission: &#x201C;The College admits undergraduates solely on merit and awards full scholarships to all enrolled students.&#x201D;</p>\n<p>The first six floors of the Foundation Building feel like a museum&#x2014;antiseptic white, orderly and clean. The floors, walls, and ceiling of the seventh floor have been painted black, and the walls are crowded with art from students, alumni, faculty, and the community at large that embodies Peter Cooper&#x2019;s imperative, &#x201C;Education should be as free as air and water.&#x201D;</p>\n<p>A long black banner hangs outside the Cooper Union President Jamshed Bharucha&#x2019;s office. It reads, in capital red letters: &#x201C;Cooper, what is best in life? To crush your trustees, to see them driven before you, and to hear the lamentations of their accountants.&#x201D; </p>\n<p>As committed as they are to their cause, a sense of playfulness permeates everything about the Free Cooper Union movement. On a table there is a pile of letters on official Cooper Union letterhead&#x2014;indeed, Jamshed Bharucha&#x2019;s personal letterhead. &#x201C;At this time, after much personal deliberation I cannot ignore these students and their growing concerns,&#x201D; it reads. &#x201C;It is with much gratitude and respect that I announce my resignation effective immediately.&#x201D;</p>\n<p>Two paragraphs later, it continues, &#x201C;With great power comes great responsibility,&#x201D; which is from <em>Spiderman</em> and probably the last defense against someone not understanding that this is a joke.</p>\n<p>Two walls of Jamshed Bharucha&#x2019;s corner office are taken up by floor-to-ceiling windows, looking out over Cooper Square and towards the East River. With a pile of sleeping bags jammed in the corner and books, papers, and board games strewn across the conference table it feels a little bit like a treehouse. When it rains, the rainwater streams down a dozen enormous windows and <a href=\"http://saarshemesh.tumblr.com/\">Saar Shemesh</a> told me that she imagines the office is a submarine. Sometimes when the sun rises the new building at 41 Cooper Square looks like it is on fire.</p>\n<p>&#x201C;We are in control here, and they [the Board of Trustees] don&#x2019;t know what to do about it,&#x201D; said Shemesh. They do not expect to be forcibly removed&#x2014;although rumors abound that &#x2018;something&#x2019; is going to happen on Friday&#x2014;and the administration has rescinded all threats of suspension or other internal punishment. And yet, Shemesh continued, &#x201C;I don&#x2019;t think there&#x2019;s anything we could do to get them to talk to us and take what we&#x2019;re saying seriously.&#x201D;</p>\n<p>The occupation so far would not have been possible without help from past graduates: &#x201C;We wouldn&#x2019;t be able to eat without the alumni,&#x201D; said rising sophomore <a href=\"http://oncemorewithweight.tumblr.com/\">Andi Overton</a>. Bharucha&#x2019;s office is also brightened by flowers sent by alumni.</p>\n<p>All of this serves as a weighty counterpoint to Chairman of the Board of Trustees Mark Epstein&#x2019;s complaint during a <a href=\"http://www.democracynow.org/2013/5/16/debate_what_caused_cooper_unions_fiscal\">Democracy Now! debate</a> that part of the school&#x2019;s difficulty in raising revenue has been a lack of financial support from alumni (&#x201C;Traditionally, only 20 percent of our alumni, who have gotten 100 percent scholarships, give back to the school on a regular basis&#x2026; And most&#x2014;some of the loudest voices of our alumni against this new change in policy&#x2026; do not appear on donor lists. So, I question their commitment to the school other than verbal.&#x201D;) Student activist Victoria Sobel countered that there is frustration among many alumni at their inability to give in a way that would go directly towards aiding tuition costs: &#x201C;I have seen many alumni, that would be more than willing to give, if the money could be explicitly saved for covering the tuition costs of students.&#x201D;</p>\n<p>Equally important to the Free Cooper Union movement are the incoming students, the first class to be charged tuition under the current plan&#x2014;indeed, they and all future students are whom the occupiers are fighting for (all current students are guaranteed four years of free tuition). The board used the class as a bargaining chip when, in February, the Dean of Admissions sent an email to all early decision applicants <a href=\"http://cusos.org/student-rally-and-press-conference-for-deferred-early-decision-applicants/\">deferring</a> their admission until the art department faculty approved the tuition hike option.</p>\n<p>The activists of Free Cooper Union plan on holding a series of &#x201C;Disorientation&#x201D; sessions in late August and early September for new students, to educate them on the history of the movement, its mission, and the facts on the ground&#x2014;or the seventh floor, as it were. (The occupiers certainly plan to stick around at least that long, expecting the arrival of a fridge sometime in the next few days.) These sessions are intended to show that there is no barrier to entry to Free Cooper Union. &#x201C;It&#x2019;s not a club,&#x201D; said Shemesh. &#x201C;It&#x2019;s something, hypothetically, for everyone.&#x201D;</p>\n<p>For now, current Cooper Union students have done their best to reach out to incoming first years, hosting Skype sessions for confused high schoolers to ask questions of their future peers. &#x201C;One asked, &#x2018;Do you really think you can win?&#x2019;&#x201D; recalled Shemesh. &#x201C;Of course we do! Why would we be here if we didn&#x2019;t?&#x201D;</p>\n\n<p><em><a href=\"https://twitter.com/OConnorB_\">Brendan O&#x2019;Connor</a>&#xA0;lives in New York. Photo via <a href=\"https://twitter.com/cersonsky/status/339532482338754560\">@cersonsky</a></em></p>\n\n</div>\n      </div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://s23.theawl.com/bill/up/2013/05/Screen-shot-2013-05-29-at-3.03.06-PM-640x312.jpg",
    "title": "Hanging With Free Cooper Union",
    "rendered_pages": 1
}