{
    "domain": "newyork.cbslocal.com",
    "next_page_id": null,
    "url": "http://newyork.cbslocal.com/2013/02/16/report-cooper-union-to-vote-on-whether-to-charge-tuition-to-most-students/",
    "short_url": "http://rdd.me/lcpoihlv",
    "author": null,
    "excerpt": "NEW YORK (CBSNewYork) — Months after Cooper Union students held a sit-in to protest a plan to end free tuition for graduate students, published reports said the school’s board is set to vote on a&hellip;",
    "direction": "ltr",
    "word_count": 268,
    "total_pages": 0,
    "content": "<div class=\"entry-content-textbox\" score=\"47.5\">\n\t\t\t\t\t\n\n<p><strong>NEW YORK (CBSNewYork)</strong> — Months after Cooper Union students held a sit-in to protest a plan to end free tuition for graduate students, published reports said the school’s board is set to vote on a plan that could require tuition for all students.</p>\n<p>A New York Times report Friday said the board is expected to vote next month on a series of measures, including whether to charge tuition to all students except for those who have already applied or enrolled.</p>\n<p>The school’s costs have been outpacing its revenues – particularly from the school’s biggest asset, the land beneath the Chrysler Building, the newspaper reported.</p>\n<p><a title=\"Cooper Union Students Take Over University Clock Tower To Protest Tuition Change\" href=\"http://newyork.cbslocal.com/2012/12/04/cooper-union-students-take-over-university-clock-tower-to-protest-tuition-changes/\">In the fall, students seized the Cooper Union clock tower and said they would not come out until the school agreed to scrap the earlier plan just to charge tuition for graduate students.</a> Eleven students then barricaded themselves in the tower.</p>\n<p>Students have noted that school founder Peter Cooper opened the school with a mission of free education in 1859. Prior to 1902, when the school received a large endowment, students paid for their tuition if they were able to do so, the school told DNAInfo.</p>\n<p>The school’s administration decided not to press charges or suspend the students who occupied the clock tower.</p>\n<p>“Cooper Union has always been supportive of freedom of expression and peaceful demonstrations,” Jolene Travis, the university’s assistant director of communications, said. “We want to know and hear from the students.”</p>\n<p>But school officials have said charging tuition must be considered in the wake of the economic downturn.</p>\n<p><em><strong>Do you think Cooper Union should keep its classes free? Leave your comments below…</strong></em>\n</p>\n\n\n\t\t\t\t</div>\n\t\t\t\t\t\t\t",
    "date_published": "2013-02-16 15:52:00",
    "dek": null,
    "lead_image_url": "http://cbsnewyork.files.wordpress.com/2012/12/cooper-union-protest.jpg?w=260",
    "title": "Report: Cooper Union To Vote On Whether To Charge Tuition To Most Students",
    "rendered_pages": 1
}