{
    "domain": "hyperallergic.com",
    "next_page_id": null,
    "url": "http://hyperallergic.com/70569/breaking-students-occupy-office-of-cooper-union-president/",
    "short_url": "http://rdd.me/hlb0q26q",
    "author": "Mostafa Heddaya",
    "excerpt": "Students occupy offices of Cooper president Jamshed Bharucha (image via Facebook)At roughly 11 am today, a group of 30 students occupied the offices of embattled Cooper Union President Jamshed&hellip;",
    "direction": "ltr",
    "word_count": 445,
    "total_pages": 0,
    "content": "<div><div class=\"format_text entry-content\"><div id=\"attachment_70570\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-70570 \" alt=\"Students occupy offices of Cooper president Jamshed Bharucha (image via Facebook)\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/05/466091_465977830149707_1579715782_o.jpg\" width=\"640\"><p class=\"wp-caption-text\">Students occupy offices of Cooper president Jamshed Bharucha (image via <a href=\"https://www.facebook.com/OccupyWallSt/posts/503612026373233\">Facebook</a>)</p></div><p>At roughly 11 am today, a group of 30 students occupied the offices of <a href=\"http://hyperallergic.com/70219/upheaval-galvanizes-cooper-union/\">embattled</a> Cooper Union President Jamshed Bharucha. Bharucha himself is not present, however, and unlike the previous occupation, the students have not barricaded themselves in and are being allowed to freely enter and exit the building. Black banners signifying the takeover have also been unfurled from the second floor windows of the Foundation Building.</p><p>The student occupation, planned at least one week in advance, coincided with the end of a scheduled 9:30 meeting between student leaders, board chair Mark Epstein, and Bharucha, though the president did not show up to that meeting.&#xA0;When roughly 30 student activists, chiefly from the School of Art but with representation from all three schools, took the corner office on the seventh floor of the Foundation Building, Vice President for Finance and Administration TC Westcott came in, listened to and acknowledged the student statement, and left.</p><p>As of 12:40 pm, there are at least 60 students in Mr. Bharucha&#x2019;s office, and Hyperallergic has learned that at least one faculty member, <a href=\"http://cooper.edu/art/people/lisa-lawley\">Lisa Lawley</a>, briefly joined the students, as have several staff members. The students have been advised that they are free to come and go, and some are discussing bringing in sleeping bags. The students are also delivering a vote of no confidence, though student activist Casey Gollan, a senior in the art school, tells Hyperallergic that it isn&#x2019;t a full vote of the student body, but rather &#x201C;a symbolic gesture on a sheet of paper from a group of students that makes a meaningful statement.&#x201D;</p><div id=\"attachment_70571\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-70571 \" alt=\"Black banners have been unfurled from the second floor of the Foundation Building\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/05/adriana_farmiga_4.jpg\" width=\"640\"><p class=\"wp-caption-text\">Black banners have been unfurled from the second floor of the Foundation Building (image courtesy Tyler Paige)</p></div><p>Asked to describe the goals of the occupying students, Gollan stated that &#x201C;ultimately the action is about showing no confidence in the president. A lot of variables go into something like this &#x2014; yesterday we had a meeting and for everyone in the room success was a bit different, so holding his office is already a successful action.&#x201D;</p><p>The student statement, as released via email by Free Cooper Union, is reproduced below, and we will update this story as the situation develops.</p><blockquote><p>This is a non-violent direct action, you are not being held in this room, you are free to exit when you please. Jamshed Bharucha, we are here today to deliver you a statement of No Confidence from the School of Art, we no longer recognize your presidency at Cooper as legitimate and in so doing we commit to re-claim this office in the interim until a suitable administrative alternative is secured.</p></blockquote> <p class=\"post_tags\">Tagged as: <a href=\"http://hyperallergic.com/tag/cooper-union/\" rel=\"tag nofollow\">Cooper Union</a>, <a href=\"http://hyperallergic.com/tag/free-cooper-union/\" rel=\"tag nofollow\">Free Cooper Union</a>, <a href=\"http://hyperallergic.com/tag/jamshed-bharucha/\" rel=\"tag nofollow\">Jamshed Bharucha</a>, <a href=\"http://hyperallergic.com/tag/occupy/\" rel=\"tag nofollow\">occupy</a></p> </div></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2013/05/466091_465977830149707_1579715782_o.jpg",
    "title": "BREAKING: Students Occupy Office of Cooper Union President",
    "rendered_pages": 1
}