{
    "domain": "www-nc.nytimes.com",
    "next_page_id": null,
    "url": "http://www-nc.nytimes.com/2013/05/30/nyregion/bloomberg-urges-cooper-union-graduates-to-donate.html?=_r=6&",
    "short_url": "http://rdd.me/6frixsmv",
    "author": "VIVIAN YEE",
    "excerpt": "The student protest over Cooper Union's move to charge undergraduate tuition was visible at commencement on Wednesday. Mayor",
    "direction": "ltr",
    "word_count": 640,
    "total_pages": 0,
    "content": "<div id=\"article\" score=\"40.0\">\n\n<div class=\"columnGroup first\" score=\"37.5\">\t\t\t\t\n     <figure class=\"articleSpanImage\" score=\"35.6875\"><span score=\"-2.25\">\n<img src=\"http://graphics8.nytimes.com/images/2013/05/30/nyregion/city-cooper/city-cooper-articleLarge.jpg\" width=\"600\" alt=\"\" border=\"0\"><meta value=\"http://graphics8.nytimes.com/images/2013/05/30/nyregion/city-cooper/city-cooper-articleLarge.jpg\"><meta value=\"600\"><meta value=\"400\">\n<p class=\"caption\">The student protest over Cooper Union's move to charge undergraduate tuition was visible at commencement on Wednesday. </p>\n</span>\n</figure>  \n<nyt_byline>\n</nyt_byline>\n\n<meta name=\"emailThisHash\" value=\"OjSbIBcFOXsOWcTmSs7TNA\"><div class=\"articleBody\">\n<span>\n<meta value=\"The New York Times Company\"><meta value=\"http://www.nytco.com/\"><meta value=\"NYSE NYT\"></span>\n<meta value=\"2013\"><nyt_text><nyt_correction_top></nyt_correction_top><p>\nMayor <a href=\"http://topics.nytimes.com/top/reference/timestopics/people/b/michael_r_bloomberg/index.html?inline=nyt-per\" title=\"More articles about Michael R. Bloomberg.\" class=\"meta-per\">Michael R. Bloomberg</a> opened his address to newly minted <a href=\"http://topics.nytimes.com/top/reference/timestopics/organizations/c/cooper_union_for_the_advancement_of_science_and_art/index.html?inline=nyt-org\" title=\"More articles about Cooper Union for the Advancement of Science and Art\" class=\"meta-org\">Cooper Union</a> graduates on Wednesday with a few well-researched jokes about some of the college’s best-loved institutions: the notoriously difficult professor; the grueling senior project; the campus watering hole.        </p> \n</nyt_text></div>\n\n<div class=\"articleBody\" score=\"30.0\">\n <p>\nBut he soon pivoted to a tradition students hold even dearer: the college’s century-old tuition-free policy, which students have fought this year to preserve as the school announced that financial shortfalls <a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html\">had made charging undergraduate tuition necessary</a> starting with students admitted next year.        </p><p>\nMany students pinned red squares of fabric to their black gowns in solidarity with a protest that has captivated the institution for months. And when Jamshed Bharucha, Cooper Union’s president, spoke during the ceremony, many graduates rose and turned their backs to him. Several floors above, a smattering of younger students watched the online broadcast of the ceremony from the president’s office, which students have been <a href=\"http://www.nytimes.com/2013/05/25/nyregion/cooper-union-protesters-living-high-life-out-of-presidents-office.html\">occupying since May 8</a>.        </p><p>\nMr. Bloomberg said he would not take a side on the tuition issue, but that “as frustrated and as angry as you may be about the school’s present situation, its future really is yours to determine.”        </p><p>\nUrging the graduates to “honor Peter Cooper’s legacy by opening doors for others,” he said: “When you walk out these doors today, do not leave the passion you have shown for this institution and its past and its future behind. Stay involved. Stay committed. And do what Peter Cooper did: Donate what you can.”        </p><p>\nMayor Bloomberg described how he had relied on <a href=\"http://topics.nytimes.com/top/reference/timestopics/subjects/s/student_loans/index.html?inline=nyt-classifier\" title=\"More articles about student loans.\" class=\"meta-classifier\">student loans</a> and a parking attendant job to pay his way through Johns Hopkins, and noted that the graduates were lucky to have had their educations financed by Peter Cooper’s original gift.        </p><p>\n“The debate you’re having really isn’t about whether education is free,” he added. “It’s really a debate about who can and who is willing to pay for it.”        </p><p>\nMr. Bloomberg, who <a href=\"http://www.nytimes.com/2013/01/27/nyregion/at-1-1-billion-bloomberg-is-top-university-donor-in-us.html\">has given $1.1 billion</a> to his alma mater, more than any living donor has given to any educational institution, recalled that he had been able to afford only a $5 donation one year after graduation.        </p><p>\nTouching on the struggle for gay rights and the gun control movement, he charged the graduates with carrying on the school’s tradition of helping to effect social change.        </p><p>\nJames Sprang, the student speaker at commencement, did not side step the tuition issue.        </p><p>\nThe current class “may be one of the last to bear witness to the enduring strength of a mission statement that will never be forgotten,” he said, before leading the graduates in an Occupy Wall Street-style “mic check.” “Thank you, Peter Cooper!” they chanted.        </p><p>\nIn the hallways outside the president’s office, students have assembled a rogue art show of protest fliers, embellished photos of Mr. Bharucha and other donated works. They plan to open the space to guest speakers, they said, and are optimistic that their demands — for Mr. Bharucha to resign, for the board to be restructured and for students to have a voice in school governance — will be met.        </p><p>\nBut in the meantime, they are settling in for the summer. A few protesters who intend to live in the office have already sublet their apartments.        </p><p>\nSome graduates, like Brandon Ndife, 22, said they were disappointed with what they saw as Mr. Bloomberg’s evasion of the free education issue.        </p><p>\nYet, reflecting on graduation, Mr. Ndife echoed the mayor’s message. “If anything,” he said, the experience of protesting has made his class determined to be “aware and active alumni, now that we’re out of school. I’m really looking forward to being an alum of the school, helping out whatever way I can.”        </p><p>\nNearby, a life-size model of Peter Cooper sat in the sun. Someone had affixed a red square to his lapel.        </p><nyt_correction_bottom score=\"7.5\">\n</nyt_correction_bottom><nyt_update_bottom></nyt_update_bottom></div>\n</div>\n\n\n\n\n\n\n\n\n\n\n\n\n</div>\n",
    "date_published": "2013-05-29 00:00:00",
    "dek": null,
    "lead_image_url": "http://graphics8.nytimes.com/images/2013/05/30/nyregion/city-cooper/city-cooper-articleLarge.jpg",
    "title": "Amid Protests Over Free Tuition, Mayor Urges Graduates to Donate",
    "rendered_pages": 1
}