{
    "domain": "eastvillage.thelocal.nytimes.com",
    "next_page_id": null,
    "url": "http://eastvillage.thelocal.nytimes.com/2012/12/04/cooper-union-occupiers-get-pizza-delivered-via-balloons/",
    "short_url": "http://rdd.me/0pkfv4bp",
    "author": "DANA VARINSKY and ALEXA MAE ASPERIN",
    "excerpt": "The lock-in is being livestreamed here. At today’s press conference. If you were wondering how the students who seized the eighth floor of Cooper Union’s Foundation Building were going to get hot&hellip;",
    "direction": "ltr",
    "word_count": 424,
    "total_pages": 0,
    "content": "<div class=\"entry-content\" score=\"35.0\">\n\t\t\t<div class=\"w500\"> <span class=\"caption\">The lock-in is being livestreamed <a href=\"http://www.livestream.com/occupynyc\">here</a>.</span></div>\n<div class=\"w240 right\"><a title=\"IMG_5797 by The Local East Village Flickr, on Flickr\" href=\"http://www.flickr.com/photos/local-east-village/8245792982/\"><img src=\"http://farm9.staticflickr.com/8344/8245792982_82b3014105_m.jpg\" alt=\"IMG_5797\" width=\"240\"></a> <span class=\"caption\">At today’s press conference.</span></div>\n<p>If you were wondering how the students who <a href=\"http://eastvillage.thelocal.nytimes.com/2012/12/04/four-floors-below-cooper-union-occupiers-a-solidarity-sleepover/\">seized the eighth floor</a> of Cooper Union’s Foundation Building were going to get hot meals, here’s your answer: this afternoon, supporters delivered pizza to them by stringing it up with dozens of balloons.</p>\n<p>According to Joe Riley, a junior in the art school who is one of the twelve currently barricaded inside, the Two Boots pizza (fancier than his usual fare) was sent up by the <a href=\"http://www.thebrucehighqualityfoundation.com/Site/home.html\">Bruce High Quality Foundation</a>, an artist group made up of Cooper Union alums. “The pizza delivery today was really just a show of a support,” he said. “We didn’t really need it. We came in here with plenty of food.”</p>\n<p>Nevertheless, the students were happy to snag it. “They just made the catch,” said Tyler Paige, another occupier.</p>\n<p>The delivery, photos of which appeared <a href=\"https://twitter.com/hillarybliss/status/276084877839986688\">on Twitter</a>, came shortly after a press conference in which senior art students Rachel Appel and Audrey Snyder, speaking on behalf of the occupiers outside of the building, said tuition would be “the end” of the art school.<br><span id=\"more-41666\"></span></p>\n<div class=\"w240 right\"><a title=\"Rachel Appel by The Local East Village Flickr, on Flickr\" href=\"http://www.flickr.com/photos/local-east-village/8245791658/\"><img src=\"http://farm9.staticflickr.com/8479/8245791658_b6de773bc4_m.jpg\" alt=\"Rachel Appel\" width=\"240\"></a></div>\n<p>“The administration is placing an emphasis on profitability rather than quality education,” said Ms. Snyder, later adding, “Students cannot afford the rising costs of education that is required to make a livable wage. This is an endless cycle of debt, burden and lack of equal opportunity.”</p>\n<p>“We’re not fighting for ourselves,” said Ms. Appel. “We’re fighting for people who have not yet come to Cooper and want them to have the same experiences we had.”</p>\n<p>According to Ms. Appel, the Cooper Union administration has made a formal statement to her asking the occupiers to leave, but the students won’t do so until their demands are met.</p>\n<p>Mr. Riley told The Local that he learned after the press conference that Jolene Travis, Cooper Union’s Assistant Director of Public Affairs and Media Relations, had been passing out flyers outlining a brief university response. The students are currently hashing out a reply.</p>\n<div class=\"w240 right\"><a title=\"Occupiers looking down from 8th floor by The Local East Village Flickr, on Flickr\" href=\"http://www.flickr.com/photos/local-east-village/8244725905/\"><img src=\"http://farm9.staticflickr.com/8478/8244725905_b1bdec2c94_m.jpg\" alt=\"Occupiers looking down from 8th floor\" width=\"240\"></a> <span class=\"caption\">Occupiers look down from 8th floor.</span></div>\n<p>At the end of the press event, students, faculty and other supporters chanted “Free as air and water” as they looked up to the twelve occupiers.</p>\n<p>As the standoff enters its second night, Mr. Riley said he and his colleagues are making themselves at home. “It’s kind of like sleeping on somebody’s couch or floor or something,” he said. “It’s been a little chilly at night, but we have a lot of sleeping bags and blankets and stuff like that, so we’re pretty well equipped.”</p>\n\t\t</div>\n\t",
    "date_published": "2012-12-04 19:20:00",
    "dek": null,
    "lead_image_url": "http://farm9.staticflickr.com/8344/8245792982_82b3014105_m.jpg",
    "title": "Talk About Pie in the Sky: Cooper Lock-Ins Get Floating Pizza Delivery",
    "rendered_pages": 1
}