{
    "domain": "www.thenation.com",
    "next_page_id": null,
    "url": "http://www.thenation.com/blog/171576/students-occupying-cooper-union-insist-founders-vision",
    "short_url": "http://rdd.me/pll6nzpg",
    "author": "Isabelle Nastasia",
    "excerpt": "The clock tower of the Foundation Building of Cooper Union on 3rd Avenue and 7th Street in Manhattan stopped at 12:40 pm on December 3 signifying the start to the occupation of the Peter Cooper&hellip;",
    "direction": "ltr",
    "word_count": 835,
    "total_pages": 0,
    "content": "<div><div class=\"content\"><p>The clock tower of the Foundation Building of Cooper Union on 3rd Avenue and 7th Street in Manhattan stopped at 12:40 pm on December 3 signifying the start to the occupation of the Peter Cooper suite, a studio room behind the clock where twelve students barricaded themselves yesterday. The students mounted the protest to urge the school not to begin charging tuition to undergraduates.</p>\n<p>\tThe taking of the 8th floor was followed by the quick arrival of security staff and administrators who tried to literally saw their way through the bolted door. These attempts were put on hold out of fear of injuring the students that were physically defending the space with their bodies pressed against the barricades.</p>\n<p>\tAside from military schools across the US, Cooper Union is one of eight free higher education institutions in the country. Founded by philanthropist Peter Cooper in 1859, the school is known for its rigorous admissions program and a curriculum providing free, high-quality education for the brightest and most innovative budding engineers and artists from all over the world. Cooper himself asserted that university was founded on the idea that education at the institution would be as &#x201C;free as air and water&#x201D;, and its mission being to create access to art education to students regardless of their race, religion, sex, wealth or social status.</p>\n<p>\tLike the City University of New York [a public institution that first implemented tuition in 1975, at which the cost of education has gone up 500% for students since], Cooper Union was free through the Great Depression. However, over the past several years the Board of Trustees have been devising plans to address the institution's growing deficit of 16.5 million dollars, largely the result of an expansion plan, by shifting the weight of administrative spending onto the shoulders of students and their families.&#xA0; The school says it has not made a decision on charging tuition for undergraduates but in April, it broke precedent by charging tuition to graduate students for the first time in its 110-year history.</p>\n<p>\tThe twelve occupiers students along with the group, Students for a Free Cooper Union, released a statement with three tough demands:</p>\n<p>\t1) The administration publicly affirm the college&#x2019;s commitment to free education.<br>\n\t2) The Trustees must immediately implement structural changes with the goal of creating open flows of information and democratic decision-making structures.<br>\n\t3) The President of the college, Mr. Bharucha, step down from his position.</p>\n<p>\tIn the evening, the students put on a session on education and debt in the Great Hall of Cooper Union that involved performances, presentations, videos and a brief livestream of the occupiers from a mere seven floors above the gathering.</p>\n<p>\tWriter and organizer Marina Sitrin began the session by locating the current occupation of Cooper Union in the larger context of social movements across the globe, from the Arab Spring to the anti-austerity movement of Chile to the #YoSoy132 movement in Mexico to the student movement that successfully stopped the proposed tuition increase in Quebec. Sitrin asserted that what makes our movements significant and also threatening to the status-quo is that they are not only movements of refusal and the rejection of policies that do not reflect the world we want to see but also movements of creation, where we assemble, learn from one another, make art, and build social relations that are pre-figurative.</p>\n<p>\tThe occupying students themselves are not only refusing to allow their institution to implement tuition for students that will come after them (they are not self-interested, but are hell-bent on protecting the integrity of their school for future generations to come) but also outside while they reclaimed the interior of their school building, fellow students and allies providing free and participatory classes outside through the Free University--providing a creative and pre-figurative component to the protest.</p>\n<p>\tSitrin also stressed that what&#x2019;s especially exciting about the last year is how we have been able to borrow strong messaging, tactics, strategy and imagery from other successful social movements and have thus built a dialectic relationship across the globe in the process. The occupation of Peter Cooper suite was a prime example of how students in the US are learning from other student struggles: the bright red bannering was reminiscent of the Quebec student strike of 2012, the messaging of &#x201C;free education for all&#x201D; was similar to that of the banner drops and signs at CUNY student protests over the past several years.</p>\n<p>\tThe students continue to occupy the space today. When they will leave or be ejected is anyone's guess. Moving forward, examples of grassroots struggle for social change abound. In New York City, where I live, the Cooper Union struggle to remain a tuition-free institution may yet be tied together with the continuous organizing in communities post-Hurricane Sandy, the fast food workers strikes that occurred late last week and the new Rolling Jubilee that buys people&#x2019;s anonymous debt for pennies on the dollar and broader movements across workers, students, housing and other social struggles.</p>\n<p>\tThis is what democracy looks like.</p>\n</div></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.thenation.com//sites/default/files/cover1217-tilt.jpg",
    "title": "Students Occupying Cooper Union Insist on Founder's Vision",
    "rendered_pages": 1
}