{
    "domain": "studentactivism.net",
    "next_page_id": null,
    "url": "http://studentactivism.net/2013/02/20/cooper-union/",
    "short_url": "http://rdd.me/kwwkmg6c",
    "author": null,
    "excerpt": "Cooper Union students&#x2019; fight to preserve the college&#x2019;s century-plus tradition of free tuition is kicking into gear again, as administrative dithering and blackmail has thrown the new&hellip;",
    "direction": "ltr",
    "word_count": 399,
    "total_pages": 0,
    "content": "<div><div class=\"post-content\">\n\t\t<p>Cooper Union students&#x2019; fight to preserve the college&#x2019;s century-plus tradition of free tuition is kicking into gear again, as administrative dithering and blackmail has thrown the new entering class into disarray.</p>\n<p>Two of the three schools that make up CU have submitted proposals for integrating tuition into their budgets going forward, but the third &#x2014; the School of Art &#x2014; has refused to do so, saying that they will not cooperate with &#x201C;any solution to The&#xA0;Cooper Union&#x2019;s current financial crisis that depends, even in part, on tuition&#xA0;compromises and irreversibly damages the ideals of art, education, freedom,&#xA0;and citizenship.&#x201D;</p>\n<p>In retaliation for this act of defiance, Cooper Union president&#xA0;Jamshed Bharucha <a href=\"http://cooper.edu/about/news/update-academic-and-financial-planning-21313\">announced last week</a> that the college would not honor the School of Art&#x2019;s decisions on its early admission applicants, and would instead inform those applicants that they would be considered as part of the general admissions process later in the spring.</p>\n<p>The most immediate result of this retaliation against the School of Art is to weaken their applicant pool &#x2014; and, by extension, the student body and reputation of Cooper Union itself. By announcing that the school to which they applied does not intend to honor their commitment to the early admissions process, and that it in fact has no &#x201C;sustainable model&#x201D; for operating in the future, Cooper Union will surely drive many of those applicants &#x2014; the very students who were most committed to enrolling at CU &#x2014; to other colleges.</p>\n<p>As I wrote last fall, <a href=\"http://studentactivism.net/2012/12/12/how-tuition-hurts-colleges/\">Cooper Union&#x2019;s reputation rests more than usually on the quality of its students</a>. To dilute the college&#x2019;s applicant pool as part of an attempt to force recalcitrant faculty to accede to administration policies they abhor is an astoundingly short-sighted and pernicious act.</p>\n<p>It is, as a group of activist students at Cooper Union have said, <a href=\"http://cusos.org/student-rally-and-press-conference-for-deferred-early-decision-applicants/\">a betrayal</a>:</p>\n<p>These applicants have gone above and beyond their due diligence in holding up their end of the application process &#x2026;&#xA0;applicants and their families were told on numerous occasions by administrators, the school&#x2019;s official website, and admissions literature that the incoming class of 2017 would not be affected by the financial struggles plaguing the Cooper Union.</p>\n<p>Cooper Union students, who last semester <a href=\"http://studentactivism.net/2012/12/07/free-cooper-union-occupation-rolls-on/\">occupied a campus building for most of a week</a> in opposition to the tuition plan, <a href=\"http://cusos.org/student-rally-and-press-conference-for-deferred-early-decision-applicants/\">will be holding a rally</a> in support of the deferred students at one o&#x2019;clock this afternoon.</p>\n<p>More to come.</p>\n<div id=\"jp-post-flair\" class=\"sharedaddy sd-like-enabled sd-sharing-enabled\"><div class=\"sd-block sd-like jetpack-likes-widget-wrapper jetpack-likes-widget-unloaded\" id=\"like-post-wrapper-3467503-9146\"><h3 class=\"sd-title\">Like this:</h3><p class=\"post-likes-widget-placeholder\"><span class=\"button\"><span>Like</span></span> <span class=\"loading\">Loading...</span></p><a class=\"sd-link-color\"></a></div></div>\t</div>\n\t\t</div>",
    "date_published": "2013-02-20 00:00:00",
    "dek": null,
    "lead_image_url": null,
    "title": "Cooper Union",
    "rendered_pages": 1
}