{
    "domain": "www.artinamericamagazine.com",
    "next_page_id": null,
    "url": "http://www.artinamericamagazine.com/news-opinion/news/2013-02-04/cooper-union-faculty-opposes-tuition-based-programs/",
    "short_url": "http://rdd.me/jitcvlpq",
    "author": "Brian Boucher",
    "excerpt": "The faculty of the Cooper Union School of Art released a statement Friday opposing all tuition-based programs at the school, which has offered free education for over a century. The statement refers&hellip;",
    "direction": "ltr",
    "word_count": 422,
    "total_pages": 0,
    "content": "<div><div>\n\t\t\t\t\t\t  <p>The faculty of the Cooper Union School of Art released a statement Friday opposing all tuition-based programs at the school, which has offered free education for over a century. The statement refers to a \"subtly coercive\" charge issued to the faculty by dean Saskia Bos in September 2012 \"to work with her to develop academic solutions that address the current financial shortfall.\"</p><p><img id=\"image_19325\" class=\"news_op_image\" alt=\"\" src=\"http://www.artinamericamagazine.com/files/2013/02/04/img-cooper_120155599477.jpg_standalone.jpg\" width=\"291\">Last fall, new president <a href=\"http://bit.ly/u27RBM\">Jamshed Bharucha</a> revealed that a financial crisis might compromise the New York college's commitment to tuition-free education at its schools of art, engineering and architecture, leading to <a href=\"http://bit.ly/WM5om4\">student walkouts</a> and continuing <a href=\"http://bit.ly/XiIAPz\">protests</a>. In April 2012, <a href=\"http://bit.ly/J7H2LI\">the school announced</a> that it would begin to charge tuition of architecture graduate students this year.</p><p>\"The Faculty of The School of Art opposes the very principle of generating revenue through tuition from academic programs,\" says the statement, which reaffirms the faculty's belief that \"the Cooper Union is not only the last citadel of the social reforms movement of the 19th century, but is in fact the vanguard of the 21st century&#x2014;a beacon of access to free education.\"</p><p>Besides, the faculty argues that tuition-based solutions to the school's financial woes would probably be impractical, said Day Gleeson, associate professor and academic advisor, speaking to <em>A.i.A.</em> by phone Monday, in view of the financial crisis at conventionally financed colleges and universities.</p><p>\"The possibilities we imagined,\" Gleeson said, \"were to offer MFA programs and certificate programs that would charge tuition to support undergraduate scholarships. But in the end we realized that after the cost of ramping them up, the possibility of getting any revenue from them was almost nil.\"</p><p>\"The shortfall is so great,\" Gleeson continued, \"that the tuition of 50 graduate students is not going to make a huge difference, and we would be destroying the very thing that makes Cooper unique.\"</p><p>Applications for undergraduate programs have dropped in the last few years as there are fewer and fewer people graduating from high school as a result of demographic shifts, Gleeson pointed out, presaging a smaller future pool for possible revenue-generating graduate and certificate programs.</p><p>Gleeson noted that the statement was approved by the nine full-time faculty, where Gleeson is joined by professors including Dennis Adams, Sharon Hayes and Walid Raad; three student representatives; three representatives of the adjunct faculty; and three \"proportional full-time faculty.\"</p><p>What happens now?</p><p>\"We have a three-hour meeting with the president tomorrow,\" Gleeson said, \"and faculty across the schools have started meeting on their own as have the faculty as a whole.\"</p><p>\"At this time,\" she added, \"we are accepting students and committing to full scholarships for them.</p>    \n\t\t\t\t\t</div>\n\t\t\t\t\t\n                    \n\t\t\t\t</div>",
    "date_published": "2013-02-04 00:00:00",
    "dek": null,
    "lead_image_url": "http://www.artinamericamagazine.com/files/2013/02/04/img-cooper_120155599477.jpg_standalone.jpg",
    "title": "Cooper Union Faculty Opposes Tuition-Based Programs",
    "rendered_pages": 1
}