{
    "domain": "nyunews.com",
    "next_page_id": null,
    "url": "http://nyunews.com/index.php/2012/12/09/cooper-3/14915",
    "short_url": "http://rdd.me/edund0ov",
    "author": null,
    "excerpt": "An &#x201C;all-school&#x201D; meeting was held Thursday night almost equally representing the engineering, art and architect schools. During the event, the students were split up into groups and had&hellip;",
    "direction": "ltr",
    "word_count": 511,
    "total_pages": 0,
    "content": "<div><div class=\"text\">                \n                \n\t\t\t\t<p>An &#x201C;all-school&#x201D; meeting was held Thursday night almost equally representing the engineering, art and architect schools. During the event, the students were split up into groups and had the opportunity to meet those from other schools and tour each other&#x2019;s buildings. It was an opportunity for the three schools to show one another their work, including labs, art and designs.</p>\n<p>The meeting, held in the new academic building&#x2019;s Rose Auditorium, was a start to the unification of Cooper Union&#x2019;s three schools: Engineering, Art and Architecture. Vincent Hui, a third-year architecture student, said the purpose of the meeting was to gain a mutual understanding of the situation and define their goals.</p>\n<p>&#x201C;We realized we actually have a very clear goal, a clear idea of what we want to accomplish, which is to maintain free education,&#x201D; said Hui.</p>\n<p>A first-year transfer student in Cooper Union School of Art, Saar Shemesh said the divide between the arts and engineering students are working to be resolved.</p>\n<p>&#x201C;It seems like there&#x2019;s never been this strong of a divide between the schools but there also has never been much care and passion devoted to wanting to make sure that that divide doesn&#x2019;t deunite us,&#x201D; said Saar Shemesh, &#xA0;&#x201C;Although there is a lot of opposition, there&#x2019;s also a lot of room for unification and it was just really great to see everybody out there and everybody that cares.&#x201D;</p>\n<p>Jenny Eagleton, Administrative Chair for Arts Student Council, said the president is exploiting the perceived gap between support for the protest in the arts school and the rest of the institution, particularly engineering. She said the President is generalizing the protest as an &#x201C;arts school shenanigans.&#x201D;</p>\n<p>&#x201C;The president has been co-opting that kind of language to act like this isn&#x2019;t the whole university,&#x201D; said Eagleton.</p>\n<p>Controversy lingers as to whether Cooper Union President Jamsched Barucha, who was recently appointed in July of 2011, should step down.</p>\n<p>Shemesh said the president should step down due to unfair spending and lack of momentum in fundraising. The institution raised $9.6 million last year, but three million dollars was spent on a paperless registering program for class registration, but the system failed to work, according to Shemesh.</p>\n<p>&#x201C;The way that the administration is spending money is really frivolous and it doesn&#x2019;t seem like it&#x2019;s being managed correctly,&#x201D; said Shemesh. &#x201C;What we&#x2019;re asking for is more transparency with the Board of Trustees and that decisions be made more holistically and with student representations, either at the meetings or having the minutes from the meetings posted.&#x201D;</p>\n<p>But Robin Giordani, a third-year art student, doesn&#x2019;t necessarily think the president&#x2019;s dismissal is the answer.</p>\n<p>[President Barucha&#x2019;s] serving us as students&#x2014;he&#x2019;s not serving the administration and I think he&#x2019;s gotten that confused,&#x201D; said Giordani. &#x201C;I think stepping down would just create more unrest and it&#x2019;s more about moving forward from here in a positive direction than bringing us back in another hole.&#x201D;</p>\n<p>The next Board of Trustees meeting is scheduled for January.</p>\n<p><em>Additional reporting by Kevin Burns and Andrew Karpan. Kayana Jean-Philippe is deputy city/state editor. Email her at <a href=\"mailto:kjeanphillipe@nyunews.com\">kjeanphilippe@nyunews.com</a>.&#xA0;</em></p>\n\t\t\t\t\t\n                \t\t\t</div>\t\n            \n            \n            \n\t\t\t</div>",
    "date_published": "2012-12-09 00:00:00",
    "dek": null,
    "lead_image_url": null,
    "title": "At Cooper, art and engineering students feel divide",
    "rendered_pages": 1
}