{
    "domain": "www.businessinsider.com",
    "next_page_id": null,
    "url": "http://www.businessinsider.com/cooper-union-learns-an-expensive-lesson-about-hedge-funds-2013-5",
    "short_url": "http://rdd.me/fgpuiqez",
    "author": "Simon Lack",
    "excerpt": "The New York Times has a story highlighting what can happen when well-intentioned but financially unsophisticated trustees of a college endowment interact with the wrong kind of financial advisors.&hellip;",
    "direction": "ltr",
    "word_count": 142,
    "total_pages": 0,
    "content": "<div score=\"27.5\"><div class=\"KonaBody post-content\" score=\"26.25\">\n\t\t\t\n            \n<p>The New York Times has a <a href=\"http://www.nytimes.com/2013/05/11/business/how-cooper-unions-endowment-failed-in-its-mission.html?pagewanted=all\" rel=\"nofollow\">story </a>highlighting what can happen when well-intentioned but financially unsophisticated trustees of a college endowment interact with the wrong kind of financial advisors. It&#x2019;s a sorry tale of poor portfolio construction and imprudent debt capped off with a Hail Mary type lunge for hedge funds that it was hoped would solve their problems with 10% returns. Regrettably, a desired return is no substitute for a realistic expectation of one, and the consequences are now being felt widely within the school. Where are the consultants today who advised Cooper Union to expect a 10% return from hedge funds? They&#x2019;re probably investing the fees they earned in something more reliable &#x2013; perhaps even back in to their consulting business.</p>\n<br><a href=\"http://feeds.wordpress.com/1.0/gocomments/inpursuitofvalue.wordpress.com/974/\" rel=\"nofollow\"></a> <p><b>Read more posts on <a href=\"http://inpursuitofvalue.wordpress.com/\" rel=\"nofollow\">In Pursuit of Value &#xBB;</a></b></p>\n<p class=\"tagline\">This article originally appeared at <a href=\"http://inpursuitofvalue.wordpress.com/\">In Pursuit of Value</a>.  Copyright 2014.</p>\n            \n\t\t\t\t\t</div>\n\n            \n\n        </div>",
    "date_published": "2013-05-10 00:00:00",
    "dek": null,
    "lead_image_url": null,
    "title": "Cooper Union Learns An Expensive Lesson About Hedge Funds",
    "rendered_pages": 1
}