{
    "domain": "friendsofcooperunion.org",
    "next_page_id": null,
    "url": "http://friendsofcooperunion.org/5-2013-email/",
    "short_url": "http://rdd.me/qrximkws",
    "author": null,
    "excerpt": "Dear Alumni of The Cooper Union, This has been the most important week in Cooper Union&#x2019;s recent history. A massive&#xA0;student occupation of the President&#x2019;s 7th floor officehas brought&hellip;",
    "direction": "ltr",
    "word_count": 937,
    "total_pages": 0,
    "content": "<div><div class=\"post-content\">\n<p>Dear Alumni of The Cooper Union,</p>\n<p>This has been the most important week in Cooper Union&#x2019;s recent history. A massive&#xA0;<a href=\"http://e2.ma/click/nu4zd/n26yod/vgra9\">student occupation of the President&#x2019;s 7th floor office</a>has brought about a community-wide&#xA0;<a href=\"http://e2.ma/click/nu4zd/n26yod/b9ra9\">No Confidence vote&#xA0;</a>against the President and Board Chairman. It has also sparked the disclosure of important new financial information explaining exactly what happened, while also suggesting Cooper can remain free. Together these events have generated an outpouring of letters to the President and Board.&#xA0;The most striking, written by the parents of student and Irma Giustino Weiss Fellowship and Benjamin Menschel Fellowship recipient Joe Riley, is attached at the bottom of this message.</p>\n<div>\n<p><strong>What Really Happened to Cooper&#x2019;s Finances</strong></p>\n<p>Meanwhile, the NY Times has&#xA0;<a href=\"http://e2.ma/click/nu4zd/n26yod/r1sa9\">published an important admission</a>&#xA0;from one of Cooper&#x2019;s trustees. It affirms that the decision to charge tuition is not a financial necessity but an ideological choice at odds with the mission of the college. Trustee John Michaelson disclosed to the Times that Cooper actually can sustain itself until 2018, when the college receives a significant increase in revenue from its Chrysler lease. Michaelson brushes this confession aside by asking what kind of college Cooper would be by then, without charging tuition. As Felix Salmon&#xA0;<a href=\"http://e2.ma/click/nu4zd/n26yod/7tta9\">wrote the next day</a>, &#x201C;the answer, of course, is a free one.&#x201D;</p>\n</div>\n<div>\n<p>Salmon also discusses the trustees&#x2019; investment committee&#x2019;s overreliance on hedge funds, then clearly identifies the &#x201C;colossal, fatal error made by Cooper&#x2019;s trustees:&#x201D; a $175MM mortgage they had &#x201C;no idea&#x201D; how to ever repay. How much ground Cooper might have gained in the last two years if the President and Chairman, instead of blaming the alumni and calling Cooper&#x2019;s century-and-a-half financial model &#x201C;unsustainable,&#x201D; had come clean with everyone about all of this from the get-go, and been as principled and unwavering in their support of Cooper Union as its students?</p>\n</div>\n<div>\n<p><strong>A &#x201C;Poisoned and Dangerous Atmosphere&#x201D;</strong></p>\n<p>On a scarier note, the administration&#x2019;s response to the protest has endangered students. As&#xA0;<a href=\"http://e2.ma/click/nu4zd/n26yod/nmua9\">reported by an architecture student</a>&#xA0;participating in the protest, &#xA0;&#x201C;the administration posted armed, plainclothes guards inside the foundation building, blocked off emergency fire exits, and attempted to seal off the student&#x2019;s access to water and bathrooms. These guards had no visible ID, were wearing no uniforms, and were unannounced to the community. When asked by students if they were armed, several guards acknowledged this fact, one even going so far to tell a student that he had a gun and &#x201C;is authorized to use it if need be.&#x201D; These actions violate Cooper&#x2019;s own security policy and NYC building and fire codes. In this time where gun violence in schools is of highest concern, we cannot conscience a leadership that treats security and safety issues as &#x201C;needless apprehension,&#x201D; to quote a May 11 message from Bharucha.</p>\n</div>\n<div>\n<p>To add insult to injury: two alumni, Milton Glaser and Lois Swirnoff, proceeded to accuse Cooper students of creating a &#x201C;poisoned and dangerous atmosphere,&#x201D; via a Change.org petition encouraged by Chairman Epstein and intended to counter the No Confidence vote. This accusation would seem to neglect the fact that the students are not the ones who cost the school millions of dollars in hedge fund losses, took out a $175 million mortgage knowing the school could not repay it, circumvented all principles of good institutional governance, treated the mission as if it were written in disappearing ink, brought firearms into Cooper Union and blocked off emergency exits. Nor are the students the ones who included an alumni&#x2019;s name without his consent at the bottom of the counter-petition letter: alumnus Juan Permuy says his name was used without his permission and has asked to be removed from the list.</p>\n</div>\n<div>\n<p><strong>Let the Students and Faculty Lead Cooper Back to Higher Ground</strong></p>\n</div>\n<div>What these students have done is what no administrator or trustee has been able to do for Cooper Union in decades: elevate the question of why Cooper matters to a local, national and even global level. Messages of unequivocal support for Cooper&#x2019;s mission have come from as far away as Kyrgyzstan and as close to home as the City University of New York. As Joe Riley&#x2019;s parents trenchantly observe in a letter to Chairman Epstein, the world has been watching on the occupation&#x2019;s livestream as &#x201C;anywhere from 30 to 100+ students are furiously typing on laptops, texting or talking on phones, communicating with the larger community and generating plans, websites, ideas and even art work to move forward on the issues.&#x201D; Any institutional malaise has been transformed by these students into something that lives, breathes and loves with fierceness and intelligence. This irrepressible, irresistible devotion &#x2013; to what Cooper has meant for over 150 years, still means today more than ever, and might still mean for future generations &#x2013; should be celebrated for the spirit it has restored within Cooper&#x2019;s walls and ought to be deployed toward an effort to heal the school financially.<p>\nAs the students and faculty now maintain, what we need is a Five Year Plan and leadership that embraces not suppresses the passion and creative energy of the students, faculty, alumni and staff. Thousands of students, faculty, staff, alumni and friends have lost all confidence this can still happen if the current leadership remains in place. In a week&#x2019;s time, the Board has lost all moral high ground, inadvertently announced to the world that Cooper Union can make it to 2018 without ending the full-tuition scholarship policy, and has finally been forced to publicly acknowledge the gross financial mismanagement of the school&#x2019;s resources. Questions about President Bharucha&#x2019;s plans to expand and globalize this small, mission-driven college still abound.</p><p>\nEnough is enough. For all the above reasons, we respectfully ask all alumni consider signing this vote of No Confidence:<a href=\"http://e2.ma/click/nu4zd/n26yod/3eva9\">http://friendsofcooperunion.org/vote-no-confidence</a>.</p></div>\n<br><a href=\"http://friendsofcooperunion.org/5-2013-email/\" title=\"Print page\" class=\"cleanprint-exclude\"><img src=\"http://cache-02.cleanprint.net/media/pfviewer/images/CleanPrintIcn_32x32.png\"></a><a href=\"http://friendsofcooperunion.org/5-2013-email/\" title=\"PDF page\" class=\"cleanprint-exclude\"><img src=\"http://cache-02.cleanprint.net/media/pfviewer/images/PdfIcn_32x32.png\"></a><a href=\"http://friendsofcooperunion.org/5-2013-email/\" title=\"Email page\" class=\"cleanprint-exclude\"><img src=\"http://cache-02.cleanprint.net/media/pfviewer/images/EmailIcn_32x32.png\"></a>\n\t\t\t\t</div>\n                \n            </div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://cache-02.cleanprint.net/media/pfviewer/images/CleanPrintIcn_32x32.png",
    "title": "Letter to Alumni from Free Cooper Union, CUSOS, Friends of Cooper Union",
    "rendered_pages": 1
}