{
    "domain": "fsrn.org",
    "next_page_id": null,
    "url": "http://fsrn.org/audio/headlines-thursday-may-23-2013/12040",
    "short_url": "http://rdd.me/ezdqm8ey",
    "author": null,
    "excerpt": "Military sexual assault legislation introduced in Congress A bi-partisan group of lawmakers today introduced two bills that would crack down on perpetrators of sexual assault in the military. One is&hellip;",
    "direction": "ltr",
    "word_count": 869,
    "total_pages": 0,
    "content": "<div><div class=\"content\"><div class=\"audio-node block\">\n<p class=\"item-list\"></p></div>\n<p><b>Military sexual assault legislation introduced in Congress</b></p>\n<p>A bi-partisan group of lawmakers today introduced two bills that would crack down on perpetrators of sexual assault in the military. One is called the &#x201C;Be Safe Act.&#x201D;&#xA0; Maine Republican Susan Collins says it eliminates the five year statute of limitations on sexual assault cases and&#x2026;</p>\n<p>&#x201C;It mandates that any service member who is convicted by a court martial of committing rape or other sexual assault will receive a dishonorable discharge from the service.&#x201D;</p>\n<p>The bill also prohibits commanding officers from throwing out a court martial conviction. In a high-profile example of this practice, an Air Force General threw out the sexual assault conviction of a Colonel under his command earlier this year. The second bill brings the Coast Guard under the same sexual assault rules governing the rest of the military. Senator Collins referred to a recent Pentagon report revealing 26,000 cases in 2012. She called sexual assault in the military an epidemic.</p>\n<p>&#x201C;It is important that we have as many people involved in fixing this problem, in bring this to an end. And ensuring that the policy of &#x2018;no-tolerance&#x2019; becomes the culture of &#x2018;no-tolerance&#x2019; in the military.&#x201D;</p>\n<p>Just this week two cases of military impropriety have been exposed &#x2013; in one case the Commanding General at Ft. Jackson in South Carolina was suspended following an altercation with a woman. In another, a male Sergeant at West Point is accused of planting hidden cameras in women&#x2019;s showers and locker rooms.</p>\n<p><b>Cooper Union student occupation continues into 3rd week</b></p>\n<p>Students at Manhattan&#x2019;s Cooper Union have now been occupying the college&#x2019;s administrative offices for two weeks, demanding that it remain tuition-free. It&#x2019;s the second time that Cooper students have staged an occupation in the past six months, following a one-week sit-in of the same building in December.&#xA0; FSRN&#x2019;s Carla Green reports from New York City.</p>\n<p><i>The Cooper Union Board of Trustees recently came down with a contentious decision to resolve the school&#x2019;s financial woes by charging tuition for the first time in over a century, beginning with freshman coming in in fall 2014. On May 8th, a group of students moved into President Jamshed Barucha&#x2019;s office and declared an occupation. Since then, their cause has led to an influx of support from across the globe. As the occupation goes into its third week, Cooper Union has become the center of a buzzing discussion about the student debt crisis. Joe Riley is a Cooper art student.</i></p>\n\n\n<p>&#x201C;The things going on here feel specific to Cooper, but in reality they hold so much importance for the larger picture of higher education today. Cooper, when it was founded over 150 years ago, it was intended to be a beacon for other schools, and so in some ways, we can&#x2019;t afford to lose Cooper.&#x201D;</p>\n\n\n<p><i>Last week, Cooper Union alumni elected Kevin Slavin to the Board of Directors as the alumni trustee. Slavin, who is publicly opposed to charging tuition, ran on a platform of increased transparency on the Board, an issue that also figures among the occupiers&#x2019; demands. In addition to the president&#x2019;s resignation, the occupiers want the administration to consider alternatives to charging tuition, or at least to postpone the decision until 2015. But so far, the Board of Directors has formally refused to consider reversing its decision. Carla Green, FSRN, New York.</i></p>\n<p><b>Suicide attacks target French interests in Niger</b></p>\n<p>Two suicide bomb attacks today in the West African country of Niger have left at least 20 people dead. An Islamist group with ties to Mali claimed responsibility for the coordinated attacks on an army barrack and a French-owned uranium mine. Earlier this year, French troops intervened in Mali to suppress Islamist groups in the country&#x2019;s north.</p>\n<p><b>Malaysian student activist charged with sedition</b></p>\n<p>Authorities in Malaysia have charged a young activist in connection to post-election anti-government protests. The student Adam Adli is accused of inciting rebellion against the government. Three other activists were also arrested according to international media. Opposition groups have called this month&#x2019;s elections fraudulent. Several protests have followed.</p>\n<p><b>Zimbabwe high court considers case of prisoner denied HIV medication</b></p>\n<p>Today Zimbabwe&#x2019;s Supreme Court heard the case of an HIV-positive man allegedly denied his medication while being detained at the main police station in the capital. Lawyers say if the government won&#x2019;t give detainees treatment, police should not be allowed to hold HIV-positive individuals. FSRN&#x2019;s Garikai Chaunza reports from Harare.</p>\n<p><i>Douglas Muzanenhamo is an AIDS activist who says he was denied his medication and ill-treated when he was arrested with other human rights advocates in February 2011. As a result of the incarceration, his doctors say his T-cell count dropped significantly. Muzanenhamo filed the landmark case last September. Tawanda Zhuwarara with Zimbabwe Lawyers for Human Rights is Muzanenhamo&#x2019;s attorney. </i></p>\n\n\n<p>&#x201C;Our submissions were to the fact that the court should take a robust approach to those disputes of facts and also take a look at the agreed facts which particularly highlighted the fact that yes they might have been quite a number of such violations of Douglas Muzanenhamo&#x2019;s fundamental rights.&#x201D;</p>\n\n\n<p><i>According to media reports, the rate of HIV infection in Zimbabwe&#x2019;s prisons is 27%, double that of the regular population. Garikai Chaunza, FSRN, Harare.</i></p>\n<p>Share this page!</p><div><a href=\"http://digg.com/submit?phase=2&amp;url=http://www.fsrn.org/audio/headlines-thursday-may-23-2013/12040&amp;title=Headlines%20for%20Thursday,%20May%2023,%202013\" target=\"_blank\" rel=\"nofollow\"><img src=\"http://fsrn.org/files/digg.png\"></a><a href=\"http://www.muti.co.za/submit?url=http://www.fsrn.org/audio/headlines-thursday-may-23-2013/12040&amp;title=Headlines%20for%20Thursday,%20May%2023,%202013\" target=\"_blank\" rel=\"nofollow\"><img src=\"http://fsrn.org/files/muti.png\"></a><a href=\"http://del.icio.us/post?url=http://www.fsrn.org/audio/headlines-thursday-may-23-2013/12040\" target=\"_blank\" rel=\"nofollow\"><img src=\"http://fsrn.org/files/delicious.png\"></a><a href=\"http://www.google.com/bookmarks/mark?op=add&amp;bkmk=http://www.fsrn.org/audio/headlines-thursday-may-23-2013/12040&amp;title=Headlines%20for%20Thursday,%20May%2023,%202013&amp;labels=&amp;annotation=&amp;referrer=google\" target=\"_blank\" rel=\"nofollow\"><img src=\"http://fsrn.org/files/google.png\"></a><a href=\"http://reddit.com/submit?url=http://www.fsrn.org/audio/headlines-thursday-may-23-2013/12040&amp;title=Headlines%20for%20Thursday,%20May%2023,%202013\" target=\"_blank\" rel=\"nofollow\"><img src=\"http://fsrn.org/files/reddit.png\"></a><a href=\"http://www.facebook.com/share.php?u=http://www.fsrn.org/audio/headlines-thursday-may-23-2013/12040\" target=\"_blank\" rel=\"nofollow\"><img src=\"http://fsrn.org/files/facebook.png\"></a><a href=\"http://furl.net/storeIt.jsp?u=http://www.fsrn.org/audio/headlines-thursday-may-23-2013/12040&amp;t=Headlines%20for%20Thursday,%20May%2023,%202013\" target=\"_blank\" rel=\"nofollow\"><img src=\"http://fsrn.org/files/furl.png\"></a></div></div>\n    </div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://fsrn.org/files/digg.png",
    "title": "Headlines for Thursday, May 23, 2013",
    "rendered_pages": 1
}