{
    "domain": "ceasefiremagazine.co.uk",
    "next_page_id": null,
    "url": "http://ceasefiremagazine.co.uk/review-free-cooper-union-salon-step/",
    "short_url": "http://rdd.me/gpqn2x0b",
    "author": "Janine DeFeo",
    "excerpt": "In early May, students at Cooper Union - one of the last tuition-free colleges in the US - occupied the offices of CU president, Jamshed Bharucha, in protest at the proposed introduction of tuition&hellip;",
    "direction": "ltr",
    "word_count": 647,
    "total_pages": 0,
    "content": "<div><p class=\"post_excerpt\">\n\t\t\tIn early May, students at Cooper Union - one of the last tuition-free colleges in the US  - occupied the offices of CU president, Jamshed Bharucha, in protest at the proposed introduction of tuition fees next year. For the past two weeks, their reclaimed territory has been open for a landmark exhibition.\t\t\t</p>\n\t\t\t\t\t\t<div id=\"entry\">\n\t\t\t\n\t\t\t\t\t\t<p>By <span><span><strong><a href=\"http://ceasefiremagazine.co.uk/author/janine-defeo/\" title=\"Posts by Janine DeFeo\" rel=\"author\">Janine DeFeo</a> </strong></span></span></p>\n\t\t\t\t\t\t\n\t\t\t<p><img class=\"alignnone size-full wp-image-18177\" alt=\"image-1\" src=\"http://ceasefiremagazine.co.uk/wp-content/uploads/image-1.jpeg\" width=\"640\">On May 28, a little more than a month after the Cooper Union Board of Trustees announced its decision to charge undergraduate tuition for the first time in over a century, the students occupying the offices of Cooper Union president Jamshed Bharucha opened up their reclaimed territory for an exhibition, the &#x2018;Free Cooper Union Salon &#x2013; Step Down&#x2019;.</p>\n<p>&#x2018;Step Down&#x2019; is equal parts tribute to the institution&#x2019;s founding mission, collective imagining of what &#x2018;free education&#x2019; potentially means, and, of course, protest against the decision to impose tuition, which will affect students entering the Cooper Union for the Advancement of Science and Art in autumn 2014.</p>\n<p>To quickly summarise the crisis: the global economic recession, combined with years of financial mismanagement (notable errors include investing huge amounts in risky hedge funds and borrowing &#x2013; as opposed to fundraising &#x2013; $166 million to construct a new building,) have left Cooper Union, one of the last tuition-free colleges in the US, operating at a significant deficit.&#xA0; The debate over how to make up the shortfall in the college&#x2019;s endowment has been going on publicly for two years, ever since Bharucha called for the development of a &#x2018;sustainable financial model&#x2019; for Cooper Union.&#xA0; But the Board of Trustees&#x2019; solution &#x2013; tuition &#x2013; is in complete opposition to founder Peter Cooper&#x2019;s mission of an education &#x2018;as free as air and water&#x2019;.</p>\n<p>Beyond merely trying to shift responsibility for their financial errors onto the students, both&#xA0;Bharucha and the Board of Trustees have been&#xA0;trying to impose a deeply ideological financial logic to trump the founding logic of the college.&#xA0; But to the students, one thing is obvious: tuition cannot be the solution to Cooper Union&#x2019;s financial problems, because the defining mission of the institution is to offer its students free education. As such, any proposal that disregards this is not only unacceptable, it&#x2019;s unthinkable.</p>\n<p>On May 8, more than fifty students, faculty, and staff occupied Bharucha&#x2019;s office, resolving to hold the space &#x2018;until a suitable administrative alternative is secured&#x2019;. The demands of the occupation &#x2013; a new administrative structure with more student involvement, Bharucha&#x2019;s resignation &#x2013; are articulations of what is, in fact, a rather modest request: the maintenance of the college&#x2019;s original values.</p>\n<p><img class=\"alignnone size-medium wp-image-18178\" alt=\"image\" src=\"http://ceasefiremagazine.co.uk/wp-content/uploads/image1-225x300.jpeg\" width=\"225\">But &#x2018;Step Down&#x2019;, &#x2018;a collaborative initiative imagining a world where &#x201C;Free Education to All&#x201D; exists&#x2019; suggests the radical possibilities for Cooper&#x2019;s founding mission and Free Cooper Union movement. There&#x2019;s a lot of densely installed&#xA0;material in &#x2018;Step Down&#x2019;: posters, organising materials, a student debt calculator, histories of the student debt crisis and the situation at Cooper, as well as many delightfully unflattering caricatures of Jamshed Bharucha (full disclosure: I submitted a reading list).</p>\n<p><i>Hyperallergic </i>called it &#x2018;one of the most significant and symbolic shows of the year&#x2019;, but its greatest significance lies in exactly how it is <em>not</em> symbolic.&#xA0; &#x2018;Step Down&#x2019; <i>does </i>something. It does&#x2019;&#x2019;t act like an exhibition; it acts like an archive, a rally, and, of course, a school. The Free Cooper Union Salon enacts the environment and the community that the students envision, and not only for Cooper Union.</p>\n<p>The exhibition runs in New York until the 15 June, Tuesday through Saturday, on the seventh floor of the Foundation Building (7 East 7<sup>th</sup> Street). Open Forums and Free University classes will take place daily in the space.&#xA0; The show will then travel to London for a one-night exhibition on 30 June. &#xA0;Eventually, all the material will be digitized and available online.</p>\n<p><em>More information about the New York incarnation of &#x2018;Step Down&#x2019;: http://cusos.org/salon-step-down/</em></p>\n<p><em>More information about the London show, including how to submit work: <a href=\"http://publicassembly.info/\">http://publicassembly.info</a></em></p>\n\t\t\t\t\t\t\n\t\t\t \n\t\t\t</div>\n\t\t\t\n\n\t\n\t\n\t\t\t\t\t</div>",
    "date_published": "2013-06-13 00:00:00",
    "dek": null,
    "lead_image_url": "http://ceasefiremagazine.co.uk/wp-content/uploads/image-1.jpeg",
    "title": "Review | Free Cooper Union Salon-Step Down",
    "rendered_pages": 1
}