{
    "domain": "gothamist.com",
    "next_page_id": null,
    "url": "http://gothamist.com/2012/12/04/cooper_union_protesters_remain_ther.php",
    "short_url": "http://rdd.me/sg4bufvc",
    "author": "Christopher Robbins",
    "excerpt": "A photo of the Cooper Union building and the banner dropped by protesters yesterday (Release) The eleven students and one journalist who barricaded themselves in a room on the eighth floor of the&hellip;",
    "direction": "ltr",
    "word_count": 408,
    "total_pages": 0,
    "content": "<div><div class=\"entry-body\"><p><span class=\"mt-enclosure mt-enclosure-image\"> <div class=\"image-none\"> <img alt=\"12412cooperfinal.jpg\" src=\"http://gothamist.com/attachments/nyc_chrisrobbins/12412cooperfinal.jpg\" width=\"640\"><br><i> A photo of the Cooper Union building and the banner dropped by protesters yesterday (Release)</i></div> </span></p>\n\n<p>The eleven students and one journalist who <a href=\"http://gothamist.com/2012/12/03/11_students_protesting_tuition_barr.php\">barricaded themselves</a> in a room on the eighth floor of the Cooper Union building yesterday to protest the school's decision to charge tuition have not received any communication from the administration, and say they are prepared to stay as long as necessary until their demands are met. \"Though there's been no instance of the administration formally reaching out to us, we heard through the grapevine that the president said he wasn't going to negotiate with us,\" Victoria Sobel, a spokeswoman for the protesters said in a phone interview, referring to president Jamshed Bharucha. \"But there's nothing to negotiate. We want more clarity, more transparency regarding what the school is doing about charging tuition, and as for the president, we want him to resign.\" </p>\n\n<p>Sobel pointed to the leak of a document that references an \"Undergraduate Tuition Committee\" and proposes various models of how to meet a \"ten year target of $6 million/yr for the School of Engineering\" that includes charging students anywhere from $40K to $80K. Cooper Union has traditionally provided education to students free of charge, and did so until <a href=\"http://gothamist.com/2012/04/24/cooper_union_to_make_graduate_stude.php\">this spring when the administration announced</a> that they would begin charging tuition for graduate school.</p>\n\n<p>\"We have no idea who leaked the memo, it was anonymously emailed to someone. But why did this even have to be leaked? Why does the administration believe they can just hide and guide the proposals without letting the rest of the school in on the discussion?\" Sobel asked. </p>\n\n<p>Sobel noted that there have been no attempts to breach the Peter Cooper Suite, where the students are locked in, and that law enforcement has been mostly tolerant of the students' protest: NYPD officers eventually allowed a group of freshman to camp outside the Cooper Union building last night in a show of solidarity. </p>\n\n<p>Sobel declined to say how long their provisions will last, but said, \"We are eating well. We brought a lot of food: fresh fruit, tea, water. We're eating macaroni right now. There's a kitchenette in the suite to prepare all this stuff.\" </p>\n\n<p>A request for comment to Cooper Union's Office of Public Affairs has not yet been returned. The protesters have scheduled a press conference in front of the Cooper Union building today at 2:30 p.m. to discuss the leaked document, which you can read below. </p>\n\n<p><a title=\"View Summary Leakedpdf on Scribd\" href=\"http://www.scribd.com/doc/115488134/Summary-Leakedpdf\">Summary Leakedpdf</a></p></div>\n\n\n</div>",
    "date_published": "2012-12-04 14:23:00",
    "dek": null,
    "lead_image_url": "http://gothamist.com/assets_c/2012/12/12412cooperfinal-thumb-105x105-759874.jpg",
    "title": "Cooper Union Protesters Remain:",
    "rendered_pages": 1
}