{
    "domain": "studentactivism.net",
    "next_page_id": null,
    "url": "http://studentactivism.net/2013/11/11/cooper-union-trustees-renege-on-promise-to-seat-student-trustee/",
    "short_url": "http://rdd.me/hjorcit6",
    "author": null,
    "excerpt": "This is kind of incredible. You&#x2019;ll recall that back in the summer the Cooper Union administration negotiated the end to a student occupation of the college president&#x2019;s office by&hellip;",
    "direction": "ltr",
    "word_count": 1442,
    "total_pages": 0,
    "content": "<div><div class=\"post-content\">\n\t\t<p>This is kind of incredible.</p>\n<p>You&#x2019;ll recall that back in the summer the Cooper Union administration negotiated the end to a student occupation of the college president&#x2019;s office by agreeing, <a href=\"http://studentactivism.net/2013/07/16/is-it-a-trap-thoughts-on-the-cooper-union-agreement/\">among other things</a>, to place an elected student on Cooper&#x2019;s board of trustees. In October the trustees <a href=\"http://studentactivism.net/2013/10/15/cooper-union-administration-violates-agreement-on-student-trustee/\">revealed the framework</a> under which that student trustee would be chosen, and the process has been moving forward since then.</p>\n<p>Today <a href=\"https://www.facebook.com/groups/SaveCooperUnion/permalink/551380148270983/\">it was announced</a> that the winner of the campus-wide election to select the student trustee will not be seated as previously agreed. No student, in fact, will be seated on the board until at least March. Why? Mostly because the process the students followed to select their representative was too democratic.</p>\n<p>I should probably back up.</p>\n<p>The process for choosing the student trustee that was announced in October was <a href=\"https://www.facebook.com/FreeCooperUnion/posts/536857536395069\">pretty complicated</a>. In it, the student body would elect a pool of three candidates from which the trustees&#x2019; membership committee would choose a winner. Despite the fact that this setup violated the trustees&#x2019; summer agreement to establish a mechanism &#x201C;for the election of a student representative,&#x201D; the Joint Student Council, which had been given responsibility for implementing the procedure, chose not to boycott. They took nominations, validated candidacies, held candidate forums, and &#x2014; just last week &#x2014; conducted an election.</p>\n<p>But this afternoon, immediately before the results of that election were due to be announced, the trustees pulled the plug on the whole thing. Here&#x2019;s their explanation as to why:</p>\n<p>&#x201C;It has &#x2026;come to the Board&#x2019;s attention that the process implemented by the JSC to select candidates for the Student Representative position only resulted in two candidates even running for the position, and that the Joint Student Council has since voted only to submit to the Committee on Trustees the one candidate with the highest number of votes.&#x201D;</p>\n<p>Because there were only two candidates, and because the JSC only intended to submit one candidate&#x2019;s name to the board, the process has been declared void. Only if the JSC starts again from scratch will the trustees consider selecting a student to fill the trustee seat, and even then not before the March 2014 trustee meeting.</p>\n<p>This is quite simply flabbergasting, for several reasons.</p>\n<p>First, let&#x2019;s address the charge that the JSC &#x201C;voted only to submit to the Committee on Trustees the one candidate with the highest number of votes.&#x201D; Although I haven&#x2019;t yet seen the language that the Council voted on, a JSC representative said on the Save Cooper Union Facebook page earlier today that the two candidates told the Council, prior to the election, that whoever lost the straw poll would withdraw voluntarily.</p>\n<p>The idea of voluntary withdrawal is <a href=\"http://studentactivism.net/2013/10/18/how-cooper-union-students-could-force-the-colleges-hand-on-the-student-trustee/\">one that I suggested last month</a> as a way that the students could ensure that the results of their election were respected by the trustees. It&#x2019;s my understanding that the concept was publicly embraced by each of the candidates and that the JSC vote at issue was simply an acknowledgment of this reality &#x2014; a statement that they intended to send the name of the winner to the trustees because it was their understanding that the runner-up would by then no longer be a candidate.</p>\n<p>Even if what I have been told is incorrect, however, and the JSC intended to submit only the single highest vote-getter to the trustees regardless of the wishes of the runner-up, that&#x2019;s hardly a compelling reason to burn the trustee selection process to the ground. The names of the candidates weren&#x2019;t a secret &#x2014; if the trustees wanted to defy the students&#x2019; will and install the losing candidate, the failure of the JSC to formally provide that student&#x2019;s name wouldn&#x2019;t have prevented them from doing so.&#xA0;To leave such an important position unfilled because of a student government&#x2019;s symbolic gesture of democratic solidarity is almost unimaginably petty.</p>\n<p>And the trustees&#x2019; other rationale for rejecting the results of the election &#x2014; that the process &#x201C;only resulted in two candidates even running for the position&#x201D; is even more bizarre. As it turns out, there were initially four candidates for the trustee seat. According to a Cooper student who replied to a query of mine on Facebook earlier today, one of those candidates was unable to gather the required number of signatures in support of his or her nomination, while the other was disqualified because he was on academic probation.</p>\n<p>Each of these barriers to candidacy was established by the board of trustees.</p>\n<p>That&#x2019;s right. There were four students ready and willing to run for the seat, but policies established by the trustees resulted in the disqualification of two of them. And because those disqualifications only left two students remaining, the trustees are refusing to fill the seat at all.</p>\n<p>My October suggestion that student candidates consider withdrawing after the election was grounded in what I now realize was a fatally flawed assumption &#x2014; that when the trustees declared that &#x201C;the Joint Student Council will oversee an election process that will result in three candidates being presented to the Committee,&#x201D; they meant that the JSC would be tasked with winnowing the field to three candidates if more than three candidates stepped forward.</p>\n<p>Instead &#x2014; and I have to admit that I can&#x2019;t quite believe that I&#x2019;m typing this &#x2014; the trustees now assert that they meant that the JSC had an obligation to ensure that at least three candidates would step forward, collect sufficient signatures to be placed on the ballot, survive the relevant eligibility hurdles, and remain in contention until the end of the process. If at any point the number of remaining candidates dropped below three, the entire process would be abandoned.</p>\n<p>I apologize for all the sputtering adjectives I&#x2019;m using here, but this is really quite preposterous. A body that&#x2019;s overseeing an election can&#x2019;t force candidates to run. It can&#x2019;t demand that students gather signatures in support of their candidacies. It can&#x2019;t refuse to allow candidates to withdraw if they choose to withdraw. It doesn&#x2019;t have the power to do any of those things, and it would be absurd for it to attempt to assert such power.</p>\n<p>All a body like the JSC can reasonably be expected to do in a situation like this &#x2014; all it has the ability to do &#x2014; is establish procedures for facilitating nominations, oversee the selection process, and announce the results. It carried out the first two of these obligations, and it appears to have been preparing to carry out the third this week. But now, in a truly bizarre fit of pique, the Cooper Union trustees have chosen to toss aside all the work and effort and good faith the students of the college have expended on the process for reasons that &#x2014; well, you&#x2019;ve heard the adjectives already.</p>\n<p>And there&#x2019;s one more thing to remember. This is all happening in the midst of the most serious crisis in Cooper Union&#x2019;s history, at a time when the college is on the verge of implementing a tuition policy which many students, faculty, staff, and alumni vehemently oppose.</p>\n<p>One would think that at such a moment the college&#x2019;s trustees would have an interest in placating those communities, in demonstrating their levelheadedness, temperance, and wisdom. One would think they would be inclined to keep things calm. Instead, they&#x2019;re going to war. And why? To prevent the students of the college from filling a single non-voting, unelected seat on the board of trustees with a representative of their choosing.</p>\n<p>It really is kind of incredible.</p>\n<div id=\"jp-post-flair\" class=\"sharedaddy sd-like-enabled sd-sharing-enabled\"><div class=\"sharedaddy sd-block sd-like jetpack-likes-widget-wrapper jetpack-likes-widget-unloaded\" id=\"like-post-wrapper-3467503-9868-5281a138c5d55\"><h3 class=\"sd-title\">Like this:</h3><p class=\"likes-widget-placeholder post-likes-widget-placeholder\"><span class=\"button\"><span>Like</span></span> <span class=\"loading\">Loading...</span></p><a class=\"sd-link-color\"></a></div>\n</div>\t</div>\n\t\t</div>",
    "date_published": "2013-11-11 00:00:00",
    "dek": null,
    "lead_image_url": null,
    "title": "Cooper Union Trustees Renege on Promise to Seat Student Trustee",
    "rendered_pages": 1
}