{
    "domain": "hyperallergic.com",
    "next_page_id": null,
    "url": "http://hyperallergic.com/61374/students-occupy-historic-cooper-union-clock-tower-to-protest-tuition-charges/",
    "short_url": "http://rdd.me/jiw9lysu",
    "author": "Janelle Grace",
    "excerpt": "Cooper Union&#x2019;s Foundation Building, as seen from Cooper Park (photo courtesy Students for a Free Cooper Union)Eleven Cooper Union students have barricaded themselves within the school&#x2019;s&hellip;",
    "direction": "ltr",
    "word_count": 930,
    "total_pages": 0,
    "content": "<div><div class=\"format_text entry-content\"><div id=\"attachment_61382\" class=\"wp-caption alignleft\"><img class=\"size-full wp-image-61382 \" title=\"View from Cooper Park 320\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/View-from-Cooper-Park-320.jpeg\" alt=\"\" width=\"320\"><p class=\"wp-caption-text\">Cooper Union&#x2019;s Foundation Building, as seen from Cooper Park (photo courtesy Students for a Free Cooper Union)</p></div><p>Eleven Cooper Union students have barricaded themselves within the school&#x2019;s Foundation Building clock tower since noon on December 3&#xA0;in protest of the administration&#x2019;s plan to begin charging tuition for graduate studies for the first time in 110 years.</p><p>Founded by philanthropist Peter Cooper in 1859, the college&#x2019;s mission <a href=\"http://cooper.edu/about/mission-vision\">currently states</a> that it &#x201C;admits undergraduates solely on merit and awards full scholarships to all enrolled students.&#x201D; However, in the last year, the school&#x2019;s <a href=\"http://blogs.reuters.com/felix-salmon/2011/11/09/cooper-unions-murky-finances/\">troubled financial situation</a> has been brought to public attention and free tuition for all students has been deemed untenable by the administration. The decision to begin charging some graduate students tuition <a href=\"http://www.nytimes.com/2012/04/25/nyregion/cooper-union-will-charge-tuition-for-graduate-students.html\">was announced</a> by the school&#x2019;s president Jamshed Bharucha this past April, and met with <a href=\"http://www.thenation.com/blog/167588/cooper-union-students-protest-colleges-first-ever-tuition\">walkout protests</a> at that time. The Cooper Union&#x2019;s board of trustees is scheduled to meet on December 5th to hear the administration&#x2019;s plans of &#x201C;reinvention,&#x201D; which include the process of creating new revenue-generating programs, in particular tuition for new graduate programs to begin in the fall of 2013. Current undergraduate students are guaranteed not to be charged tuition through 2017.</p><p>The students have secured the doors to the Peter Cooper Suite, located within the top floor of the school&#x2019;s Foundation Building, and intend to stay until their demands have been met, refusing any negotiations. <a href=\"http://gothamist.com/2012/12/03/11_students_protesting_tuition_barr.php\">Via communiqu&#xE9;s</a> issued to the administration and to the press, the students demand the following: that the administration &#x201C;stops pursuing new tuition-based educational programs;&#x201D;&#xA0;a greater degree of transparency of the school&#x2019;s finances and the board of trustees&#x2019; actions; and that Dr. Bharucha &#x2013; newly inaugurated last year &#x2013; resigns as president.</p><div id=\"attachment_61379\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-61379 \" title=\"photo 3 resized\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/photo-3-resized.jpeg\" alt=\"\" width=\"640\"><p class=\"wp-caption-text\">A sign in support of the clock tower protesters (photo courtesy Sam Vernon)</p></div><p>Cooper Union School of Art senior Casey Gollan, who is among the students occupying the Peter Cooper Suite, has said in a telephone interview that historically, the school&#x2019;s finances were backed by the philanthropy of a wealthy few and clever real estate investments. Gollan stated that the school&#x2019;s deficits were not made apparent to the public until statements made by Dr. Bharucha in the last year. The protesters feel that these messages were contradictory to those they had previously been receiving regarding the school&#x2019;s financial stability, especially given the opening of the 41 Cooper Square building in 2009. The school announced in November 2011 the creation of the <a href=\"https://taskforce.cooper.edu/home\">Revenue Task Force</a>, which has created the school&#x2019;s reinvention plan to counter its financial issues. The protesters cite a continued lack of transparency in this process and demand that the larger community is granted a greater role in making these decisions. &#x201C;The Cooper community has no recourse against the board&#x2019;s actions,&#x201D; Gollan said. &#x201C;We aren&#x2019;t heard without stunts like this.&#x201D;</p><p>In a separate phone interview, Sam Vernon, a 2009 graduate of Cooper&#x2019;s School of Art who is not among the occupiers, also expressed the need for undergraduate education at Cooper to remain free. &#x201C;The School of Art carries the baton for the fight [for free tuition].&#x201D; Vernon, who was co-chair of the student council for the School of Arts during her time at Cooper, actively participated in conversations regarding the school&#x2019;s financial stability in 2008 and 2009. She cites 41 Cooper Square as having displaced some art studios, as well as raising questions in the minds of students regarding the school&#x2019;s financial future. She and Gollan both stressed the economic challenges for working artists that often render them less able to shoulder the cost of massive education debt. &#x201C;It&#x2019;s important to provide an education that allows students to grow, without the pressure to be an art making robot,&#x201D; Vernon stated. She contrasted the needs of the art students against those of the engineering students, who are generally able to give back to the school in greater dollar amounts after they graduate. &#x201C;Although they are all a part of Cooper, each school has different needs,&#x201D; Vernon said. &#x201C;It&#x2019;s completely necessary that we have a range of voices in this dialogue.&#x201D;</p><div id=\"attachment_61377\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-61377  \" title=\"FREE-candlelight-vigil\" src=\"http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/FREE-candlelight-vigil.jpg\" alt=\"\" width=\"640\"><p class=\"wp-caption-text\">Attendees of the Summit on Debt and Education created this display outside of the Foundation Building Monday night. (courtesy Students for a Free Cooper Union)</p></div><p>The start of the lock-in protest coincide with yesterday&#x2019;s <a href=\"http://www.newschoolfreepress.com/2012/12/03/cooper-union-students-to-stage-day-of-action-against-administration/\">Day of Action events</a>, which included a summit on debt and education and a series of performances and lectures, staged by a coalition of students and alumni. According to Gollan, a revolving group of approximately 30 other students and community members have shown their support for the 11 occupying Cooper students (and one student reporter from <em>The New School Free Press</em>) via on the ground protest signs and a display of candles outside the Foundation Building. Gollan said as of last night, that there has been &#x201C;almost zero&#x201D; communication from the administration, outside of a question for the students&#x2019; safety (which they address in their communiqu&#xE9;). Gollan also reported that at one point, maintenance workers rammed the room&#x2019;s doors in an attempt to breach the occupation. The students have fortified the doors with wood and steel barricades and have stocked the space with food and supplies for several days. Livestreams of the occupation is currently being broadcast&#xA0; <a href=\"http://www.livestream.com/occupynyc\">here</a>&#xA0; and <a href=\"http://globalrevolution.tv/\">here</a>. <a href=\"http://www.cusos.org/students-for-a-free-cooper-union-call-for-press-conference-tuesday-afternoon/\">A press conference</a> with intermediaries for the student occupiers will be held at the Foundation Building at 2:30pm EST today.</p><p>Hyperallergic reached out for an official Cooper Union response to the protest but officials were unavailable for comment at the time of the publication of this article. Yesterday, school officials told the <em>New York Times</em>&#x2018; <a href=\"http://cityroom.blogs.nytimes.com/2012/12/03/students-seize-cooper-union-room-to-protest-possible-tuition/\" target=\"_blank\">City Room blog</a> that &#x201C;they were still formulating a response to the occupation of the Clocktower.&#x201D;</p> <p class=\"post_tags\">Tagged as: <a href=\"http://hyperallergic.com/tag/cooper-union/\" rel=\"tag nofollow\">Cooper Union</a>, <a href=\"http://hyperallergic.com/tag/education/\" rel=\"tag nofollow\">education</a>, <a href=\"http://hyperallergic.com/tag/protest/\" rel=\"tag nofollow\">protest</a></p>  </div></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://hyperallergic.wpengine.netdna-cdn.com/wp-content/uploads/2012/12/FREE-candlelight-vigil.jpg",
    "title": "Students Occupy Historic Cooper Union Clock Tower to Protest Tuition Charges",
    "rendered_pages": 1
}