{
    "domain": "www.blouinartinfo.com",
    "next_page_id": null,
    "url": "http://www.blouinartinfo.com/news/story/905940/why-cooper-unions-tuition-fight-matters-for-the-future-of-art",
    "short_url": "http://rdd.me/gpxtvkw1",
    "author": "Ben Davis",
    "excerpt": "People should be angry about what has happened at Cooper Union.Trouble has been looming at the historically tuition-free New York institution&#xA0;for years. Faced with ongoing&hellip;",
    "direction": "ltr",
    "word_count": 1388,
    "total_pages": 0,
    "content": "<div><div class=\"field-item even\"><p><span>People should be angry about what has happened at Cooper Union.</span></p><p>Trouble has been looming at the historically tuition-free New York institution&#xA0;for years. Faced with ongoing deficits,&#xA0;administration figures have floated trial balloons about charging admission,&#xA0;<span>always</span><span>&#xA0;insisting&#xA0;</span><span>ritualistically&#xA0;</span><span>that they were exploring all other options. Last year,&#xA0;</span><a href=\"http://cityroom.blogs.nytimes.com/2012/12/10/cooper-union-students-end-occupation-of-suite-after-a-week/\" target=\"_blank\" rel=\"nofollow\">a student occupation</a><span>&#xA0;anticipated the current turbulence. Still,&#xA0;the</span><span>&#xA0;board of trustees' declaration last month that for the first time in more than a century, the&#xA0;</span>prestigious art, architecture, and engineering school<span>&#xA0;would begin charging tuition enraged and saddened students, alumni, and just about everyone else who cares about education.</span></p><p>In the weeks since, there have been protests, symbolic actions, and scathing expos&#xE9;s. Just yesterday, a&#xA0;<a href=\"http://blogs.villagevoice.com/runninscared/2013/05/cooper_union_secret_transcript.php\" rel=\"nofollow\">transcript of a Cooper board meeting was released</a>&#xA0;(and promptly&#xA0;<a href=\"http://blogs.villagevoice.com/runninscared/2013/05/cooper_union_students_perform_transcript.php\" rel=\"nofollow\">turned into a student play</a>), revealing a body dangerously insulated from the values of the community it was charged with leading, dismissive of student protest as&#xA0;&#x201C;performance art,&#x201D;&#xA0;hostile to the unionized faculty, and capable of using the threat of closing the school entirely to make staff fall in line. Last week,&#xA0;<a href=\"http://www.ted.com/speakers/kevin_slavin.html\" target=\"_blank\" rel=\"nofollow\">video game guru</a>&#xA0;and MIT professor Kevin Slavin &#x2014;&#xA0;who once had a team of forensic accountants look at Cooper&#x2019;s 990 forms, only to have them declare that, in his words, &#x201C;they haven&#x2019;t seen anything this fucked up from anyone who wasn't being deliberately obstructive&#x201D; &#x2014;&#xA0;<a href=\"http://blogs.villagevoice.com/runninscared/2013/05/cooper_union_slavin_trustee.php\" target=\"_blank\" rel=\"nofollow\">won an election for alumni trustee as a write-in candidate</a>&#xA0;on a transparency platform.</p><p>The nine full-time art faculty &#x2014; Dore Ashton, Robert Bordo, Christine Osinski, Mike Essl, Dennis Adams, Walid Raad, Sharon Hayes, Day Gleeson, and Margaret Morton &#x2014; have very&#xA0;<a href=\"http://blogs.villagevoice.com/runninscared/2013/05/video_cooper_occupy.php\" rel=\"nofollow\">publicly signed a letter of &#x201C;No Confidence&#x201D; in the administration</a>. Finally, and most visibly,&#xA0;<a href=\"http://cusos.org/\" target=\"_blank\" rel=\"nofollow\">a fresh occupation</a>&#xA0;of the President&#x2019;s Office&#xA0;<a href=\"http://galleristny.com/2013/05/cooper-occupation-enters-third-week-with-protestors-administration-at-impasse/\" target=\"_blank\" rel=\"nofollow\">continues to this moment</a>, albeit in a somewhat vitiated form, down to 14 occupiers from 50-plus at its height, now that classes are over.</p><p>Occupations are important but symbolic affairs. After&#xA0;<a href=\"http://www.alternet.org/education/inside-cooper-union-occupations-first-hours\" target=\"_blank\" rel=\"nofollow\">initially sending in armed guards</a>, the administration is likely waiting for the ruckus to die down and peter out. A lot depends on how the issue of tuition gets translated to a broader public &#x2014;&#xA0;and I realize not everyone sees this as the burning issue of the day. Cooper Union is, after all, a very small school, with just 12,000 alumni and 1,000 or so students a year. It has evolved a long ways from its origins as a college meant to train working-class New Yorkers, and is widely known these days as an elite institution.</p><p>Which is natural: In a culture as ruthlessly market-driven as ours, founder Peter Cooper&#x2019;s dictum that education should be as &#x201C;free as air and water&#x201D; is not exactly going to go mainstream. But what I think is important to highlight is how the issues at stake here form an almost perfect crystal of the forces buffeting art and education in the woebegotten 21st century.&#xA0;Felix Salmon has done yeoman&#x2019;s work detailing the ways in which Cooper Union's managers bear much of the blame for the current sorry state of affairs. Go read his series of&#xA0;<a href=\"http://blogs.reuters.com/felix-salmon/2013/05/11/are-cooper-unions-finances-fixable/\" target=\"_blank\" rel=\"nofollow\">angry</a>,&#xA0;<a href=\"http://blogs.reuters.com/felix-salmon/2013/05/19/cooper-unions-shameless-trustees/\" target=\"_blank\" rel=\"nofollow\">thorough</a>&#xA0;blog posts on the mess for a sense of what&#x2019;s at stake. I can<span>&#x2019;</span><span>t add to them, only draw out what I think should make them resonate well beyond Astor Place:</span></p><p>1) Those who follow the art world will know that its heroes over the boom years have been&#xA0;<a href=\"http://online.wsj.com/article/0,,SB111637649480736436,00.html\" target=\"_blank\" rel=\"nofollow\">hedge-fund millionaires</a>. In the&#xA0;disaster of&#xA0;Cooper Union&#x2019;s finances, the hedge-fund complex stands squarely on the side of the villains: The school finds itself in dire straights in part because its masters, faced with deficits, sunk its endowment heavily into such investments, believing in their healing wizardry. Instead,&#xA0;<a href=\"http://www.nytimes.com/2013/05/11/business/how-cooper-unions-endowment-failed-in-its-mission.html?pagewanted=all&amp;_r=0\" target=\"_blank\" rel=\"nofollow\">the funds underperformed the market</a>, while still extracting huge fees. So, in a kind of serpent-eating-its-own-tail representation of finance at its most socially corrosive, you have a perfect symbol of a system that funds the consumption of art by undercutting the basis for its actual production.</p><p>2) Some of Cooper Union&#x2019;s problems stem from the need to pay down the giant $175-million loan it took out to build its flashy Thom Mayne-designed engineering building in 2006. In constructing the facility, Cooper was simply joining in on the craze for flashy new buildings that overtook cultural institutions throughout the United States in the last decade. By now, it has been established that this starchitect boom was not based on need, but rather&#xA0;<a href=\"http://www.blouinartinfo.com/news/story/25320/if-you-build-it-will-they-come\" target=\"_blank\">something more troubling</a>: the competition to attract wealthy donors, whose egos could only be flattered by being attached to something new and shiny. The grim result has been that U.S. museums are&#xA0;<a href=\"http://culturalpolicy.uchicago.edu/setinstone/pdf/setinstone.pdf\" target=\"_blank\" rel=\"nofollow\">disastrously overbuilt</a>, saddled with increased expenses based on only tenuous real rewards.</p><p><span>The Cooper Union affair represents the awful logical climax of this trend: The school got the expensive new building and its associated costs, justified by the need to attract a major donor. But in a literally monumental act of institutional incompetence, its bosses built it before bothering to get any sponsor to put a name on it &#x2014; and that sponsor never showed up. Perhaps the &#x201C;Cooper Union Effect&#x201D; will replace the &#x201C;Bilbao Effect&#x201D; in the annals of urban planning</span></p><p>3) Anyone following the austerity debate will recognize, in mutated form, the pattern of narrow-minded or even destructive ideology masquerading as hard-nosed realism. Cooper Union has one real income-generating asset, its claim on the land below the Chrysler Building. (Indeed, in 2018, the terms of that deal are set to change in a way that will improve the school&#x2019;s finances). The fact that New York City, in effect, subsidizes an elite private school has been&#xA0;<a href=\"http://www.brooklynrail.org/2011/12/local/why-cooper-union-matters\" target=\"_blank\" rel=\"nofollow\">historically controversial</a>. By jettisoning the one thing that gives the school a special, progressive claim on the public&#x2019;s imagination &#x2014; free tuition and merit-based admission &#x2014; the board has made a decision that sounds like pragmatism, but could easily help cut its last leg out from under it. Here&#x2019;s Salmon:</p><blockquote><p>Cooper Union&#xA0;<a href=\"https://www.change.org/petitions/students-engaged-in-sit-in-of-the-cooper-union-s-president-s-office-vacate-the-office-immediately\" target=\"_blank\" rel=\"nofollow\">says</a>&#xA0;that the current&#xA0;<a href=\"http://cusos.org/55-hours/\" target=\"_blank\" rel=\"nofollow\">occupation</a>&#xA0;of the president&#x2019;s office &#x201C;has created a poisonous and dangerous atmosphere that can potentially destroy the school forever&#x201D;. No one in the administration is going to come out and say explicitly what that means, so let me translate it into English for you: they&#x2019;re saying that the more noise Cooper&#x2019;s students make in protest at the tuition decision, the more likely it is that New York City is going to decide that it wants its property-tax revenues back, and that Cooper Union, without free tuition, is not a worthy enough cause to justify an effective $18 million per year public subsidy.</p></blockquote>\n<p>4) Cooper is a private institution &#x2014;&#xA0;which makes it all the more striking that the pattern here resembles one which we<span>&#x2019;ve lately become familiar with in&#xA0;</span><span>the greater economy: A crisis stoked by short-sighted gambling, which will be solved by shifting the burden onto the public, in this case onto the families of the next generation of students.</span></p><p>Student debt has become a burning public issue of late &#x2014;&#xA0;not least among art students, as&#xA0;<a href=\"http://www.brooklynrail.org/2013/02/artseen/alternatives\" target=\"_blank\" rel=\"nofollow\">Coco Fusco</a>&#xA0;and&#xA0;<a href=\"http://www.e-flux.com/journal/art-without-market-art-without-education-political-economy-of-art/\" target=\"_blank\" rel=\"nofollow\">Anton Vidokle</a>&#xA0;have both recently argued. Cooper&#x2019;s protesters, and their supporters, are well aware that their situation is exceptional and somewhat privileged, but you can hardly accuse student occupiers who risk losing their own degrees to prevent fees for the class of 2014 of being selfish.</p><p>I don&#x2019;t know if Cooper Union&#x2019;s most hallowed tradition can be saved. The school&#x2019;s boardmembers have said that its alumni need to step up and give more for the school to flourish &#x2014; after having pursued the one strategy guarenteed to alienate those potential donors. <span>&#x201C;The great schools in the U.S. are all too often just&#xA0;places that make rich families richer. Cooper Union was the exception,&#x201D; artist and alum Zak Smith told Molly Crabapple&#xA0;<a href=\"http://www.vice.com/read/should-college-be-free-nyc-protestors-think-so\" target=\"_blank\" rel=\"nofollow\">in the first days of the recent occupation</a>. &#x201C;Not anymore. If it wasn</span><span>&#x2019;</span><span>t for Cooper, people like me wouldn</span><span>&#x2019;</span><span>t get to be artists.&#x201D;</span></p><p><span>The attack on education in our era of austerity is a nationwide &#x2014; rather,&#xA0;</span><a href=\"http://benadavis.com/archive_viewer.php?seq=155&amp;title=What%20London's%20Student%20Protests%20Mean%20For%20the%20Future%20of%20Art\" target=\"_blank\" rel=\"nofollow\">worldwide</a><span>&#xA0;&#x2014; phenomena. Without changing the larger picture, the same forces that are affecting institutions of higher learning everywhere are going to continue to press Cooper. Turning the tide of policy towards respecting the value of education as a public good is the only real sustainable solution for everyone. Conversely, accepting the inevitabilty of the situation at Cooper without anger only helps further set the limits of what is&#xA0;</span><span>&#x201C;realistic</span><span>&#x201D; to expect from the system &#x2014; which right now <a href=\"http://opinionator.blogs.nytimes.com/2013/05/12/student-debt-and-the-crushing-of-the-american-dream/\" target=\"_blank\" rel=\"nofollow\">isn't working very well</a>, saddling young people with ever-greater levels of debt in return for pursuing their dreams.&#xA0;</span></p><p><span>One way or another, Cooper Union will end up being a symbol &#x2014; either of an ideal to be reached for, or of the terrible present-day wisdom that says that ideals only matter for those who can pay.&#xA0;</span></p></div></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.blouinartinfo.com/sites/default/files/styles/300sq/public/20130523cooperunion-promo1.jpg",
    "title": "Why Cooper Union's Tuition Fight Matters for the Future of Art",
    "rendered_pages": 1
}