{
    "domain": "www.notnicemusic.com",
    "next_page_id": null,
    "url": "http://www.notnicemusic.com/Cassandra/cooper1.html",
    "short_url": "http://rdd.me/wfdle78u",
    "author": null,
    "excerpt": "For the first five days of the sit-in, the eleven Cooper students were joined by Kali Hays, a student reporter for the New School Free Press. Kali's coverage is indispensible reading and can be found&hellip;",
    "direction": "ltr",
    "word_count": 1380,
    "total_pages": 0,
    "content": "<div><p>\nFor the first five days of the sit-in, the eleven Cooper students were joined by Kali Hays, a student reporter for the New School Free Press.  Kali's coverage is indispensible reading and can be found <a href=\"http://www.newschoolfreepress.com/2012/12/03/live-cooper-union-day-of-action/\">here</a>.  The initial action has been followed by daily solidarity actions, as well as other actions such as the occupation of the December 5 Board of Trustees meeting.</p><p>\nThe students hung a \"Free Education To All\" banner from the Eighth Floor, turned the Clocktower lights red, and ran red streamers down to a supportive crowd below.  When asked how those outside could help, the students only asked that supporters continue to gather in front of the Foundation Building to continue to draw media coverage and demonstrate their solidarity.  Admnistration claims that <b>Students for a Free Cooper Union</b>, part of <b>Cooper Union Student Action to Save Our School</b> (<a href=\"http://www.cusos.org\">CU $.0.$.</a>) is limited to the 11 students in the Clocktower is facetious at best and insulting to all of the other students who have worked hard for 13 months to help preserve full-tuition scholarships for all future Cooper students, and continue to work inside and outside of the Cooper Union buildings, hanging protest posters, holding candlelight vigils, etc.</p><p>\nAccording to other media coverage, the takeover started at noon, simultaneous to a Free University of New York teach-in at Peter Cooper Park, a schedule of activist action, ending the day with a Summit on Debt and Education in The Great Hall featuring Occupy Student Debt activists and a <a href=\"http://friendsofcooperunion.org/\">Friends of Cooper Union</a> speech.  The takeover ended at noon a week later, with Reverend Billy declaring the Cooper 11 \"saints in our church.</p><li><b>Free education</b>: It is important to understand that the students are not demanding free education out of self-interest - all currently enrolled students have been guaranteed a full-tuition scholarship through to their graduation.  For the past decade, Cooper students pay tuition and fees, and then receive a \"tuition discount.\"  The relationship between fees and tuition is complex and has changed over the 150 years of the college, resulting in several false narratives.  Some facts are: For at least 25 years, while Peter Cooper was alive, the \"Cooper Institute\" was \"<a href=\"http://www.notnicemusic.com/cooper.pdf\">absolutely free</a>,\" except for some \"amateur\" women in the day art school during the first decade, a vestige of the School of Design for Women.  Peter Cooper made clear his intention that the college be <a href=\"http://www.notnicemusic.com/Peter_grad.JPG\">\"open and free to all\"</a>; his son-in-law, Abram Hewitt, similarly repeated stories about how Peter Cooper said the college was intended to be <a href=\"http://cooper.libguides.com/content.php?pid=388387&amp;sid=3183137\">\"as free as air and water\"</a>.  It is not known yet when The Cooper Union stopped being a charity school and allowed even those \"abundantly able to pay\" to apply, or when student fees were first assessed, but the \"since 1902\" narrative from the administration has proved to be part of a misinformation campaign.  See <a href=\"http://www.notnicemusic.com/cooper.pdf\">The Real Cooper</a>.\n</li><li><b>Board transparency and representation</b>: The students are citing a decade of secret plans and transactions by the Board, including a 2006 <a href=\"http://cooper.edu/sites/default/files/uploads/assets/site/files/CY-PRESpetitionChrysler.pdf\"><i>cy pres</i> petition</a> to the NYC Supreme Court that allowed the college to mortgage the Chrysler Building (resulting in a 30-year annual $10 million debt service to MetLife); significant cost overruns on interior and exterior renovations to the Foundation Building and construction of the New Academic Building; over-investment in hedge funds prior to the 2008 market crash (which a trustee has repeatedly mischaracterized to the media); lack of restraints on an administration after a balanced budget was achieved just prior to the 2008 market crash; and confidentiality agreements that keep elected alumni representatives to the Board from revealing Board policies, discussions, or decisions.\n</li><li><b>Bharucha resignation</b>: Starting with a propaganda campaign to substitute \"access\" for the merit scholarship policy, continuing with announcement of the \"hybrid framework\" (supported by no one but the Board and the President of the Alumni Association), and ending with an attempt to impose \"Responsibility Centered Management\" on to each school, the students have recognized that Jamshed Bharucha's \"tuition as a last resort\" rhetoric has always been a lie.  A more complete listing of the college's dirty tricks campaign can be found <a href=\"http://www.notnicemusic.com/Cassandra/cooper2.html\">here</a>.  Since Bharucha was granted tenure at Cooper, it is possible that the students intend that he step down as president, but that he may remain as a teacher.  The students have never claimed that Cooper not have a president at all, although the salary, benefits, and perks of the president are excessive (see this <a href=\"http://chronicle.com/article/On-Campuses-the-Income-Gap/129980/\">Chronicle of Higher Education</a> story).<br>\n<embed src=\"http://www.youtube.com/v/hQ3l8lmxyI0&amp;hl=en_US;fs=1\" type=\"application/x-shockwave-flash\" width=\"480\" height=\"385\"></embed>\n<td width=\"50%\" valign=\"top\">\n<b>December 8, 2012:</b> The Free Cooper Union rally on December 8, 2012, was a great success. The event was a completely peaceful gathering where people from many different groups were able to come together to express their strong support for continuing free education at The Cooper Union.\n<p>\nThe success of this event was the product of hard work, very disciplined organizing and the cooperation of many different groups:\n</p><p>\n<b>The Students</b>: The Free Cooper Union movement has been led by the students. These are not anarchic rabble-rousers. The group of students that occupied the Peter Cooper Suite and the students who organized and attended this rally represent some of the best and brightest at Cooper. These young people are Cooper Union&#x92;s student council representatives and top academic achievers. These are Cooper Union&#x92;s leaders. These students are the embodiment of Peter Cooper&#x92;s vision of education as a means to facilitate continuing generations of politically active, smart and socially conscious LEADERS for our democratic society.\n</p><p>\n<b>Alumni</b>: The rally was attended by alumni young and old. There were representatives from the class of 2012 through the class of 1946. Representatives of the CUAA were also present for the rally. My dear friends (and upstairs neighbors) Sheryl London A&#x92;46 and her husband Mel were in attendance. They used the human megaphone to amplify their voices to make an inspiring statement about the need for tuition free education at Cooper and their solidarity with the student protests at Cooper Union.\n</p><p>\n<b>Cooper Staff and Faculty</b>: There were many members of Cooper Union&#x92;s Faculty and Staff in attendance, both current and retired. It was great to see this support and student/faculty unity.\n</p><p>\n<b>Cooper Union Administration</b>: Vice President Westcott and Dean of Students Lemiesz were in attendance. They have been instrumental in ensuring the safety of the students and their presence was important in conveying a message of peaceful cooperation which was appreciated by everyone I spoke to.\n</p><p>\nThere are two non-Cooper groups that, though on opposite ends of the protest spectrum, were both indispensible in the success of the event and both deserve great thanks.\n</p><p>\n<b>The Community</b>: This includes the East Village community, the citywide/nationwide/worldwide student organization movements, and the Occupy movement who were all present and very active at this rally. These groups voiced calls of solidarity with our struggle to preserve Cooper&#x92;s mission of free education. These groups connected our local struggle to a powerful global movement.\n</p><p>\n<b>The New York Police Department</b>: As a life long New Yorker I have attended events from the Thanksgiving Day Parade to Anti Iraq War Rallies and I have never seen a more professional and respectful police presence than the one we had. The police accompanied the marchers from Washington Square Park and facilitated their movement through the streets- stopping traffic to allow the marchers to cross intersections. When the rally arrived at Cooper Union the officers drew back to a respectful distance. As far as I know there were no negative interactions between the police and the event attendees. On the contrary, I heard that there were many positive conversations!\n</p><p>\nThis rally was an example of what happens when well trained, smart, principled and disciplined individuals work cooperatively. I hope that it will serve as an example of what we can achieve together. Thank you everyone for doing your part and helping us to, collectively, do our best.\n</p><p>Ben Degen A' 98\n</p><p>\n<b>Partial List of Media Coverage:</b>\n</p><li><b><a href=\"http://www.huffingtonpost.com/2012/12/06/cooper-union-occupy-student-video_n_2254010.html\">INTERVIEW INSIDE THE CLOCKTOWER</a></b>\n</li><li><b><a href=\"http://www.youtube.com/watch?v=ZB1jFQPVXko\">MTV Cribs</a></b> - \"Eat breakfast and start blackmailing billionaires.\"\n</li><li><a href=\"http://cityroom.blogs.nytimes.com/2012/12/03/students-seize-cooper-union-room-to-protest-possible-tuition/\">NY Times Blog</a>\n</li><li><a href=\"http://www.artinamericamagazine.com/news-opinion/news/2012-12-03/students-lock-in-at-cooper-union-to-protest-tuition/\">Art in America</a>\n</li><li><a href=\"http://www.wpix.com/news/wpix-students-barricade-themselves-at-cooper-union,0,5059488.story\">WPIX</a>\n</li><li><a href=\"http://eastvillage.thelocal.nytimes.com/2012/12/03/cooper-union-occupiers-cheered-by-fellow-students-contacted-by-administration/\">The Local</a>\n</li><li><a href=\"http://www.msnbc.msn.com/id/26315908/#50096340\">Rachel Maddow</a>\n</li><li><a href=\"http://nymag.com/daily/intel/2012/12/students-occupy-cooper-union-for-free-tuition.html\">NY Mag</a>, <a href=\"http://hyperallergic.com/61374/students-occupy-historic-cooper-union-clock-tower-to-protest-tuition-charges/\">Hyperallergenic</a>, <a href=\"http://www.architectmagazine.com/architecture/students-occupy-cooper-union.aspx\">Architect</a>, <a href=\"http://october2011.org/blogs/kevin-zeese/cooper-union-new-york-city-occupied-protest-preserve-tuition-free-education\">blog</a>, <a href=\"http://occupyamerica.crooksandliars.com/diane-sweet/cooper-union-students-stage-lock-prote\">Occupy</a>, <a href=\"http://wesleying.org/2012/12/04/cooper-union-students-occupy-demand-free-tuition/%0Ahttp://blogs.reuters.com/felix-salmon/2012/12/05/occupy-cooper-union/\">Wesleying</a>, <a href=\"http://www.newschoolfreepress.com/2012/12/04/cooper-union-occupation-continues-into-second-day/\">New School</a>, <a href=\"http://tv.msnbc.com/2012/12/04/cooper-union-students-stage-civil-disobedience-in-defense-of-free-higher-ed/\">NBC</a>, <a href=\"http://tv.msnbc.com/2012/12/04/cooper-union-students-stage-civil-disobedience-in-defense-of-free-higher-ed/\">MSNBC</a>, <a href=\"http://inthesetimes.com/uprising/entry/14263/clocktower_occupation_at_cooper_union_enters_second_day/\">In These Times</a>, <a href=\"http://nyulocal.com/city/2012/12/04/cooper-union-students-stage-lock-in-to-protest-a-tuition-increase/\">NYU</a>, <a href=\"http://blogs.artinfo.com/artintheair/2012/12/04/cooper-union-responds-to-student-occupation-over-anti-tuition-protest/\">ArtInfo</a>, <a href=\"http://blogs.villagevoice.com/runninscared/2012/12/cooper_union_free_tuition.php\">VillageVoice</a>, <a href=\"http://newyork.cbslocal.com/2012/12/04/cooper-union-students-take-over-university-clock-tower-to-protest-tuition-changes/\">CBS</a>, ...\n<p>\nA list the Cooper 11 compiled can be found here: <a href=\"http://www.cusos.org/a-comprehensive-working-list-of-day-of-action-news-coverage/\">http://www.cusos.org/a-comprehensive-working-list-of-day-of-action-news-coverage/</a> and <a href=\"http://cusos.org/press/\">http://cusos.org/press/</a>.\n</p><a href=\"http://freecooperunion.com\"><img src=\"http://www.notnicemusic.com/pledge.JPG\" alt=\"Money On The Table\" width=\"502\" border=\"0\"></a><p>\nSince 12/3/12, Money On The Table has raised over $100,000 towards the Annual Fund!</p></li></td></li></div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.notnicemusic.com/pledge.JPG",
    "title": "Cooper Pioneer in absentia - Occupy Cooper Union",
    "rendered_pages": 1
}