{
    "domain": "eastvillage.thelocal.nytimes.com",
    "next_page_id": null,
    "url": "http://eastvillage.thelocal.nytimes.com/2013/02/19/cooper-union-students-will-protest-latest-turn-in-tuition-saga/",
    "short_url": "http://rdd.me/pbubaajs",
    "author": "DANIEL MAURER",
    "excerpt": "A few days after The Times ran a piece about the possibility of tuition at Cooper Union, student protests are gearing up again. At issue this time: prospective students whose early-decision&hellip;",
    "direction": "ltr",
    "word_count": 336,
    "total_pages": 0,
    "content": "<div class=\"entry-content\" score=\"31.25\">\n\t\t\t<div class=\"w189 right\"><a title=\"collateral-faces by moscamaurer, on Flickr\" href=\"http://www.flickr.com/photos/48457290@N00/8488958681/\"><img src=\"http://farm9.staticflickr.com/8094/8488958681_c3e43c704c_m.jpg\" alt=\"collateral-faces\" width=\"189\"></a></div>\n<p>A few days after The Times ran a piece about the possibility of <a href=\"http://www.nytimes.com/2013/02/16/nyregion/cooper-unions-tradition-of-free-tuition-may-be-near-end.html?pagewanted=all\">tuition at Cooper Union</a>, student protests are gearing up again.</p>\n<p>At issue this time: prospective students whose early-decision applications have been deferred ahead of the school’s vote, next month, about whether or not to begin charging tuition to incoming undergraduates. The group known as Cooper Union SOS will protest the deferrals tomorrow.</p>\n<p>Last week, Cooper Union’s president, Jamshed Bharucha, <a href=\"http://cooper.edu/about/news/update-academic-and-financial-planning-21313\">announced</a> that students seeking early admission to the School of Art would instead be considered with the general applicant pool, meaning they would have to wait to hear whether they had been accepted.<br><span id=\"more-43503\"></span><br>\nThe move came after the faculty of the School of Art told Mr. Bharucha, on Jan. 25, that it would not submit a proposal to address the school’s financial struggles, as the president had requested. The letter from faculty stated that “any solution to The Cooper Union’s current financial crisis that depends, even in part on tuition compromises and irreversibly damages the ideals of art, education, freedom, and citizenship.”</p>\n<p>Early-decision art applicants were notified that their applications had been deferred to be reviewed along with the rest of the regular decision pool.</p>\n<p>That doesn’t sit well with Cooper Union SOS. “These applicants have gone above and beyond their due diligence in holding up their end of the application process and now it is time to demand accountability from the anonymous Executive Committee of the Board of Trustees!” the group wrote in an e-mail. “These applicants’ futures are not theirs to hold hostage indiscriminately!”</p>\n<p>The group will protest what they believe is an “unprecedented overstepping of administrative power” tomorrow at 1 p.m. in front of the school’s Foundation Building.</p>\n<p>It won’t be the last chance for students to be heard before the vote on tuition next month: on March 1, the school’s board of trustees will host a community forum during which students, faculty, staff and alumni can voice their concerns. That meeting will occur at the school’s Great Hall at 6 p.m.</p>\n\t\t</div>\n\t",
    "date_published": "2013-02-19 18:00:00",
    "dek": null,
    "lead_image_url": "http://farm9.staticflickr.com/8094/8488958681_c3e43c704c_m.jpg",
    "title": "Cooper Union Students Will Protest Latest Turn in Tuition Saga",
    "rendered_pages": 1
}