{
    "domain": "www.dnainfo.com",
    "next_page_id": null,
    "url": "http://www.dnainfo.com/new-york/20121210/east-village/cooper-union-students-end-live-in-protest-after-weeklong-occupation",
    "short_url": "http://rdd.me/bhlq02ro",
    "author": "Serena Solomon, DNAinfo Reporter/Producer",
    "excerpt": "EAST VILLAGE &#x2014; After seven days, a small group of students from Cooper Union who had locked themselves inside the college in protest of a plan to charge tuition at the traditionally free&hellip;",
    "direction": "ltr",
    "word_count": 548,
    "total_pages": 0,
    "content": "<div><div class=\"story_area two_column_left\">\n\n\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\n\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t<p>EAST VILLAGE &#x2014; After seven days, a small group of students from Cooper Union who had locked themselves inside the college in protest of a plan to charge tuition at the traditionally free school ended their \"live-in\" protest Monday.</p>\n<p><a href=\"http://www.dnainfo.com/new-york/20121207/east-village/cooper-union-students-hold-live-in-protest-for-free-education\">Last week, 11 students from the cash-strapped Cooper Union barricaded themselves in the school's Foundation Building</a>&#xA0;and pledged to remain there until Cooper Union's administration promised to scrap plans to charge tuition and increase transparency to the student body.</p>\n\n\n<p>Although the school has officially met none of their demands, protesters claimed the live-in sparked enough media coverage and galvanized the rest of Cooper Union's student body to continue the battle out in the open.</p>\n<p>\"It was just one piece of a larger strategy,&#x201D; said live-in protester Casey Gollan, a 21-year-old senior in the School of Art. \"People felt like it was catalyzing to go up here,\" Gollan said, referring to the school's clock tower, where the live-in occurred.</p>\n<p>The protesters, which are part of the organizing body \"Students for a Free Cooper Union,\" made the decision to return from their stakeout above Cooper Square after hundreds of students and supporters attended a <a href=\"http://www.dnainfo.com/new-york/20121208/east-village/cooper-union-students-march-keep-college-free-of-tuition\">Saturday rally,</a> according to Gollan.</p>\n<p>&#x201C;We came to realize that there is so much going on, we could plug into it,&#x201D; said another live-in protester Joe Riley, 22, a junior arts student at the school.</p>\n<p>Peter Cooper founded the school, which offers art, architecture and engineering degrees for both graduate and undergraduate students, in 1859, with the mission of a free education.</p>\n<p>Before 1902, when a large endowment was received, students who could pay for their tuition did, Cooper Union's press office said. After the endowment, all students were admitted with a full scholarship.</p>\n<p>Riley said no exact date had been set for the organizers' next protest, but he mentioned that students anticipated attending the school&#x2019;s traditionally private board meeting in January.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n<p>\"There are things coming, I promise,&#x201D; he said, adding that a petition was already being passed around among the student body demanding official and permanent representation on the school's board.</p>\n<p>The school did not immediately respond to a request for comment after the live-in protesters came out, and it has yet to specify if any disciplinary action will be levied against the protesters.</p>\n<p>The live-in protesters began removing their barricade on Sunday.</p>\n<p>When the doors opened, they were met by some of the school's faculty in a gesture of support, they said.</p>\n<p>\"When I was a kid I didn't have access to education,\" said Cooper Union graphic design teacher Mike Essl, who graduated from the school in 1996. \"I applied [to Cooper Union] on a whim and literally a prayer, and that is how I do what I do today.\"</p>\n<p>He helped escort the live-in students from the clock tower, where they had camped out with supplies and sleeping bags.</p>\n<p>\"They have my thanks and gratitude,\" said Essl.</p>\n<p>The students were also met by some of their peers who had been supporting the live-in protesters from the ground, including by <a href=\"http://eastvillage.thelocal.nytimes.com/2012/12/05/students-disrupt-cooper-union-board-meeting-with-sobs-songs-plus-more-balloons/\">storming into the school's trustee meeting last Wednesday.</a></p>\n<p>Upon reaching ground level, Riley said he was happy the live-in protest was both a success and over.</p>\n<p>\"I'm going to take a shower,\" he said, \"and then I am going to get back to my [school] work.\"</p>\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\n\t\n\n  \n\t\t\n\t\n\t\n\t\t\t\n\t\n</div>&#13;\n\t</div>",
    "date_published": "2012-12-10 00:00:00",
    "dek": null,
    "lead_image_url": "http://assets.dnainfo.com/generated/photo/2012/12/jaana-gollan-mother-of-casey-gollan-outside-cooper-union-school-13550026484059.jpg/image160x120.jpg",
    "title": "Cooper Union Students End 'Live-In' Protest After Weeklong Occupation Updated December 10, 2012 4:32pm",
    "rendered_pages": 1
}