{
    "domain": "blogs.villagevoice.com",
    "next_page_id": null,
    "url": "http://blogs.villagevoice.com/runninscared/2013/05/democracy_now_cooper.php",
    "short_url": "http://rdd.me/idzzeu7b",
    "author": "Sydney Brownstone",
    "excerpt": "CS MuncyICYMI: After Cooper Union president Jamshed Bharucha met students for a surprise discussion in his office earlier this week, on Wednesday morning Democracy Now! hosted a rare, moderated forum&hellip;",
    "direction": "ltr",
    "word_count": 329,
    "total_pages": 0,
    "content": "<div><div class=\"body\">\n                        <p><span class=\"mt-enclosure mt-enclosure-image\"><table class=\"image right\" border=\"0\" width=\"240\"><tr><td><img alt=\"coop_thumb_1.jpg\" src=\"http://blogs.villagevoice.com/runninscared/coop_thumb_1.jpg\" width=\"240\"></td></tr><tr><td class=\"credit\">CS Muncy</td></tr></table></span>ICYMI: After Cooper Union president Jamshed Bharucha met students for a <a href=\"http://blogs.villagevoice.com/runninscared/2013/05/bharucha_talks_to_occupiers.php\" target=\"_blank\">surprise discussion</a> in his office earlier this week, on Wednesday morning <a href=\"http://www.democracynow.org/2013/5/16/debate_what_caused_cooper_unions_fiscal\" target=\"_blank\">Democracy Now!</a> hosted a rare, moderated forum with Victoria Sobel, a Cooper Union student organizer, Mark Epstein, the chair of trustees, and Felix Salmon, a Reuters blogger. </p>\n\n<p>Much of the discussion dealt with Cooper's decision to charge tuition after what appears to be a series of bad financial decisions--by 2008, the school had invested <a href=\"http://www.nytimes.com/2013/05/11/business/how-cooper-unions-endowment-failed-in-its-mission.html?pagewanted=all\" target=\"_blank\">$103 million</a> in hedge funds, which demanded <a href=\"http://blogs.reuters.com/felix-salmon/2013/05/11/are-cooper-unions-finances-fixable/\" target=\"_blank\">$2 million in annual management fees</a>, and in 2006, the school took out a $175 million loan from MetLife, on which it has to pay roughly $10 million in annual interest. Meanwhile, the administration is scrambling to find a way to make it to 2018, when rent on the Chrysler building, the land under which Cooper owns, will jump.</p>\n\n\n<a name=\"more\"></a>\n<p>Trustee chairman Mark Epstein placed much of the blame on the alumni's shoulders, saying that the school didn't receive enough giving. \"We don't have alumni support,\" he said at one point. \"I question their commitment to the school, other than verbal.\"</p>\n\n<p>After Salmon, who has written extensively about the Cooper Union crisis for quite a while, grilled Epstein for specifics, Sobel jumped in to reflect student occupiers' view of the situation.</p>\n\n<p>\"[Tuition] is something that's going to impact students on a class and racial level,\" she said. Sobel also highlighted the lack of transparency surrounding the school's decisions, which has led to students' occupying the president's office--now, more than a week--and demanding reform. </p>\n\n<p>\"Our biggest complaint is that there is no forum in the existing governance which allows the student body and the faculty or the deans to criticize or remove members of the board of trustees,\" Sobel said. </p>\n\n<p>Classes at the school have ended, but students have said they have intention of leaving until their demands--one of which calls for the ousting of the president--are met.<br><em><br>\nSend story ideas to <a href=\"mailto:sbrownstone@villagevoice.com\">sbrownstone@villagevoice.com</a>. Follow her on Twitter <a href=\"https://twitter.com/sydbrownstone\" target=\"_blank\">here</a>.</em></p>                                                <article-signup type=\"email\" size=\"large\"></article-signup>\n                    </div>\n                    \n                    \n                    \n                    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                </div>",
    "date_published": "2013-05-17 08:42:50",
    "dek": null,
    "lead_image_url": "http://blogs.villagevoice.com/runninscared/coop_thumb_1.jpg",
    "title": "A Cooper Union Student, the Chair of Trustees, and Felix Salmon Walked Into a Debate",
    "rendered_pages": 1
}