{
    "domain": "galleristny.com",
    "next_page_id": null,
    "url": "http://galleristny.com/2013/05/cooper-occupation-enters-third-week-with-protestors-administration-at-impasse/",
    "short_url": "http://rdd.me/jmc2zr0s",
    "author": "Zoë Lescaze",
    "excerpt": "Students call for President Bharucha to step down; Bhrarucha: 'I feel at peace with the fact that I told the truth' Cooper Union. (Photo by David Shankbone) Cooper Union&#x2019;s spring semester may&hellip;",
    "direction": "ltr",
    "word_count": 963,
    "total_pages": 0,
    "content": "<div><p id=\"nyo-dek\">Students call for President Bharucha to step down; Bhrarucha: 'I feel at peace with the fact that I told the truth'</p>\t\t\t\t\t\t\n\t\t\t\t\t\t<div class=\"entry-content\">\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div id=\"attachment_47519\" class=\"wp-caption alignleft\"><a href=\"http://nyogalleristny.files.wordpress.com/2013/05/cooper-union-david-shankbone.jpg\"><img class=\"size-medium wp-image-47519\" alt=\"Cooper Union. (Photo by David Shankbone)\" src=\"http://nyogalleristny.files.wordpress.com/2013/05/cooper-union-david-shankbone.jpg?w=300&amp;h=225\" width=\"300\"></a><p class=\"wp-caption-text\">Cooper Union. (Photo by David Shankbone)</p></div>\n<p>Cooper Union&#x2019;s spring semester may have ended last week, but some students are still in school&#x2014;specifically, in President Jamshed Bharucha&#x2019;s office. The students, who began occupying the seventh floor of the brownstone Foundation Building on May 8, oppose the board of trustees&#x2019; recent decision to charge tuition for the first time in 150 years. Administrators state that the school&#x2019;s longstanding financial problems leave them no choice.</p>\n<p>&#x201C;We do it only because the institution was hurtling toward bankruptcy,&#x201D; said Dr. Bharucha, seated in an empty classroom on the second floor of the school&#x2019;s controversial 41 Cooper Square building, a $166 million, Thom Mayne-designed structure that went up in 2009. &#x201C;There&#x2019;s a misconception that there are other ways that are less draconian.&#x201D; Currently, Cooper covers the $38,500 tuition cost for all students. Starting with the class entering in 2014, 25 to 30 percent of students will pay about $19,250, while 25 to 30 percent will continue to receive a full scholarship. The rest will pay on a need-based sliding scale.</p>\n<p>Students who oppose the new policy say that it will undermine the school&#x2019;s meritocractic tradition. &#x201C;The moment you do that you have two lists&#x2014;one for the people you really want to get in and one for the people you know can afford it,&#x201D; said one architecture student who spoke on condition of anonymity.</p>\n<p>The occupied Foundation Building is off-limits to non-Cooper folk, but on May 20, fourth-year student Victoria Sobel, one of the sit-in organizers, told Gallerist by phone that about 14 students were occupying Dr. Bharucha&#x2019;s office that day. This isn&#x2019;t your parents&#x2019; 1968-style academic occupation. Videos recorded in Dr. Bharucha&#x2019;s office document students talking, working on computers and cleaning&#x2014;one Vine shows a Dustbuster inhaling crumbs off the carpet. &#x201C;At night everyone gets work done,&#x201D; said one student. &#x201C;The guards play ukulele.&#x201D;</p>\n<p>Though there are fewer protestors than there were before classes ended, Ms. Sobel said she and other students will stay put until their demands, which include Dr. Bharucha&#x2019;s resignation and student representation on the board of trustees, are met.</p>\n<p>&#x201C;I know that when you&#x2019;re in a protest, you want to see the change now, but boards are deliberative bodies,&#x201D; said Dr. Bharucha, who does not intend to step down. &#x201C;The committee on trustees has been gathering data on what the models are for student representation on boards and looking at the pros and cons.&#x201D;</p>\n<p>Ms. Sobel said she felt it was inappropriate to compare Cooper to other schools. &#x201C;I don&#x2019;t want them to research other models,&#x201D; she said. &#x201C;We want something new.&#x201D; A vote of no confidence in Dr. Bharucha and board chairman Mark Epstein had attracted 2,192 online signatures as of press time.</p>\n<p>&#x201C;The financial crisis predates me,&#x201D; said Dr. Bharucha. &#x201C;It&#x2019;s part of leadership that you&#x2019;re going to get people wanting to pin something on an individual &#x2026; but I feel at peace with the fact that I told the truth very fast as I saw the numbers being added up.&#x201D;</p>\n<p>&#x201C;The fundamental reason for our financial problem&#x2014;it&#x2019;s not the building,&#x201D; he said, referring to the costly construction of 41 Cooper Square, which critics like Reuters blogger Felix Salmon have repeatedly cited as an example of financial mismanagement. &#x201C;It is the simple but unsexy fact that our revenues have not kept pace with inflation. This goes back 45 years.&#x201D;</p>\n<p>Tensions between student protestors and the administration spiked on May 9, when the Cooper Union Emergency Management Team, which includes Dr. Bharucha and other administrators, sent students an ultimatum via e-mail, asking that they leave the office by 6:30 p.m. or face &#x201C;disciplinary action, which may include dismissal and/or denial of their degree.&#x201D; Security guards hired for the occasion&#x2014;the president later said he did not know they were armed&#x2014;manned the stairwells.</p>\n<p>&#x201C;They also bolted shut the bathroom doors on the seventh floor and turned the water fountains off so that the people occupying the office wouldn&#x2019;t have access to water or hygiene,&#x201D; said one architecture student.</p>\n<p>The administration has not taken further steps to remove the protestors, though it has not ruled out withholding diplomas. &#x201C;I&#x2019;ll just say that we&#x2019;re not looking to be vindictive,&#x201D; said Dr. Bharucha. &#x201C;We have every hope that we can resolve this in a way where it isn&#x2019;t necessary to impose penalties like that.&#x201D;</p>\n<p>Ms. Sobel says she and other protestors are not particularly concerned, given the pushback such penalties would elicit from supporters of the occupation. She said these supporters are what make her optimistic that the sit-in could result in changes at the school. &#x201C;This is the first time I&#x2019;ve seen the Cooper community rally like this,&#x201D; she said, noting the outcry from parents, alumni, faculty and prospective students, among other groups. On May 13, Dr. Bharucha met with the student occupiers in his office for the first time&#x2014;a conversation both parties described as somewhat strained.</p>\n<p>To restore free tuition, Dr. Bharucha said, &#x201C;would take a new endowment of $300 million over and above the capital campaign goals we have judged to be realistic.&#x201D; The administration projects it will raise about $13 million per year going forward.</p>\n<p>&#x201C;It&#x2019;s impossible to understand the way they&#x2019;re deriving these numbers because they won&#x2019;t allow us to see the books,&#x201D; said Ms. Sobel.</p>\n<p>&#x201C;It&#x2019;s so complicated that for some it seems more like something opaque is happening,&#x201D; said Dr. Bharucha. &#x201C;Unless you&#x2019;re willing to actually sit and learn that complexity, it&#x2019;s quite natural to just get angry and assume something untoward is going on.&#x201D;</p>\n<p>Both students and administrators indicated that communication is critical but presently nonexistent.</p>\n<p>&#x201C;We&#x2019;re speaking different languages,&#x201D; said Ms. Sobel.</p>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p id=\"reporter-feeds\">Follow Zo&#xEB; Lescaze <a href=\"http://twitter.com/@zoelescaze\">on Twitter</a> or <a href=\"http://galleristny.com/author/zlescazeobserver/feed/\">via RSS</a>. <em>zlescaze@observer.com</em></p>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>",
    "date_published": "2013-05-21 21:27:58",
    "dek": null,
    "lead_image_url": "http://nyogalleristny.files.wordpress.com/2013/05/cooper-union-david-shankbone.jpg?w=300&h=225",
    "title": "Cooper Occupation Enters Third Week With Protestors, Administration at Impasse",
    "rendered_pages": 1
}