{
    "domain": "napoleonnapoleon.com",
    "next_page_id": null,
    "url": "http://napoleonnapoleon.com/2013/05/11/the-coup-detat-of-cooper-union/",
    "short_url": "http://rdd.me/gq8qxkda",
    "author": null,
    "excerpt": "The Coup d&#x2019;&#xC9;tat of Cooper&#xA0;Union Posted by Liza C. on May 11, 2013 &#xB7; Leave a Comment&#xA0; For those of you who have been living in a box, Cooper Union recently made a pretty&hellip;",
    "direction": "ltr",
    "word_count": 403,
    "total_pages": 0,
    "content": "<div><div id=\"post-3167\" class=\"post-3167 post type-post status-publish format-standard hentry category-blog\">\n\n\t\t\t\t<div class=\"posttitle\">\n\n\t\t\t\t\t\t\t\t\t\t\t\t<h3>The Coup d&#x2019;&#xC9;tat of Cooper&#xA0;Union</h3>\n\t\t\t\t\t\n\t\t\t\t\t<div class=\"postauthor\">\n\t\t\t\t  \t\t <p>\n\t\t\t\t  \t\t \t\t\t\t\t  \t\t \tPosted by <a href=\"http://napoleonnapoleon.com/author/grrnyay/\">Liza C.</a> on May 11, 2013 &#xB7; <a href=\"http://napoleonnapoleon.com/2013/05/11/the-coup-detat-of-cooper-union/#respond\" title=\"Comment on The Coup d&#x2019;&#xC9;tat of Cooper&#xA0;Union\">Leave a Comment</a>&#xA0;\t\t\t\t  \t\t </p>\n\t\t\t   \t\t</div>\n\n\t\t\t\t\t\n\t\t\t\t</div>\n\n\t\t\t\t<p><a href=\"http://napoleonphiladelphia.files.wordpress.com/2013/05/4-29-cooper.jpg\"><img class=\"alignnone size-medium wp-image-3168\" alt=\"4-29-Cooper\" src=\"http://napoleonphiladelphia.files.wordpress.com/2013/05/4-29-cooper.jpg?w=300&amp;h=207\" width=\"300\"></a></p>\n<p>For those of you who have been living in a box, Cooper Union recently made a pretty significant announcement. Historically, the school has been free to any students who are accepted into the three highly selective programs: architecture, studio arts, and engineering. As a very small institution, Cooper Union lacks many of the amenities of other colleges and universities due solely to the fact that it does not charge tuition. Or didn&#x2019;t, rather, until the announcement was made two weeks ago that the school will start charging tuition in 2014.</p>\n<p>My initial reaction after hearing the news was one of total objectivity. Free tuition? Can that really last forever? &#xA0;I mean, is that really sustainable? With recession, depression, and inflation, can an institution of higher learning really pull off fully funding students interminably? It seems unlikely. Really, though, our opinions of what is possible don&#x2019;t matter in the slightest.</p>\n<p>This controversy is so similar to that of the Barnes Foundation, that my diatribes of injustice directed at the computer monitor were loud enough that someone might actually hear it in New York. What we are seeing is another trust broken due to poor financial choices, greed, and laziness. Any deficit at CU is the sole responsibility of the board of trustees, as is maintaining free tuition to all students. By changing this, they are in direct conflict with Peter Cooper&#x2019;s charter.</p>\n<p>So, we actually have two tragedies here. First, is the breaking of yet another sacred trust of a forward-thinking, impressively generous benefactor. The Trustees at CU have essentially tossed Peter Cooper&#x2019;s charter in the toilet. Like poop. And flushed. Second, the school faces competition with which it can&#x2019;t possibly compete. Why? Because it isn&#x2019;t LIKE other colleges and universities that charge tuition. It doesn&#x2019;t HAVE all of the amenities that charging-schools are able to offer.</p>\n<p>Cooper Union has gone from a fully philanthropic institute of higher learning, something wholly unique, and has entered the greater realm of colleges and universities that are also businesses and must operate as such. This being said, how is this school supposed to compete for students? My guess is that its future as one of the most highly ranked schools of its kind in the country is about to falter and its value is about to disintegrate.</p>\n<div id=\"jp-post-flair\" class=\"sharedaddy sd-like-enabled sd-sharing-enabled\"><div class=\"sharedaddy sd-block sd-like jetpack-likes-widget-wrapper jetpack-likes-widget-unloaded\" id=\"like-post-wrapper-33548889-3167-53f96c6ba70af\"><h3 class=\"sd-title\">Like this:</h3><p class=\"likes-widget-placeholder post-likes-widget-placeholder\"><span class=\"button\"><span>Like</span></span> <span class=\"loading\">Loading...</span></p><a class=\"sd-link-color\"></a></div>\n<p id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</p></div>\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t</div>\n\n\t\t\t\n\n\t   \t \t\n\n\t\t</div>",
    "date_published": "2013-05-11 19:08:52",
    "dek": null,
    "lead_image_url": "http://napoleonphiladelphia.files.wordpress.com/2013/05/4-29-cooper.jpg?w=300&h=207",
    "title": "The Coup d'État of Cooper Union",
    "rendered_pages": 1
}