{
    "domain": "pix11.com",
    "next_page_id": null,
    "url": "http://pix11.com/2013/05/29/cooper-union-students-turn-their-backs-on-president-bloomberg-at-graduation/",
    "short_url": "http://rdd.me/r38hqmny",
    "author": "James Ford",
    "excerpt": "EAST GREENWICH VILLAGE (PIX11) - It has a century-and-a-half tradition of offering a world class college education for free, but on Wednesday, The Cooper Union graduated its first class since the&hellip;",
    "direction": "ltr",
    "word_count": 983,
    "total_pages": 0,
    "content": "<div><div class=\"post-entry\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p><strong>EAST GREENWICH VILLAGE (PIX11) -</strong> It has a century-and-a-half tradition of offering a world class college education for free, but on Wednesday, The Cooper Union graduated its first class since the college told students that the free education is to be no more. &#xA0;In response, students at the cash-strapped school carried out a variety of unorthodox protests in front of one of the wealthiest people in the world: &#xA0;the keynote speaker, Mayor Michael Bloomberg.</p>\n<p>As students gathered before the 10:30 A.M. ceremony, they handed out small, red, felt squares to pin on their robes. &#xA0;The pieces of cloth were emblems of&#xA0;protest against the end of the college&#x2019;s 154-year mission of free tuition for everyone.</p>\n<p>The young woman handing out the protest squares, Victoria Sobel, had been singled out by the Cooper Union Alumni Association for their graduation prize, which she&#x2019;d won for her organizing to keep New York&#x2019;s free college free of charge.</p>\n<p>&#x201C;I&#xA0;am wholeheartedly committed to see that that remains true,&#x201D; Sobel told PIX11 News. &#xA0;&#x201D;I&#x2019;m optimistic, but I know it won&#x2019;t be easy.&#x201D;</p>\n<p>Senior Levi Mandel, who wore his red square on his chest, pointed out that graduation is supposed to be a happy occasion. &#xA0;Instead, &#x201C;It&#x2019;s&#xA0;very upsetting,&#x201D; he said. &#xA0;&#x201D;It&#x2019;s very emotional for everyone.&#x201D;</p>\n<p>Last month, the college officially announced that it would end its tuition free system starting in the fall of 2014. &#xA0;When the long-anticipated announcement was made, there were frequent, well attended protests in front of the East Village institution, and a group of about 15 students took over the college president&#x2019;s office in a call to action against imposing tuition payments.</p>\n<p>The students remain in occupation, but on graduation day, the protests were more subtle.</p>\n<p>&#x201C;We may be one of the final classes to have a mission statement that will never be forgotten,&#x201D; said James Sprung, the senior class speaker at the graduation ceremony, which was rife with tension. &#xA0;He was referring to the mission statement of the founder of the college, multi-millionaire inventor Peter Cooper, who established the institution to offer a college education gratis.</p>\n<p>During his speech, Sprung asked the entire class to stand and declare in unison their hope for a favorable outcome to the situation. &#xA0;At various points in his speech, the graduates erupted into applause regarding keeping the status quo of free tuition. &#xA0;Throughout, just behind Sprung, on the dais of Cooper Union&#x2019;s Great Hall, sat Mayor Michael Bloomberg and Cooper Union&#x2019;s president,&#xA0;Jamshed Barucha. &#xA0;Both men looked on during the applause, without clapping themselves.</p>\n<p>The institution&#x2019;s endowment, which is built around yearly rent payments from the landmark property it owns &#x2014; the land on which the Chrysler Building is built &#x2014; is under severe strain due to spending outpacing revenues. &#xA0;One of the main burdens to Cooper Union&#x2019;s overall financial health is the recently built campus building, 41 Cooper Square, designed by&#xA0;starchitect Thom Mayne. &#xA0;It remains without a sponsor, after the college paid for the $150 million structure to be built.</p>\n<p>Many students and alumni blame college president Jamshed Barucha for the financial problems. &#xA0;When Barucha spoke at the ceremony, about half of the graduates stood and turned their backs to him in protest.</p>\n<p>Next to speak was Mayor Bloomberg, who addressed the protests head on. &#xA0;After saying that the rights to an education and to protest are not free, but had instead been fought for by military members protecting American freedoms, Bloomberg said, &#x201C;As angry as you may be about the school&#x2019;s present situation, &#xA0;it&#x2019;s future really is yours to determine.&#x201D;</p>\n<p>There was no visible protest against the mayor or his words. &#xA0;In fact, the applause for him seemed strong as he encouraged Cooper Union to allow students and graduates to be more involved in the institution&#x2019;s governance. &#xA0;One of the major complaints of students, faculty and alumni protesters is that the college&#x2019;s governing system is secretive.</p>\n<p>The situation of a multibillionaire addressing the graduating class of a college drowning in red ink did beg the question asked of Mr. Bloomberg by PIX11 News. &#xA0;Would he consider supporting Cooper Union more significantly with his own personal finances?</p>\n<p>&#x201C;Well, I do have a school in Baltimore,&#x201D; the mayor responded, half jokingly, referring to his alma mater, Johns Hopkins University, to which he is giving $350 million. &#xA0; He added, regarding Cooper Union&#x2019;s tuition, &#x201C;The issue isn&#x2019;t whether it&#x2019;s free. &#xA0;The issue is who has to pay.&#x201D;</p>\n<p>He again encouraged the institution to resolve its financial situation, and said that it&#x2019;s typical for colleges to charge students who can afford tuition, and to use that money to provide scholarships for those who can&#x2019;t.</p>\n<p>Cooper Union President&#xA0;Jamshed Barucha echoed that comment in an interview with PIX11 News, but also pointed out that his college is looking for an angel donor to fill a $300 million budget and endowment hole. &#xA0;Without a major donor, he said, Cooper Union could only hope to make ends meet with charging tuition in the range of $20,000 a year, per student.</p>\n<p>&#x201C;We&#x2019;re going to seek to raise as much money as we can [before charging tuition],&#x201D; Barucha told PIX11 News, &#x201C;and the more money we raise for scholarships, the less the tuition will be.&#x201D;</p>\n<p>When he was asked if Mayor Bloomberg might be recruited to become the badly-needed angel donor, Barucha simply laughed. &#xA0;Hard.</p>\n<p>Meanwhile, in Barucha&#x2019;s office, 12 to 15 students remain, around the clock, receiving food and other supplies paid for by sympathetic alumni.</p>\n<p>DeVonn Francis is one member of the group. &#xA0;&#x201D;We&#x2019;re not going away,&#x201D; he said in an interview with PIX11 News. &#xA0;&#x201D;We&#x2019;ll be here through the summer&#x201D; and beyond, he said, until the college takes steps to right its finances, or until President Barucha steps down, he said, or both.</p>\n<p>Meanwhile, the student protest group, @FreeCooperUnion, has claimed a minor victory. &#xA0;The results of recent alumni committee elections placed graduates who advocate for keeping free tuition in positions of leadership in that advisory organization.</p>\n\t\t\t\t\t\t\n\t\t\t\t\t</div> \n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t \n\n\t\t\t\t\t</div>",
    "date_published": "2013-05-29 00:00:00",
    "dek": null,
    "lead_image_url": "http://tribwpix.files.wordpress.com/2013/05/24850432-sf.jpg?w=300",
    "title": "Graduating Cooper Union students turn their backs on school president, Bloomberg",
    "rendered_pages": 1
}