{
    "domain": "www.truthdig.com",
    "next_page_id": null,
    "url": "http://www.truthdig.com/eartotheground/item/nyc_students_defend_free_higher_education_20121204/",
    "short_url": "http://rdd.me/n10ptkun",
    "author": null,
    "excerpt": "After the president of one of the last tuition-free universities in the United States announced that the school would begin charging tuition fees to graduate students, 11 students occupied a campus&hellip;",
    "direction": "ltr",
    "word_count": 506,
    "total_pages": 0,
    "content": "<div><div class=\"section1\">\n\n\n\n\n\n\n \n\n \n\n \n \n \n\n \n    \n\n  \n\n\n \n\n    \t\t\t<p>After the president of one of the last tuition-free universities in the United States announced that the school would begin charging tuition fees to graduate students, 11 students occupied a campus building to &#x201C;demand that the school reaffirm its commitment to providing free education&#x201D; and a revision of the school&#x2019;s management style.</p>\n\n<p>They also called for the resignation of Jamshed Bharucha, the university&#x2019;s president.</p>\n\n<p>Cooper Union in Manhattan has provided free education to all its students for more than a century. Its protesters can be counted among a recent trend of student activism against rising education prices around the world, including in California, London, Montreal and several cities in South America.</p>\n\n<p>Rachel Appel, a senior in Cooper Union&#x2019;s art school, said the occupiers were aware of their part in the global rumblings. &#x201C;We feel that Cooper Union represents the issue of rising tuition costs nationwide, which are endemic,&#x201D; she said. Appel helps organize Students for a Free Cooper Union and protesters who work with the outside world.</p>\n\n<p>On Monday at noon, the 11 occupiers entered the Foundation Building&#x2019;s Peter Cooper suite and sealed the entrance with wood and steel. They then dropped a banner from the front of the building that read &#x201C;FREE EDUCATION FOR ALL.&#x201D; Within minutes, university maintenance staff attempted to tear the barricade down. The students kept their bodies pressed against the doors amid the sounds of saws and drills. By the time the sounds stopped, no one was injured.</p>\n\n<p>The occupiers have a <a href=\"http://freecooperunion.com\" title=\"website\">website</a>, a <a href=\"https://twitter.com/freecooperunion\" title=\"Twitter account\">Twitter account</a> and a <a href=\"http://www.livestream.com/occupynyc\" title=\"livestream\">livestream</a> of the inside of the occupation. Participants said they were ready to stay for the long haul, as they have plenty of food and the Peter Cooper suite is equipped with a bathroom.</p>\n\n<p><i>&#x2014;Posted by <a href=\"http://www.truthdig.com/alexander_kelly\" title=\"Alexander Reed Kelly\">Alexander Reed Kelly</a>.</i></p>\n\n<blockquote><p><b>Ned Resnikoff at The Ed Show:</b></p>\n\n<p>&#x201C;Most people found that out from an exclusive he gave to the New York Times instead of talking to the community,&#x201D; said Casey Gollan, a senior in the Cooper Union School of Art and one of the occupiers. When the administration speaks, he said, &#x201C;all of the rhetoric is about community involvement, but actually they&#x2019;ll just silence people and then move forward.&#x201D;</p>\n\n<p>Gollan and others who support the protest said the administration had spent months pushing the school away from its core mission of offering free education to the student body. Speaking off the record, two full-time undergraduate professors said they felt &#x201C;coerced&#x201D; by the administration into coming up with proposals to charge students tuition.</p>\n\n<p>&#x201C;I&#x2019;ve been told point-blank my job is on the line if I don&#x2019;t participate,&#x201D; said one professor, who added that the warning had come straight from the university dean. &#x201C;They never made a direct threat,&#x201D; he said. &#x201C;The threat was essentially, you either participate in revenue-generating programs, or your school would be closed.&#x201D;</p>\n\n<p><a href=\"http://tv.msnbc.com/2012/12/04/cooper-union-students-stage-civil-disobedience-in-defense-of-free-higher-ed/\" title=\"Read more\">Read more</a></p></blockquote>\n    \t\n\n\n\n\n\n\t<p><em><a href=\"http://www.truthdig.com/eartotheground/item/nyc_students_defend_free_higher_education_20121204/#below\">More Below the Ad</a></em></p>\n<div id=\"storyad2\">\n<p><strong>Advertisement</strong></p>\n<a href=\"http://www.truthdig.com/banners/www/delivery/ck.php?n=abee66dc&amp;cb=103513768\" target=\"_blank\"><img src=\"http://www.truthdig.com/banners/www/delivery/avw.php?zoneid=8&amp;cb=103513768&amp;n=abee66dc\" border=\"0\" alt=\"\"></a>\n\n</div><a name=\"below\" id=\"below\"></a>\n  \n\n\n\n\n  \n\n\n\n\n      \n\n\n\n\n  \n\n\n\n\n      \n  \n  \n                  \n   \n\n\n \n\n\n\n\n\n\n\n\n\n<br clear=\"all\"><a name=\"comments\"></a>\n\t<h2>New and Improved Comments</h2>\n\t\n\t<p>If you have trouble leaving a comment, review <a href=\"http://docs.disqus.com/kb/commenting/\">this help page</a>. Still having problems? <a href=\"http://www.truthdig.com/contact/\">Let us know</a>. If you find yourself moderated, take a moment to review our <a href=\"http://www.truthdig.com/about/comment_policy/\">comment policy</a>.</p>\n\t\n\t\n\t\n\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n</div>\n\n</div>",
    "date_published": "2012-12-04 23:18:39",
    "dek": null,
    "lead_image_url": "http://www.truthdig.com/images/eartothegrounduploads/6107166850_9ca9203f55_copy160.jpg",
    "title": "NYC Students Defend Free Higher Education",
    "rendered_pages": 1
}