{
    "domain": "www.good.is",
    "next_page_id": null,
    "url": "http://www.good.is/posts/reaffirming-free-education-for-all-cooper-union-students-take-stand-on-tuition-debt/",
    "short_url": "http://rdd.me/gort9rge",
    "author": "FREE COOPER UNION",
    "excerpt": "After two years of organizing support for The Cooper Union&#x2014;an institution historically devoted to free education, now threatened by deficit, expansion, and tuition&#x2014;a group of students&hellip;",
    "direction": "ltr",
    "word_count": 472,
    "total_pages": 0,
    "content": "<div><div class=\"body\"><p>\t<img alt=\"\" id=\"asset_487329\" src=\"http://pre.cloudfront.goodinc.com/posts/full_1354558587IMG_9899-11-768x1024.jpg\"></p><p>\tAfter two years of organizing support for <a href=\"http://cooper.edu/\">The Cooper Union</a>&#x2014;an institution historically devoted to free education, now threatened by deficit, expansion, and tuition&#x2014;a group of students has come together as <a href=\"http://www.cusos.org\">Free Cooper Union</a>. We have called for a <a href=\"http://www.cusos.org/day-of-action-free-university-schedule/\">Day of Action </a>today, Monday, December 3rd, 2012, to continue bringing attention to the growing crisis of student debt and rising tuition costs worldwide. Drawing from the momentum of recent student movements, we demand the preservation and affirmation of Cooper Union&#x2019;s ethical model of free higher education.</p><p>\tThe Day of Action will include performances, speak outs, free classes and various autonomous happenings. At night, we will transition into a Summit on Debt and Education hosted in the college&#x2019;s historic Great Hall, featuring activists, artists, and speakers from <a href=\"http://allinthered.org/\">All in the Red</a>, <a href=\"http://strikedebt.org/\">Strike Debt</a>, and <a href=\"http://occupystudentdebt.com/\">Occupy Student Debt</a>. The summit will address subjects such as the rising costs of higher education, the history of student protest movements, and organizing around debt. Like the rest of the Day of Action, the Summit is free and open to the public.</p><p>\tTiming is critical for these conversations: the Day of Action has been scheduled just days before tuition-based educational programs are to be presented to Cooper Union&#x2019;s Board of Trustees. Though the consideration of tuition will not impact us as current students, we are defending what future generations rightfully deserve: free education. The Cooper Union&#x2019;s current administration has envisioned an expansionist model intended to grow the college out of a financial deficit caused by decades of administrative mismanagement. These programs have threatened the college&#x2019;s landmarked tradition of \"free education to all\" and corrupted the ideals of education as a whole.</p><p>\tHigher education, once a means of social mobility and intellectual liberation, has devolved into an industry that has burdened students with over one trillion dollars in debt to date. We can change this broken system with transparency, integrity, and democratic decision-making. Extended members of the Cooper Union community came together last year to present a set of sustainable recommendations to strengthen the college&#x2019;s roots locally and without charging tuition. These efforts were met with ambivalence from the administration. Despite our administration&#x2019;s refusal to acknowledge our alternatives to their expansionist model, we will continue to champion a restructured means to sustainable free education. The undervaluing of student voices and the continuous dismissal of calls for transparency are destructive commonalities among institutions of higher education.</p><p>\tWe must rebuild the governance of these institutions with open flows of information, democratic decision-making structures, and access to free education. Carrying on this task will require principled, rather than self-sustaining, leadership and active participation from surrounding communities. Education is a right, and the public must rise to affirm it.</p><p>\tWe invite you to attend our <a href=\"http://www.cusos.org/for-immediate-release-free-cooper-unions-day-of-action/\">Day of Action</a> and insist the public take back the dialogue about higher education!</p><p>\tLearn more at <a href=\"http://www.cusos.org\">CUsos.org</a> or follow us on Twitter <a href=\"http://twitter.com/FreeCooperUnion\">@freecooperunion</a> or <a href=\"http://www.facebook.com/FreeCooperUnion\">Facebook.com/FreeCooperUnion</a></p></div>\n            </div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://pre.cloudfront.goodinc.com/posts/full_1354558587IMG_9899-11-768x1024.jpg",
    "title": "Reaffirming 'Free Education for All': Cooper Union Students Take Stand on Tuition Debt",
    "rendered_pages": 1
}