{
    "domain": "www.wnyc.org",
    "next_page_id": null,
    "url": "http://www.wnyc.org/story/295896-blog-cooper-union-student-protests-spill-graduation-ceremony/",
    "short_url": "http://rdd.me/1zekwnxl",
    "author": "Stephen Nessen : Reporter, WNYC News",
    "excerpt": "Peter Cooper statue outside Cooper Union on graduation day 2013. (Stephen Nessen/WNYC) Cooper Union's graduating class used Wednesday's ceremony to display their disapproval for the school's plan to&hellip;",
    "direction": "ltr",
    "word_count": 221,
    "total_pages": 0,
    "content": "<div><div class=\"story-longimage\">\n    \n\n    <img src=\"http://www.wnyc.org/i/620/372/c/80/1/Graduation-Day-at-Cooper-Union.jpg\" title=\"Peter Cooper statue outside Cooper Union on graduation day 2013.\" alt=\"Peter Cooper statue outside Cooper Union on graduation day 2013.\">\n      \n\n\n\n\n<span class=\"caption\">Peter Cooper statue outside Cooper Union on graduation day 2013.</span>\n\n\n<span class=\"credit\">\n(Stephen Nessen/WNYC)\n</span>\n\n\n\n\n      </div>\n\n\n\n    <div class=\"article-description\">\n      <p>Cooper Union's graduating class used Wednesday's ceremony to display their disapproval for the school's plan to begin charging tuition in 2014, for the first time in its history. Many students, including the student speaker, refused to shake hands with President Jamshed Bharucha when receiving their diplomas on stage.</p>\n    </div>\n\n  \n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n    <div class=\"article-description\">\n      <p>Wearing a red square on his gown, a symbol from Montreal's student protests against tuition increases, student commencement speaker James Allister Sprang gave part of his speech using a call and response technique known as the human microphone.</p>\n<p>\"Hope is everything, a fresh way to approach a dull or dangerous thing. To do a dull thing with hope will never be preferable to doing a dangerous thing with hope,\" he said. \"To do a dangerous thing with hope, is what I call art.\"</p>\n<p>Receiving an honorary degree and giving the commencement address Mayor Michael Bloomberg said he's not weighing in on the tuition issue. He said he understands the student's frustrations, and that as graduates, they should give back what they can.</p>\n<p>\"When you walk out these doors today, do not leave the passion you've shown for this institution and it's past and its future behind,\" Bloomberg said. \"Stay involved, stay committed, and do what Peter Cooper did, donate what you can.\"</p>\n\n    </div>\n\n\n  \n  \n    \n\n\n  \n\n\n\n\n\n\n\n  \n\n  \n    </div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.wnyc.org/i/620/372/c/80/1/Graduation-Day-at-Cooper-Union.jpg",
    "title": "Cooper Union Student Protests Spill into Graduation Ceremony",
    "rendered_pages": 1
}