{
    "domain": "www.theatlantic.com",
    "next_page_id": null,
    "url": "http://www.theatlantic.com/business/archive/2013/05/why-american-colleges-are-becoming-a-force-for-inequality/275923/",
    "short_url": "http://rdd.me/f86wmgdk",
    "author": "Josh Freedman",
    "excerpt": "We like to view higher education as the \"great equalizer\" that leads to social mobility. But selective colleges have long been accused of perpetuating class divides, rather than blurring them. A&hellip;",
    "direction": "ltr",
    "word_count": 3012,
    "total_pages": 0,
    "content": "<div class=\"article-content\" score=\"32.5\">\n\n                                    \n                \n        <p><a href=\"http://cdn.theatlantic.com/static/mt/assets/business/800%20harvard%20college.jpg\"><img alt=\"800 harvard college.jpg\" src=\"http://cdn.theatlantic.com/static/mt/assets/business/assets_c/2013/05/800%20harvard%20college-thumb-570x285-121583.jpg\" class=\"mt-image-center\" width=\"570\"></a></p>\n\n\n<p>We like to view higher education as the \"great equalizer\" that leads to social mobility. But selective colleges have long been accused of <a href=\"http://campaignstops.blogs.nytimes.com/2012/03/12/the-reproduction-of-privilege/\">perpetuating</a> class divides, rather than blurring them.</p>\n\n<p>A recent landmark <a href=\"https://www.nber.org/papers/w18586\">study</a> by Stanford's Caroline Hoxby and Harvard's Christopher Avery lent further empirical evidence to this accusation, finding that high-achieving low-income students do not have access to selective schools. The study showed that the mismatch is due to a lack of knowledge, not quality. Low-income students outside of major urban centers do not even apply to the top-tier colleges for which they are qualified.</p>\n\n\n<p>Many commentators and the study authors themselves have looked for ways to alleviate this mismatch. A follow-up study found that supplying basic information to applicants <a href=\"http://www.nytimes.com/2013/03/31/opinion/sunday/a-simple-way-to-send-poor-kids-to-top-colleges.html?pagewanted=all\">could substantially increase</a> the number of low-income students applying to more selective schools. Just giving low-income kids packets of information helped them apply to better schools.</p>\n\n<p>Yet while the information gaps are real and need to be addressed, there is a much deeper structural problem. If most top colleges wanted to be truly equitable, they could not be with their current business model. There is not a golden pot of low-income applicants that schools want but are failing to reach. Instead, many schools don't want more low-income students because they won't be able to pay for them without a major overhaul of school funding practices. Outside of the handful of super-elite universities with fortress endowments, colleges' finances are currently designed around enrolling a disproportionately high number of high-income students. These schools could not afford to support more low-income or middle-income students absent either a huge increase in tuition, a commensurate reduction in spending, or a dramatic change in public funding.</p>\n\n<p>In fact, schools are already moving away from a more equitable system. Colleges actively recruit \"full pay\" students who can attend and will not need financial aid. A <a href=\"http://www.insidehighered.com/sites/default/server_files/files/9-20finaladmissionsreport.pdf%5D\">2011 survey</a> by Inside Higher Ed found that about 35 percent of admissions directors at 4-year institutions, particularly public colleges, had increased their efforts to target \"full pay\" students. Far from wanting to enroll more low-income students, colleges recruit more affluent ones who will pay full price to attend. A <a href=\"http://www.insidehighered.com/content/2012-inside-higher-ed-survey-college-university-business-officers\">follow-up survey</a> of college business officers found that the most common strategy to deal with financial challenges in the next few years was to \"raise net tuition revenue.\" More than 7 in 10 college CFOs cited this answer. In other words, schools are becoming more reliant on the inequality in the system than ever before.</p>\n\n<p>If colleges cannot even currently support their business model with enrollment skewed toward higher-income students, a fairer distribution would make the system completely dysfunctional. What's really holding back a more equitable distribution of access to selective colleges is the financial model of colleges. For systemic reform to work, the government will have to take a leading role in fixing incentives and stopping the college spending arms race in its tracks.</p>\n\n<p><b>High-Aid, But Not Enough Poor Students</b></p>\n\n<p>What would selective college populations look like if their student body perfectly reflected the population of qualified students? The short answer is: They would have many more poor students -- and it would wreak havoc on their finances.</p><p><a href=\"http://cdn.theatlantic.com/static/mt/assets/business/Screen%20Shot%202013-05-16%20at%2011.36.00%20AM.png\"><img alt=\"Screen Shot 2013-05-16 at 11.36.00 AM.png\" src=\"http://cdn.theatlantic.com/static/mt/assets/business/assets_c/2013/05/Screen%20Shot%202013-05-16%20at%2011.36.00%20AM-thumb-520x358-121569.png\" class=\"mt-image-center\" width=\"520\"></a></p>\n\n<p>High-income students account for about a third of the high-achieving students graduating from high school (see graph above). But estimates suggest that <a href=\"http://tcf.org/assets/downloads/tcf-leftbehindrc.pdf\">74 percent of students</a> at the top 146 top colleges came from the richest quartile of households. The Center for Education Policy Analysis (CEPA) at Stanford looked at\n 174 top schools and noted that richest 20 percent of households were <a href=\"http://tcf.org/assets/downloads/tcf-leftbehindrc.pdf\">seven to eight times more likely to enroll in a selective institution</a>\n than those from the poorest 20 percent, even though Hoxby and Avery's \nresearch suggests that a fairer distribution should be two to one. The \nCEPA team also found that the gap between the highest and lowest income \ngroups in college enrollment has increased over time, \"as more and more \nseats in highly selective schools have been occupied by students from \nhigh income families.\"<br></p>\n\n\n<p>What would the current high-tuition, high-aid model look like with an enrolled student body that reflects the true distribution of high-achieving students? </p>\n\n<p>At The George Washington University, right around the corner from my office in Washington, D.C., the advertised price is $58,985 for the <a href=\"http://nces.ed.gov/collegenavigator/?q=George+Washington+University&amp;s=all&amp;id=131469#expenses\">2012-2013 school year</a>. For the more than 4,000 undergraduate students (out of about 10,000) who are judged to be unable to afford the advertised cost, GW provides an average of $36,789 in aid to offset this cost. </p>\n\n<p>If GW's demographic profile matched the actual distribution of high-achieving students - that is, if there were one bottom-quartile student for every two top-quartile students -- GW's revenue would plummet by about 20 percent. The school would have to raise its tuition for students that are paying full price. But there would be far fewer of them. To take in the same amount of money as they currently do, GW would have to raise its price by approximately $30,000 per full-pay student, for a sticker price of about $90,000 a year. The actual increase would likely need to be more, given that families making $120,000 per year are classified as high income but cannot afford a college cost that would consume three-fourths of their annual income.</p>\n\n<p>This is not a sustainable model. Colleges will not be able to raise sticker prices to these levels while <a href=\"http://chronicle.com/blogs/conversation/2012/11/26/the-net-price-myth/\">preserving enough aid for low- and middle-income students</a>. They will either raise prices across the board or recruit more affluent students. </p>\n\n<p>Either way, the unequal system will remain.</p>\n\n<p><strong>How to Keep Prices Down: Be Really Rich</strong></p>\n\n<p>Not all colleges, however, would need to raise tuition drastically to pay for a larger number of low-income students. Schools with large endowments can cover the shortfall in tuition by drawing money from these reserves. But keeping tuition constant and paying more from the endowment is only an option for schools with <a href=\"http://www.theamericanconservative.com/articles/paying-tuition-to-a-giant-hedge-fund/\">monstrous endowments</a>. </p>\n\n<p>Many writers cite Amherst College as a success story, which has \"aggressively recruited poor and middle-class students in recent years\" and has increased its share of low-income students. But Amherst has a very large endowment for the size of its student body. Its strategy is only viable when backed with an endowment of more than three quarters of a million dollars per student from which it can draw additional funds to cover its costs while remaining competitive in its levels of spending.</p>\n\n<p>Amherst is better than others, however. Some schools that already do have sizable endowments and could increase aid are instead decreasing it. Cornell, which has an endowment of about $5 billion, took $35 million from its endowment in 2009-2010 to fund financial aid. It is now <a href=\"http://www.bloomberg.com/news/2012-08-09/cornell-mit-scale-back-aid-even-as-endowments-rise.html\">changing its policy</a> to draw less from the endowment, which includes lowering its financial aid policies. </p>\n\n<p>For GW, with $1.33 billion in its endowment (about 1/18 of Amherst's per student), it's more difficult to use the endowment as a primary backstop. GW only has around 11.7 percent of its endowment, or $155 million, <a href=\"https://giving.gwu.edu/sites/giving.gwu.edu/files/downloads/endowment_report.pdf\">available for student aid</a>. As such, GW - and most selective schools - would only be able to preserve student revenues by raising tuition.</p>\n\n<p><b>The Public College Crisis</b></p>\n\n<p>This problem is not reserved for private colleges and universities like GW. In fact, the problem is even worse at public universities. </p>\n\n<p>In addition to competing with private schools, public universities are dealing with cutbacks in public funding as state governments turn to austerity to restore their balance sheets. State funding for colleges and universities <a href=\"http://www.deltacostproject.org/resources/pdf/Trends-in-College-Spending-98-08.pdf\">dropped substantially</a> after the 2001 and 2008 recessions. States are now spending <a href=\"http://www.cbpp.org/cms/index.cfm%3Ffa=view%26id=3927%23\">28 percent less</a> per college student than they were in 2008, according to the Center on Budget and Policy Priorities, and the College Board <a href=\"http://trends.collegeboard.org/sites/default/files/college-pricing-2012-full-report-121203.pdf\">reports</a> that average state appropriations for higher education per $1,000 in personal income have declined from $9.74 in 1990 to $5.63 today. These budget cuts have forced states to raise their tuitions in turn. Over just the last 10-year period, combined tuition, fees, and room and board at public 4-year universities have increased 45 percent in inflation-adjusted dollars.</p>\n\n<p>Flagship public universities illustrate this trend. Every flagship state university has seen its tuition increase faster than inflation over the last five years. The biggest price increases are enormous. The University of Arizona raised its tuition 81 percent above inflation, and five other schools saw tuition increases of <a href=\"http://trends.collegeboard.org/college-pricing/figures-tables/tuition-and-fees-flagship-universities-over-time\">more than 50 percent in real terms</a>. As one CFO of a public university <a href=\"http://www.newrepublic.com/article/112731/moocs-will-online-education-ruin-university-experience\">explained</a> to Andrew Delbanco, the author of College: What it Was, Is, and Should Be, the issue at public schools is \"not so much the cost of college, but the shift of the financial burden from the state to the student.\" If these trends continue, public universities will limit access to low-income students and increase the number of affluent students. This will create a more unequal system than the already unequal one we currently have.</p>\n\n<p><b>Can the Drive for Reputation Save Us?</b></p>\n\n<p>All of these calculations assume that colleges do not, and will not, change their spending. But perhaps the key to fixing the structural problem lies on the spending side, rather than the revenue side. Spending is not bad per se. If increased spending is necessary to contribute to the quality of the education or on increased financial aid, it would be good for colleges to continue to spend this money. Unfortunately, much of the spending has been on new buildings, administration, or \"amenities\" spending, rather than on the education itself. <br></p>\n\n<p>Financial aid demands will rise for schools that want to attract more low-income students, as David Leonhardt of <i>The New York Times</i> <a href=\"http://www.nytimes.com/2013/03/17/education/scholarly-poor-often-overlook-better-colleges.html\">notes</a>. He is hopeful that the drive for reputation that includes a commitment to equity and supporting low-income students will encourage colleges to ditch the arms race of spending on new buildings and sports teams. If the <a href=\"file://///naf.lan/srv/Pub/Shared/Am%20Strat%20&amp;%20Econ%20Growth/Josh%20Freedman/Independent%20Projects/The%20Positional%20Arms%20Race%20in%20Higher%20Education\">spending arms race</a> is a fight for more spending on financial aid, rather than other expenditures, it would be an arms race worth having. He writes: </p>\n\n<blockquote><p>\"It is hard to think of a form of spending more consistent with top colleges' self-image and mission than scholarships for low-income students who have managed to overcome barriers and excel.\"</p></blockquote>\n\n<p>The problem, however, is that the capital arms race burnishes a school's reputation far more than a greater commitment to low-income students. Under the current set of incentives, colleges are rewarded for providing more of these \"amenities\" expenditures but not greater access.</p>\n\n<p>A recent <a href=\"https://www.nber.org/papers/w18745\">NBER working paper</a> found that students value non-instructional amenities and are more likely to attend an institution that spends more on consumption amenities. While high-achieving students also value more spending on instruction (whereas low-achieving students do not, and even think additional instruction is bad), both high-achieving and low-achieving students tend to favor amenities. Universities, responding to this \"demand-side pressure,\" spend more money on these consumption amenities, thus driving up the need for revenue.</p>\n\n<p>Moreover, the current amenities expenditure arms race has succeeded for schools. Before Stephen Joel Trachtenberg took over GW in 1988, the school was <a href=\"http://www.washingtonmonthly.com/college_guide/feature/the_prestige_racket.php%3Fpage=all\">\"a nonentity in national rankings.\"</a> Last year it was ranked 51st in the annual U.S. News and World Report list. \"Spending more money can lead to higher rankings,\" writes the <a href=\"http://centerforcollegeaffordability.org/25-ways/improve-competition/promote-competition\">Center for College Affordability</a>. This perverse incentive encourages the higher spending that leads again to the need for more revenue. Colleges then compete to outspend each other, leading to the never-ending arms race.</p>\n\n<p>A recent report by my colleague at the New America Foundation, Stephen Burd, tracked colleges' net price for low-income students and <a href=\"http://edmoney.newamerica.net/blogposts/2013/the_higher_ed_arms_race_how_the_high_tuition_high_aid_model_shuts_out_low_income_stud\">what percentage of their students receive federal Pell Grants</a>. Pell Grants can serve as a proxy for how many low-income students are enrolled. Of the 22 selective schools that enrolled a larger share of Pell Grant recipients and kept net price for these students low, only five schools had endowments smaller than $150,000 per student. None of these five schools were ranked in Barron's \"most competitive\" category. In other words, providing affordable access to more low-income students does not translate into a better reputation. Capital spending of the kind pioneered by GW's Trachtenberg does.</p>\n\n<p>It is difficult to hope that colleges will change their path when the current one they are on has succeeded for their brand, even if it leaves lower- and middle-income students behind.</p>\n\n<p>Perhaps the best example of capital spending trumping financial access is the story of Cooper Union, a small elite private school in New York City that has been free for students since its founding in 1859. Cooper Union used to fund itself on the proceeds from owning the land underneath the Chrysler building and other land assets in New York. To increase its reputation, the school <a href=\"http://blogs.reuters.com/felix-salmon/2013/04/29/the-tragedy-of-cooper-union/\">tried to build its brand</a> by building a fancy building. But facing large deficits after taking out a $175 million mortgage to erect the new building and incurring investment losses in the financial crash, the school's board of trustees announced that Cooper Union will start charging undergraduate students tuition in 2014. The consequence of the capital spending, combined with other financial struggles, is that something had to give. Undergraduate students will now be charged tuition (up to about $20,000 per year)<a href=\"http://www.nytimes.com/2013/04/24/nyregion/cooper-union-to-charge-undergraduates-tuition.html?pagewanted=all\"> for the first time in the school's history</a>. <br></p><p>If reputation cannot slow the spending arms race, could technology? The rise of massively-open online courses, or MOOCs, raises the possibility that we could slash the price of college by replacing expensive college campuses with a broadband connection. But if digital colleges are going to have an effect, it will likely be felt at non-selective low-quality schools, such as for-profits, that currently leave students with <a href=\"http://www.nytimes.com/2012/07/30/education/harkin-report-condemns-for-profit-colleges.html?_r=0\">few opportunities and plenty of debt</a>. At selective schools, the introduction of online learning does not change the basic incentive structure that pushes schools to spend for the sake of their brand.</p><p><b>What Can Be Done?</b></p>\n\n<p>In an optimistic scenario, finding ways to increase the information available to high-achieving low-income students would increase the number of applications and put pressure on colleges to end the amenities arms race, decrease costs, and spend more time and resources on learning and education supports.</p>\n\n<p>But a more likely scenario is bleaker. Even if we end the information mismatch, colleges will find ways to preserve their existing business models to avoid fundamental reform. Once again, colleges already do this. Not only do they actively recruit full-pay and out-of-state students, they engage in a practice called \"admit-deny.\" As Burd <a href=\"http://education.newamerica.net/sites/newamerica.net/files/policydocs/Merit_Aid%20Final.pdf\">writes</a>, admit-deny is when \"schools deliberately underfund financially needy students in order to discourage them from enrolling.\" Nearly two-thirds of private colleges and one-third of public schools currently engage in this practice.</p>\n\n<p>We need to fix the underlying incentives, and the best institution to lead these changes is the government. It is necessary to have a large public role to guarantee that a basic postsecondary education is not merely a luxury for the wealthy but is instead available, affordably, to every student who wants it. </p>\n\n<p>A public sector that is not caught up in the arms race should serve as the proper \"public option\" to attempt to <a href=\"http://www.newamerica.net/publications/policy/no_discount_comparing_the_public_option_to_the_coupon_welfare_state\">drive down costs</a> at private schools in a semi-competitive sphere. The cutbacks in public funding of higher education have made it more difficult for public institutions to keep their prices down and provide a comparable quality of education. The fact that public schools are actively recruiting full-pay and out of state students means that they are moving away from their necessary function as the core provider of higher education to residents in its state. We need not only to restore funding of public universities, but substantially increase it.</p>\n\n<p>Additionally, many of these schools are reliant on federal aid and federal loan programs to finance their students' educations. For example, the government provides Pell Grants to low-income students up to an amount of $5,550 and subsidizes student loans. Rather than continue to offer federal aid to schools that absorb these costs and continue to operate under the unsustainable high tuition, high-aid model, the government can tie its financial aid support to the elimination of the arms race. </p>\n\n<p>As with a military arms race, no individual actor in the education arms race will voluntarily pull back. Only an external force, like the public sector, can make across-the-board changes to fix the problem. The government has leverage because of the importance of federal programs like Pell Grants and subsidized student loans.</p>\n\n<p>To end the arms race, the government should decrease or eliminate federal money to students at schools that continue to increase prices while enrolling disproportionate levels of high income students. Schools would then need to prioritize costs and access, rather than spending and reputation, to be able to function. And no individual school would have to unilaterally draw back.</p>\n\n<p>More broadly, the public sector can also help drive down runaway costs by pushing for policies to promote full employment and the creation of good jobs that do not require a college education. When college is all but required to be able to have access to decent quality jobs, colleges can extract economic \"rents\" because there is no alternative for people entering the labor force. For students who need access to college as an economic stepping-stone to future employment, simultaneous changes on both the educational and labor market fronts can increase the chances of successful reform. Labor market policies to put pressure on college costs can range from creating more useful, high-quality public sector jobs, like childcare and eldercare services, to <a href=\"http://newamerica.net/publications/policy/raising_american_wagesby_raising_american_wages\">increasing the minimum wage</a> or supporting workers' bargaining power.</p>\n\n<p>Any and all of these policies will help drive down the natural inclination for colleges to pursue the arms race and push schools back to the quality, accessible education they should be providing.</p>\n\n<p>Until the underlying problems of arms-race expenditures and declining public funding are addressed, colleges will continue to use high-cost, high-aid strategies that are inherently unsustainable and inequitable. Many selective schools derive their status because of the information asymmetry, not in spite of it. It is the structural deficiencies in the higher education system that are pushing college further away from being the much-hallowed \"great equalizer\" and instead perpetuating privilege for those who can pay.</p>\n        \n            </div>\n\n",
    "date_published": "2013-05-16 12:11:00",
    "dek": "Higher education should be closing the gap between the rich and the poor. But college economics are driving them further apart",
    "lead_image_url": "http://cdn.theatlantic.com/static/mt/assets/business/assets_c/2013/05/800%20harvard%20college-thumb-570x285-121583.jpg",
    "title": "Why American Colleges Are Becoming a Force for Inequality",
    "rendered_pages": 1
}