{
    "domain": "www.usatodayeducate.com",
    "next_page_id": null,
    "url": "http://www.usatodayeducate.com/staging/index.php/ccp/6-campus-protests-that-captured-the-nations-attention-in-2012",
    "short_url": "http://rdd.me/hf3krxgi",
    "author": "Jordan Friedman",
    "excerpt": "After the University of Virginia&#x2019;s (UVA) Board of Visitors called for the forced resignation of the school&#x2019;s president, Teresa Sullivan, during the summer, students, faculty and alumni&hellip;",
    "direction": "ltr",
    "word_count": 1282,
    "total_pages": 0,
    "content": "<div><div class=\"blogpost\">\n<p>After the University of Virginia&#x2019;s (UVA) Board of Visitors called for the forced resignation of the school&#x2019;s president, Teresa Sullivan, during the summer, students, faculty and alumni continually gathered on the lawn outside the campus&#x2019; Rotunda in protest.</p>\n<p>The community&#x2019;s backlash to Sullivan&#x2019;s ouster played <a href=\"http://usatoday30.usatoday.com/news/education/story/2012-06-26/university-virginia-president-vote/55834364/1\" target=\"_blank\">a key role in her reinstatement</a>. But the controversy also shed light on the challenges that higher education institutions now face, including <a href=\"http://www.usatodayeducate.com/staging/index.php/ccp/fiscal-cliff-would-reduce-student-financial-aid\">rising tuition rates</a> and the transition into the digital age.</p>\n<p>Like the events at UVA, several protests at colleges captured the country&#x2019;s attention this year. Rallies, sit-ins and walkouts prompted nationwide discussion in 2012 about the changes U.S. colleges are undergoing, also calling attention to issues regarding transparency and free speech.</p>\n<p><strong>&#x2022; Cooper Union: Sit-in over possible tuition increase</strong></p>\n<p>Eleven students at Cooper Union collected their belongings and left the eighth floor of the administration building on Dec. 10 after <a href=\"http://cityroom.blogs.nytimes.com/2012/12/10/cooper-union-students-end-occupation-of-suite-after-a-week/\" target=\"_blank\">a weeklong sit-in protesting</a> the possibility of the school charging tuition to undergraduate students.</p>\n<p>To the dismay of many, Cooper Union, a selective New York City college that has granted full-tuition scholarships to its students for the last 110 years, announced in April that it would begin charging tuition to at least some graduate students due to financial strains, <a href=\"http://www.nytimes.com/2012/04/25/nyregion/cooper-union-will-charge-tuition-for-graduate-students.html?_r=0\" target=\"_blank\"><em>The New York Times</em> reported</a>. Students have expressed worry that the school would eventually charge undergraduates tuition too, which led to the sit-in and additional rallies throughout the week.</p>\n<p>The students demanded that the school maintain its commitment to free education and ensure student representation on the board of trustees, also calling for the resignation of university president Jamshed Bharucha. But the university responded in a statement following the sit-in that Cooper Union is &#x201C;continuing the responsible process needed to assure the future of the Cooper Union for generations to come.&#x201D;</p>\n<div class=\"wide-blog-pix\"><img src=\"http://www.usatodayeducate.com/images/crp/630-1212-emorycuts.jpg\"><p class=\"wide-cappy\">By David Goldman, AP</p>\n<p>Students, faculty and staff protest against proposed cuts to several academic programs outside the administrative offices at Emory University on Dec. 4 in Atlanta.</p></div>\n<p><strong>&#x2022; Emory University: Rejecting the cuts</strong></p>\n<p>Emory became embroiled in controversy this semester as the university undergoes academic changes. </p>\n<p>In September, Dean of Emory College Robin Forman and other university administrators announced a plan to &#x201C;phase out&#x201D; visual arts, educational studies and journalism in the college and suspend admission to several programs in the graduate school. The plan is an attempt to reallocate finances and resources at Emory College and the Laney Graduate School and to &#x201C;enhance areas of distinction,&#x201D; the university <a href=\"http://news.emory.edu/stories/2012/09/EmoryCollegePlan/campus.html\" target=\"_blank\">said in a statement</a>.</p>\n<p>Nineteen lecture-track faculty and 20 staff positions will also be eliminated, <a href=\"http://www.emorywheel.com/visual-arts-journalism-educational-studies-p-e-and-russian-econ-spanish-grad-programs-suspended-ila-to-be-downsized/\" target=\"_blank\">reported <em>The Emory Wheel</em></a>, the student-run newspaper.</p>\n<p>In response to the plan, <a href=\"http://stopthecutsemory.wordpress.com/\" target=\"_blank\">the #EmoryCuts movement</a> has called upon the Emory community to &#x201C;reject the cuts&#x201D; due to what its members see as a lack of transparency in the process that led to the decisions. Following several protests this fall, <a href=\"http://www.emorywheel.com/protesters-confront-admins-at-sit-in/\" target=\"_blank\">a Dec. 4 rally</a> consisting of more than 200 protesters on the school&#x2019;s quadrangle resulted in a six-hour sit-in and a three-hour meeting with Emory President James Wagner. </p>\n<p>&#x201C;The event demonstrated that the Emory community cares deeply about both the devastating impact of the cuts and the secretive, highly dubious manner in which they were enacted,&#x201D; said Patrick Blanchfield, an Emory sixth-year comparative literature graduate student and a member of the Student Re-Visioning Committee, a group that has organized dissent.</p>\n<p>Administrators, though, have upheld their decision. They maintain that the plan was the culmination of &#x201C;long process and consultation,&#x201D; the university <a href=\"http://www.emorywheel.com/national-aaup-calls-for-review-of-dept-changes/\" target=\"_blank\">said in a statement</a> to the <em>Wheel</em>.</p>\n<p><strong>&#x2022; University of Mississippi: Racial protest over Obama&#x2019;s election</strong></p>\n<p>When President Obama was re-elected Nov. 6, some U.S. citizens were relieved, others disappointed. But the reaction of a group of University of Mississippi students took the nation by surprise.</p>\n<p>A group of more than 400 students and spectators gathered near the student union to protest <a href=\"http://www.usatodayeducate.com/staging/index.php/election2012/election-2012-what-issues-mattered-the-most-to-student-voters\">Obama&#x2019;s re-election</a>, shouting racial slurs and setting Obama-Biden campaign signs on fire. Officers arrested a student for failing to comply with police orders and another for public intoxication, <a href=\"http://www.usatoday.com/story/news/nation/2012/11/07/ole-miss-chancellor-denounces-protests/1689693/\" target=\"_blank\">USA TODAY reported</a>. The crowd formed after rumors spread on social media that a riot was assembling.</p>\n<p>&#x201C;All of us are ashamed of the few students who have negatively affected the reputations of each of us and of our university,&#x201D; University of Mississippi Chancellor Dan Jones <a href=\"http://news.olemiss.edu/message-chancellor-dan-jones/#.UNHOhonjmAZ\" target=\"_blank\">said in a statement</a>.</p>\n<p>Forty students at Hampden-Sydney College in Virginia <a href=\"http://www.usatoday.com/story/news/nation/2012/12/13/obama-election-virginia-students-racial-slurs/1767429/\" target=\"_blank\">also made headlines</a>, when after Obama&#x2019;s re-election they set off fireworks, broke bottles and yelled racial threats at residents of the Minority Student Union.</p>\n<div class=\"wide-blog-pix\"><img src=\"http://www.usatodayeducate.com/images/crp/630-1212-uvaboard.jpg\"><p class=\"wide-cappy\">By Andrew Shurtleff, AP</p>\n<p>Students and faculty members hold up signs during a Rally for Honor June 24 at the University of Virginia in Charlottesville, Va.</p></div>\n<p><strong>&#x2022; University of Virginia: The ousting of the school&#x2019;s president</strong></p>\n<p>Sullivan&#x2019;s ouster began with an email exchange, <a href=\"http://www.cavalierdaily.com/article/2012/06/rector-vice-rector-emails-and-other-information-obtained-through-freedom-of-information-act/\" target=\"_blank\">documented in the student newspaper <em>The Cavalier Daily</em></a>, between Rector Helen Dragas and Vice Rector Mark Kington, who serve as leaders of UVA&#x2019;s Board of Visitors. They expressed concerns over the university&#x2019;s failure to expand to online education.</p>\n<p>A statement appeared on the school&#x2019;s website on June 10 announcing Sullivan would step down from her position in August, <a href=\"http://news.virginia.edu/node/18786?id=18786%5D%20%5Bhttp://news.virginia.edu/content/rector-dragas-remarks-vps-and-deans\" target=\"_blank\">citing a &#x201C;philosophical difference of opinion&#x201D;</a> between her and the Board of Visitors. Dragas had stated the school needs &#x201C;bold and proactive leadership&#x201D; as higher education evolves, costs rise and federal research funding declines.</p>\n<p>The UVA community made national headlines when it protested Sullivan&#x2019;s removal day after day. More than 20 faculty members stood on the Rotunda steps on June 24, one by one pledging their support of Sullivan as their leader, <a href=\"http://articles.washingtonpost.com/2012-06-24/local/35460206_1_president-teresa-sullivan-helen-e-dragas-board-members\" target=\"_blank\"><em>The Washington Post</em> reported</a>.</p>\n<p>The outcry against Sullivan&#x2019;s ousting demonstrated the community&#x2019;s support of her leadership, prompting Virginia Gov. Bob McDonnell to warn the board that if it failed to fix the problem, he would ask the board&#x2019;s 15 members to step down. In a turn of events, the board <a href=\"http://content.usatoday.com/communities/ondeadline/post/2012/06/uva-president-teresa-sullivan-reinstated/1\" target=\"_blank\">ultimately voted unanimously</a> to reinstate Sullivan as university president on June 26.</p>\n<p><strong>&#x2022; Fordham University: The Ann Coulter question</strong></p>\n<p>When the College Republicans at Fordham University in New York invited outspoken, conservative political commentator Ann Coulter to speak on campus &#x2014; using student activities fees to pay her &#x2014; they immediately faced disapproval from students and administrators alike. Students immediately launched online petitions and <a href=\"https://www.facebook.com/events/174559442684335/\" target=\"_blank\">Facebook groups</a> to express their opposition to Coulter at Fordham.</p>\n<p>&#x201C;We hope that you will stand with us in protest of the Fordham administration&#x2019;s decision on this issue,&#x201D; <a href=\"http://www.change.org/petitions/fordham-university-we-oppose-ann-coulter-speaking-at-fordham\" target=\"_blank\">one online petition stated</a>. &#x201C;We may not be able to change minds, but we hope to at least make our voices heard.&#x201D;</p>\n<p>The president of the university sent out an email, <a href=\"http://www.fordham.edu/Campus_Resources/eNewsroom/topstories_2601.asp\" target=\"_blank\">declaring his opposition</a> to the College Republicans&#x2019; decision. He wrote he is &#x201C;disappointed with the judgment and maturity of the College Republicans.&#x201D; The group, amid a backdrop of controversy, eventually <a href=\"http://www.fordhamobserver.com/college-republicans-cancel-ann-coulter-event/\" target=\"_blank\">canceled the event</a>. </p>\n<p><strong>&#x2022; Pennsylvania State University: Protesting for diversity, tolerance</strong></p>\n<p>Two weeks ago, a photo of Chi Omega sorority members at Penn State wearing sombreros and fake mustaches circulated. The sorority members hosted a Mexican-themed Halloween party this semester, and the <a href=\"http://www.cbsnews.com/8301-201_162-57557555/penn-state-sorority-chi-omega-put-on-probation-for-offensive-picture/\" target=\"_blank\">photo depicted members</a> holding signs reading &#x201C;Will mow lawn for weed + beer&#x201D; and &#x201C;I don&#x2019;t cut grass, I smoke it.&#x201D;</p>\n<p>The photo sparked outrage across campus, and the sorority has since been placed on probation. This week, some students at the school held a silent march to promote tolerance and diversity and increase the recruitment of Latino students at Penn State. </p>\n<p>&#x201C;The incident definitely served as a catalyst for all this but it&#x2019;s not the reason we are doing it,&#x201D; march organizer Manuel Figueroa told CNN. &#x201C;There are grievances to a larger issue that we believe the university should take up.&#x201D;</p>\n\n<h3>Comments</h3><p><comments-count href=\"http://www.usatodayeducate.com/staging/index.php/ccp/6-campus-protests-that-captured-the-nations-attention-in-2012\"></comments-count> comments</p><p>Powered by <a href=\"http://3doordigital.com/wordpress/plugins/facebook-comments/\">Facebook Comments</a></p>\n\n\n<p>The views expressed in this article do not necessarily reflect the views of USA TODAY.</p>\n</div>\n\n\n\n\n\n\n</div>",
    "date_published": null,
    "dek": null,
    "lead_image_url": "http://www.usatodayeducate.com/images/crp/630-1212-emorycuts.jpg",
    "title": "6 campus protests that captured the nation's attention in 2012",
    "rendered_pages": 1
}