{
    "domain": "eastvillage.thelocal.nytimes.com",
    "next_page_id": null,
    "url": "http://eastvillage.thelocal.nytimes.com/2012/12/03/cooper-union-students-barricade-themselves-into-school-building/",
    "short_url": "http://rdd.me/7ep6itrd",
    "author": "ALEXA MAE ASPERIN",
    "excerpt": "Photos: Alexa Mae Asperin A dozen Cooper Union students barricaded themselves inside the school’s Foundation Building earlier today, refusing to leave until their demands for free education are met.&hellip;",
    "direction": "ltr",
    "word_count": 320,
    "total_pages": 0,
    "content": "<div class=\"entry-content\">\n\t\t\t<p><br><small>Photos: Alexa Mae Asperin</small></p>\n<p>A dozen Cooper Union students barricaded themselves inside the school’s Foundation Building earlier today, refusing to leave until their demands for free education are met.</p>\n<p>“We’re trying to bring awareness of the scandal that is happening. The mismanagement by the board is putting us in strains,” said organizer Jake Lee, a fifth-year thesis student in the architecture program of the art and engineering school. </p>\n<p>Students for a Free Cooper Union issued a statement earlier today announcing that they would continue to occupy the Peter Cooper Suite, on the top floor of the building, until President Jamshed Bharucha agreed to resign and the administration agreed to stopped pursuing tuition-based educational programs.<br><span id=\"more-41583\"></span><br>\nMr. Lee told the Local that the twelve students plan to occupy the former conference space “as long as it takes to make sure the demands are met.”  </p>\n<p>Mr. Lee believed an emergency board meeting was called shortly after the failed maneuver, but said he hadn’t been contacted by school officials. Cooper Union could not immediately be reached for comment.</p>\n<p>After several <a href=\"http://eastvillage.thelocal.nytimes.com/2012/04/25/epic-standoff-between-cooper-union-student-and-police/\">high-profile protests</a> earlier this year, the historically tuition-free institution announced in April that it would begin charging graduate students (but not undergraduates) next year. </p>\n<p>In the meantime, Mr. Lee said students are suffering. Art electives for next semester in addition to other courses have been cut, which has led to a decreased need for adjunct professors, he said. </p>\n<p>Olivia Ahn, also a fifth-year architecture student, said it wasn’t fair that classes were being cut despite the school’s lack of dining hall or “state-of-the-art facility.” </p>\n<p>“Education is not of a monetary value, it is beyond that,” Ms. Ahn said. “It’s a principle of our ideals and values we share. A free education allows for more social mobility and egalitarianism.” </p>\n<p>Today’s “day of action” will conclude this evening with a Summit on Debt, featuring speakers, performances and readings addressing the global issue of rising higher education costs. </p>\n\t\t</div>\n\t",
    "date_published": "2012-12-03 18:45:00",
    "dek": null,
    "lead_image_url": null,
    "title": "Protesting Tuition, Students Barricade Themselves Into Cooper Union Building",
    "rendered_pages": 1
}