{
    "domain": "blogs.reuters.com",
    "next_page_id": null,
    "url": "http://blogs.reuters.com/felix-salmon/2013/05/11/are-cooper-unions-finances-fixable/",
    "short_url": "http://rdd.me/csubnou0",
    "author": null,
    "excerpt": "James Stewart has an important column on Cooper Union today: if you read it carefully, it hints at how much further Cooper might yet fall from its founding mission of providing free education.&hellip;",
    "direction": "ltr",
    "word_count": 2077,
    "total_pages": 0,
    "content": "<div><div id=\"postcontent\"><p><a href=\"http://www.nytimes.com/2013/05/11/business/how-cooper-unions-endowment-failed-in-its-mission.html?hp&amp;pagewanted=all\">James Stewart</a> has an important column on Cooper Union today: if you read it carefully, it hints at how much further Cooper might yet fall from its founding mission of providing free education. Cooper&#x2019;s trustees are press-shy these days, but Stewart snagged an on-the-record interview with one of the most important ones: John Michaelson, the chair of the investment committee.</p>\n<p>Stewart chides Michaelson for his reliance on hedge funds, which have not served the Cooper endowment well. In the 2012 fiscal year, for instance, Cooper&#x2019;s returns on its managed endowment were negative: they were down 5%, in a period where a standard mix of 60% stocks and 40% bonds would have returned a positive 8%. And with more than $100 million in hedge fund investments in 2008, Cooper was paying more than $2 million a year in hedge fund management fees alone, never mind performance fees. That&#x2019;s the kind of money the college desperately needs for operational expenses.</p>\n<p>Still, overall, Stewart is far too gentle on Michaelson, who was <a href=\"http://online.wsj.com/article/SB124631610981670647.html\">pictured grinning</a> next to former president George Campbell in a highly-mendacious 2009 WSJ article extolling the performance of the Cooper endowment. Here&#x2019;s how Stewart characterizes the endowment&#x2019;s performance:</p>\n<blockquote><p>Compared with many universities, Cooper Union did a good job managing its endowment through the recent financial crisis. As recently as 2009, the school maintains, it ranked first among all American universities for endowment performance.</p></blockquote>\n<p>In reality, as Stewart never really explains, that &#x201C;endowment performance&#x201D; was entirely fictional &#x2014; it was magicked out of thin air when Michaelson revalued the land under the Chrysler building upwards in order to mask a torrid performance from the rest of the endowment.</p>\n<p>On top of that, Cooper levered up its endowment at exactly the wrong time, borrowing $34 million at an interest rate of 5.875% and investing it in the endowment, where it promptly evaporated during the financial crisis. Michaelson tries to explain this away by saying that the borrowed money was kept in cash, while it was the <em>rest</em> of the endowment which lost money. But if you look at the endowment that way, then, as Stewart points out, hedge funds accounted for more than 60% of the funds Michaelson was managing. That&#x2019;s an insane ratio, especially given that Michaelson was quoted in the <a href=\"http://online.wsj.com/article/SB124631610981670647.html\">WSJ</a> as being &#x201C;especially critical&#x201D; of the Yale Model of investing in illiquid alternative asset classes.</p>\n<p>Stewart also goes easy on the trustees &#x2014; Michaelson foremost among them &#x2014; for making their single biggest mistake: borrowing $166 million to build the grandiose New Academic Building. &#x201C;Hardly anyone disputes Cooper Union&#x2019;s need for new engineering facilities,&#x201D; he writes &#x2014; and he&#x2019;s hilariously, egregiously wrong about that. Virtually <em>everyone</em> outside the Board of Trustees disputed Cooper&#x2019;s need for new engineering facilities &#x2014; even a large chunk of the engineering faculty, which had the most to gain from the new building. The &#x201C;need&#x201D;, it&#x2019;s now abundantly clear, was not a real need at all; instead, it was a device, an excuse to make the decision to construct the new building seem reasonable, even necessary.</p>\n<p>Stewart essentially says that Cooper did need to build something new, it just didn&#x2019;t need to build something quite as grand and expensive as it ended up with. But he&#x2019;s deeply and importantly wrong about that. Here&#x2019;s the thing about mortgages: they&#x2019;re not just free money, they&#x2019;re something you need to pay off, over time. And in order to do that, you need income. When Cooper Union&#x2019;s trustees, including Michaelson, took out a $175 million 30-year fixed-rate mortgage at 5.875%, they knew exactly how much money Cooper would need to repay that mortgage every year.</p>\n<p>And they had <em>no idea</em> where that money was going to come from.</p>\n<p>This &#x2014; much more than any endowment mismanagement &#x2014; was the colossal, fatal error made by Cooper&#x2019;s trustees. There are generally two ways of paying down a mortgage: either you go to work and earn money you then use to pay the mortgage, or else you rent out the building itself and use the income it generates to cover the mortgage payments. Neither route was available to Cooper: all of its income, and then some, was needed to run the school, which meant that there was nothing left over to pay the mortgage. And with the exception of a tiny coffee shop on the ground floor, Cooper isn&#x2019;t renting out any of the new building.</p>\n<p>At the end of Stewart&#x2019;s piece, Michaelson makes a very important admission:</p>\n<blockquote><p>Mr. Michaelson conceded that the school could have continued to invade the endowment to cover deficits and would have survived until 2018, when the higher payments from the Chrysler lease kick in. &#x201C;But what kind of school would you have had by then?&#x201D;</p></blockquote>\n<p>The answer, of course, is <em>a free one;</em> if this really was an option, then the trustees owe the Cooper community a serious, detailed explanation of how and why they ended up making <a href=\"http://blogs.reuters.com/felix-salmon/2013/04/29/the-tragedy-of-cooper-union/\">the decision to charge</a>.</p>\n<p>But the real answer is that while the higher payments from the Chrysler lease would be enough to cover the operating costs of a small, excellent college, they would not be enough to cover Cooper&#x2019;s operating costs <em>and</em> the mortgage payments on the new building. Michaelson is making it sound, here, as though he decided to charge tuition for the sake of the school. In fact, he decided to charge tuition because that&#x2019;s the only way that the school can pay off the monster loan he took out with no conception of how he could ever pay it off.</p>\n<p>What&#x2019;s Michaelson&#x2019;s explanation of where he thought the money for the mortgage payments was going to come from? He doesn&#x2019;t seem to have one, but the closest thing that Stewart finds is a deluded &#x201C;if you build it, they will come&#x201D; mindset:</p>\n<blockquote><p>Trustees told me that the college&#x2019;s development consultants told them that a signature building with a marquee architect &#x2014; in this case, Thom Mayne of Morphosis Architects &#x2014; would attract a large donor eager to have his or her name on a trophy building.</p>\n<p>But no such donor materialized, and experts I consulted said Cooper Union had it backward &#x2014; the first step is to attract the donor, who then is involved in choosing the architect and designing the building. &#x201C;I&#x2019;ve never heard of a case where you build the building first and hope a donor comes along,&#x201D; said Kenneth E. Redd, director of research and policy analysis for the National Association of College and University Business Officers.</p></blockquote>\n<p>Passing the buck like this to anonymous &#x201C;development consultants&#x201D; is just despicable. It was the <em>board</em> which borrowed $175 million without being able to pay it back, not the development consultants. And what&#x2019;s more, it was the board which locked in a fixed 5.875% interest rate for the next 30 years, which isn&#x2019;t the kind of thing you do if you&#x2019;re basically just borrowing money on a short-term basis before a deep-pocketed donor comes along to pay off the mortgage in full.</p>\n<p>And in any case, according to what we now know, once the building had been constructed and no beneficient billionaire had materialized to pay for it, Cooper was financially doomed: it had no ability to pay off the monster mortgage. If that was the case, then why on earth was Michaelson telling the WSJ &#x2014; <em>after</em> the New Academic Building was finished &#x2014; that Cooper&#x2019;s financial condition was positively rosy?</p>\n<p>All of this, however, is stuff we already knew, pretty much. The scariest part of Stewart&#x2019;s article comes with another quote from Michaelson, where he grumbles about the fact that most of Cooper&#x2019;s income comes from the Chrysler Building. (The land under the Chrysler Building was bequeathed to the college by Peter Cooper.)</p>\n<p>Stewart quotes Michaelson as saying that having 84% of the endowment in a single asset &#x201C;is against everything I stand for&#x201D;. He then does a lot of back-of-the-envelope calculations designed to show that maybe Cooper should sell the land under the Chrysler Building, and intimates that the main reason Cooper hasn&#x2019;t done so is the board&#x2019;s &#x201C;nostalgic attachment&#x201D; to the asset.</p>\n<p>On its face, this is completely crazy. The land under the Chrysler Building is worth substantially more to Cooper Union than it is to anybody else, because under a deal that Cooper Union struck with New York City, the college receives more than $18 million per year in something called payments in lieu of taxes, or PILOTs. That&#x2019;s the amount of money that the building would normally generate in property-tax payments for the city; instead, those payments end up going straight to Cooper Union, and New York City gets no property tax revenues at all from the iconic skyscraper.</p>\n<p>If Cooper sold the land under the Chrysler Building, all those property tax payments would revert to New York City, rather than the new owner, and a substantial revenue stream would be effectively destroyed, rather than sold. I don&#x2019;t know what the net present value is of the Chrysler Building&#x2019;s PILOTs, but it&#x2019;s got to be somewhere in the region of half a billion dollars, if not more. It makes no sense whatsoever to give that up for nothing.</p>\n<p>So why is Stewart taking this cockamamie talk seriously, and why is Michaelson talking with a straight face about selling the land under the Chrysler Building? The answer, I fear, is that Cooper Union, in deciding to charge tuition, has given New York City more than enough ammunition to tear up the deal whereby Cooper gets the Chrysler Building&#x2019;s PILOTs.</p>\n<p>Cooper Union <a href=\"https://www.change.org/petitions/students-engaged-in-sit-in-of-the-cooper-union-s-president-s-office-vacate-the-office-immediately\">says</a> that the current <a href=\"http://cusos.org/55-hours/\">occupation</a> of the president&#x2019;s office &#x201C;has created a poisonous and dangerous atmosphere that can potentially destroy the school forever&#x201D;. No one in the administration is going to come out and say explicitly what that means, so let me translate it into English for you: they&#x2019;re saying that the more noise Cooper&#x2019;s students make in protest at the tuition decision, the more likely it is that New York City is going to decide that it wants its property-tax revenues back, and that Cooper Union, without free tuition, is not a worthy enough cause to justify an effective $18 million per year public subsidy.</p>\n<p>If Cooper loses its PILOT payments, then that really would be financially devastating for the college, and it would at that point be effectively forced to liquidate the Chrysler asset, whether it wanted to or not. It seems to me that Michaelson is using Stewart to help lay the groundwork for such an eventuality, and is trying to make the case that selling the Chrysler Building land is not such a dreadful thing to do after all.</p>\n<p>I don&#x2019;t buy it. But looking at what Michaelson says in Stewart&#x2019;s piece, I can&#x2019;t help but wonder whether maybe there is a solution here after all. The problem, remember, is that Cooper can&#x2019;t sell the Chrysler Building land because if it were to do so, the new buyer wouldn&#x2019;t receive those massive PILOT payments. But what if the purchaser of the land were another important civic institution? Could Cooper Union, working with the Bloomberg administration, work out a deal whereby the Chrysler Building land &#x2014; with its PILOTs intact &#x2014; could get sold to Trinity Church, or one of New York&#x2019;s big non-profit hospitals, or even possibly the Bloomberg Foundation? New York has no shortage of massively-endowed foundations and non-profit organizations which have the wherewithal to buy such an asset; many of them might be interested in it.</p>\n<p>It&#x2019;s not clear why New York City would have any particular desire to go along with such a deal, unless they could by doing so claim to have managed to preserve Cooper Union as a tuition-free college embodying Peter Cooper&#x2019;s founding principles. In other words, Cooper&#x2019;s board of trustees would have to go back on their decision to start charging tuition. But the proceeds from selling the Chrysler Building land would be more than enough to pay off the mortgage on the New Academic Building; and at that point, the trustees would just have to work out how many students they could afford to teach on the income from the money left over. Cooper Union would continue to exist, it would continue to be free, and Mike Bloomberg would end up capping his tenure as mayor by saving a noble institution from the brink of disaster. I think Jamshed Bharucha should put in a call, even if he has to do so from his home phone.</p>\n</div>\n\t\t    </div>",
    "date_published": "2013-05-11 00:00:00",
    "dek": null,
    "lead_image_url": "http://blogs.reuters.com/wp-content/themes/reuters_fb_150x150.jpg",
    "title": "Are Cooper Union’s finances fixable?",
    "rendered_pages": 1
}