{
    "domain": "www.newschoolfreepress.com",
    "next_page_id": null,
    "url": "http://www.newschoolfreepress.com/2013/05/19/statement-of-solidarity-and-support-to-students-for-a-free-cooper-union/",
    "short_url": "http://rdd.me/3xynuj5f",
    "author": null,
    "excerpt": "We, The New School University Student Senate, declare our solidarity with the Students for a Free Cooper Union as they take action to preserve tuition-free education, the core value of their&hellip;",
    "direction": "ltr",
    "word_count": 187,
    "total_pages": 0,
    "content": "<div><header>\n\n            \n            \n        </header>\n\n\n        \n\n        \n        <div class=\"td-post-text-content\">\n                  \n      <p dir=\"ltr\">We, The New School University Student Senate, declare our solidarity with the Students for a Free Cooper Union as they take action to preserve tuition-free education, the core value of their institution. We support their efforts to secure the indefinite continuation of Cooper Union&#x2019;s commitment to free education, financial transparency, and student and faculty representation on the Board of Trustees.</p>\n<p dir=\"ltr\">As tuition continues to increase, on average four times faster than the rate of inflation, the issue of academic accessibility has become critical- not just at Cooper Union, but across the United States. New York City alone is home to three of the five most expensive universities in the country. As students facing ever-increasing amounts of debt, we know that this crisis affects the state of our society and how we move forward will determine the sustainability of our academic institutions.</p>\n<p dir=\"ltr\">In gratitude, we write this statement of solidarity, and proclaim that the Cooper Union occupiers do not act alone. As students, we echo their appeal for accessible and enriching education, financial transparency, and the democratization of the institutions we attend.</p>\n<p dir=\"ltr\">In solidarity,</p>\n<p dir=\"ltr\">New School University Student Senate</p>\n        </div>\n\n\n        \n\n        </div>",
    "date_published": "2013-05-19 00:00:00",
    "dek": null,
    "lead_image_url": null,
    "title": "Statement of Solidarity and Support to Students for a Free Cooper Union",
    "rendered_pages": 1
}